; ModuleID = 'spec_mem_io/spec_mem_io.c'
source_filename = "spec_mem_io/spec_mem_io.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.spec_fd_t = type { i64, i64, i64, i32, ptr }
%struct.sha512_state = type { i64, [8 x i64], i32, [128 x i8] }

@dbglvl = dso_local local_unnamed_addr global i32 3, align 4, !dbg !0
@.str = private unnamed_addr constant [52 x i8] c"spec_mem_init(fds=0x%p, fd_limit=%u, touch_all=%d)\0A\00", align 1, !dbg !29
@spec_fd = dso_local local_unnamed_addr global ptr null, align 8, !dbg !343
@stdout = external local_unnamed_addr global ptr, align 8
@stderr = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [59 x i8] c"spec_mem_init: Overflow in requested size (%ld) for fd %d\0A\00", align 1, !dbg !34
@.str.2 = private unnamed_addr constant [56 x i8] c"spec_mem_init: Error mallocing %ld bytes for fd %d@%p!\0A\00", align 1, !dbg !39
@.str.3 = private unnamed_addr constant [50 x i8] c" fd[%d] limit is %ld bytes (%ld bytes allocated)\0A\00", align 1, !dbg !44
@.str.4 = private unnamed_addr constant [41 x i8] c"spec_mem_sum: Only SHA-512 is available\0A\00", align 1, !dbg !49
@.str.5 = private unnamed_addr constant [58 x i8] c"spec_mem_load: couldn't allocate %d chars for SHA-%d sum\0A\00", align 1, !dbg !54

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dbglvl", scope: !2, file: !3, line: 26, type: !9, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !28, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "spec_mem_io/spec_mem_io.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "047cbb8fb8ff391b745246463800d41f")
!4 = !{!5, !6, !8, !7, !9, !10, !13}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_fd_t", file: !15, line: 40, baseType: !16)
!15 = !DIFile(filename: "spec_mem_io/spec_mem_io.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "20f82235716911ab040d2b344ceb3e0d")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 34, size: 320, elements: !17)
!17 = !{!18, !24, !25, !26, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !16, file: !15, line: 35, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !20, line: 27, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !22, line: 44, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!23 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !16, file: !15, line: 36, baseType: !19, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !16, file: !15, line: 37, baseType: !19, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !16, file: !15, line: 38, baseType: !9, size: 32, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !16, file: !15, line: 39, baseType: !6, size: 64, offset: 256)
!28 = !{!0, !29, !34, !39, !44, !49, !54, !59, !64, !69, !74, !79, !84, !89, !94, !96, !101, !106, !108, !113, !118, !120, !125, !130, !135, !140, !145, !150, !155, !160, !165, !170, !172, !174, !179, !181, !186, !188, !193, !195, !197, !202, !207, !209, !211, !213, !218, !223, !225, !230, !232, !237, !239, !241, !246, !248, !253, !258, !260, !262, !264, !266, !268, !270, !272, !277, !279, !281, !283, !285, !287, !289, !294, !299, !301, !303, !305, !310, !312, !314, !319, !324, !326, !331, !333, !338, !343, !345, !347}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !3, line: 71, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 416, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 52)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !3, line: 82, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 472, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 59)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !3, line: 88, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 448, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 56)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !3, line: 92, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 400, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 50)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(scope: null, file: !3, line: 108, type: !51, isLocal: true, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 328, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 41)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !3, line: 133, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 464, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 58)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !3, line: 139, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 616, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 77)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !3, line: 143, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 600, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 75)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !3, line: 153, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 24)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(scope: null, file: !3, line: 174, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 112, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 14)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(scope: null, file: !3, line: 178, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 216, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 27)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(scope: null, file: !3, line: 186, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 368, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 46)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !3, line: 191, type: !91, isLocal: true, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 536, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 67)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !3, line: 192, type: !76, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(scope: null, file: !3, line: 194, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 120, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 15)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !3, line: 196, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 16, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 2)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(scope: null, file: !3, line: 199, type: !31, isLocal: true, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(scope: null, file: !3, line: 203, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 504, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 63)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !3, line: 211, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 184, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 23)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !3, line: 218, type: !115, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !3, line: 227, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 264, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 33)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !3, line: 229, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 488, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 61)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !3, line: 233, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 360, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 45)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !3, line: 238, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 344, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 43)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !3, line: 248, type: !142, isLocal: true, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 4)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(scope: null, file: !3, line: 249, type: !147, isLocal: true, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 352, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 44)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(scope: null, file: !3, line: 255, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 376, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 47)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !3, line: 257, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 496, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 62)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !3, line: 261, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 304, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 38)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !3, line: 265, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 40, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 5)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !3, line: 275, type: !167, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !3, line: 276, type: !132, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !3, line: 282, type: !176, isLocal: true, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 232, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 29)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !3, line: 284, type: !127, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !3, line: 288, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 296, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 37)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !3, line: 297, type: !147, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !3, line: 303, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 312, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 39)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !3, line: 305, type: !110, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !3, line: 309, type: !190, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !3, line: 313, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 248, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 31)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !3, line: 317, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 608, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 76)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !3, line: 321, type: !86, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !3, line: 329, type: !157, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !3, line: 333, type: !86, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !3, line: 339, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 656, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 82)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !3, line: 347, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 256, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 32)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !3, line: 353, type: !190, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !3, line: 359, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 56, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 7)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !220, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !3, line: 370, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 280, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 35)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !3, line: 373, type: !132, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !3, line: 379, type: !132, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !3, line: 382, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 320, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 40)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !3, line: 392, type: !51, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !3, line: 414, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 336, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 42)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !3, line: 430, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 528, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 66)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !3, line: 432, type: !157, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !3, line: 436, type: !86, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !3, line: 441, type: !98, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !3, line: 447, type: !56, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !3, line: 452, type: !66, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !3, line: 454, type: !110, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !3, line: 458, type: !190, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !3, line: 462, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 16)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !3, line: 468, type: !56, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !3, line: 473, type: !31, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !3, line: 475, type: !127, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !3, line: 479, type: !183, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !3, line: 485, type: !142, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !3, line: 486, type: !147, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !3, line: 492, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 456, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 57)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !3, line: 495, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 688, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 86)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !3, line: 501, type: !157, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !3, line: 505, type: !183, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !3, line: 575, type: !167, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !3, line: 612, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 424, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 53)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !3, line: 630, type: !157, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !3, line: 642, type: !71, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !3, line: 642, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 12)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !3, line: 642, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 88, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 11)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !3, line: 646, type: !307, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !3, line: 651, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 240, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 30)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !3, line: 660, type: !115, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !3, line: 660, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 8)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !3, line: 661, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 208, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 26)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "spec_fd", scope: !2, file: !3, line: 22, type: !13, isLocal: false, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !3, line: 588, type: !137, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !3, line: 592, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 288, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 36)
!352 = !{i32 7, !"Dwarf Version", i32 5}
!353 = !{i32 2, !"Debug Info Version", i32 3}
!354 = !{i32 1, !"wchar_size", i32 4}
!355 = !{i32 8, !"PIC Level", i32 2}
!356 = !{i32 7, !"PIE Level", i32 2}
!357 = !{i32 7, !"uwtable", i32 2}
!358 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!359 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!360 = distinct !DISubprogram(name: "spec_mem_init", scope: !3, file: !3, line: 67, type: !361, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !363)
!361 = !DISubroutineType(types: !362)
!362 = !{!9, !13, !8, !8}
!363 = !{!364, !365, !366, !367, !368, !369}
!364 = !DILocalVariable(name: "fds", arg: 1, scope: !360, file: !3, line: 67, type: !13)
!365 = !DILocalVariable(name: "fd_limit", arg: 2, scope: !360, file: !3, line: 67, type: !8)
!366 = !DILocalVariable(name: "touch_all", arg: 3, scope: !360, file: !3, line: 67, type: !8)
!367 = !DILocalVariable(name: "i", scope: !360, file: !3, line: 68, type: !8)
!368 = !DILocalVariable(name: "j", scope: !360, file: !3, line: 69, type: !19)
!369 = !DILocalVariable(name: "limit", scope: !370, file: !3, line: 77, type: !19)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 76, column: 36)
!371 = distinct !DILexicalBlock(scope: !372, file: !3, line: 76, column: 5)
!372 = distinct !DILexicalBlock(scope: !360, file: !3, line: 76, column: 5)
!373 = !DILocation(line: 0, scope: !360)
!374 = !DILocation(line: 71, column: 5, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !3, line: 71, column: 5)
!376 = distinct !DILexicalBlock(scope: !360, file: !3, line: 71, column: 5)
!377 = !DILocation(line: 71, column: 5, scope: !376)
!378 = !DILocation(line: 71, column: 5, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !3, line: 71, column: 5)
!380 = !DILocation(line: 76, column: 19, scope: !371)
!381 = !DILocation(line: 76, column: 5, scope: !372)
!382 = !DILocation(line: 77, column: 18, scope: !370)
!383 = !DILocation(line: 77, column: 25, scope: !370)
!384 = !DILocation(line: 0, scope: !370)
!385 = !DILocation(line: 78, column: 9, scope: !370)
!386 = !DILocation(line: 79, column: 15, scope: !370)
!387 = !DILocation(line: 81, column: 12, scope: !388)
!388 = distinct !DILexicalBlock(scope: !370, file: !3, line: 81, column: 6)
!389 = !DILocation(line: 81, column: 6, scope: !370)
!390 = !DILocation(line: 86, column: 44, scope: !370)
!391 = !DILocation(line: 86, column: 32, scope: !370)
!392 = !DILocation(line: 86, column: 9, scope: !370)
!393 = !DILocation(line: 86, column: 13, scope: !370)
!394 = !DILocation(line: 87, column: 17, scope: !395)
!395 = distinct !DILexicalBlock(scope: !370, file: !3, line: 87, column: 6)
!396 = !DILocation(line: 87, column: 6, scope: !370)
!397 = !DILocation(line: 92, column: 9, scope: !398)
!398 = distinct !DILexicalBlock(scope: !399, file: !3, line: 92, column: 9)
!399 = distinct !DILexicalBlock(scope: !370, file: !3, line: 92, column: 9)
!400 = !DILocation(line: 92, column: 9, scope: !399)
!401 = !DILocation(line: 92, column: 9, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !3, line: 92, column: 9)
!403 = !DILocation(line: 76, column: 32, scope: !371)
!404 = distinct !{!404, !381, !405}
!405 = !DILocation(line: 97, column: 5, scope: !372)
!406 = !DILocation(line: 82, column: 14, scope: !407)
!407 = distinct !DILexicalBlock(scope: !388, file: !3, line: 81, column: 17)
!408 = !DILocation(line: 82, column: 98, scope: !407)
!409 = !DILocation(line: 82, column: 6, scope: !407)
!410 = !DILocation(line: 83, column: 6, scope: !407)
!411 = !DILocation(line: 88, column: 14, scope: !412)
!412 = distinct !DILexicalBlock(scope: !395, file: !3, line: 87, column: 26)
!413 = !DILocation(line: 88, column: 6, scope: !412)
!414 = !DILocation(line: 89, column: 6, scope: !412)
!415 = !DILocation(line: 94, column: 27, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !3, line: 94, column: 13)
!417 = distinct !DILexicalBlock(scope: !418, file: !3, line: 94, column: 13)
!418 = distinct !DILexicalBlock(scope: !370, file: !3, line: 93, column: 13)
!419 = !DILocation(line: 94, column: 13, scope: !417)
!420 = !DILocation(line: 95, column: 24, scope: !421)
!421 = distinct !DILexicalBlock(scope: !416, file: !3, line: 94, column: 47)
!422 = !DILocation(line: 95, column: 17, scope: !421)
!423 = !DILocation(line: 95, column: 31, scope: !421)
!424 = !DILocation(line: 94, column: 38, scope: !416)
!425 = distinct !{!425, !419, !426}
!426 = !DILocation(line: 96, column: 13, scope: !417)
!427 = !DILocation(line: 98, column: 5, scope: !360)
!428 = !DISubprogram(name: "printf", scope: !429, file: !429, line: 356, type: !430, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!429 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!430 = !DISubroutineType(types: !431)
!431 = !{!9, !432, null}
!432 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!435 = !DISubprogram(name: "fflush", scope: !429, file: !429, line: 230, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!436 = !DISubroutineType(types: !437)
!437 = !{!9, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !440, line: 7, baseType: !441)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !442, line: 49, size: 1728, elements: !443)
!442 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !459, !461, !462, !463, !465, !467, !469, !473, !476, !478, !481, !484, !485, !486, !490, !491}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !441, file: !442, line: 51, baseType: !9, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !441, file: !442, line: 54, baseType: !11, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !441, file: !442, line: 55, baseType: !11, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !441, file: !442, line: 56, baseType: !11, size: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !441, file: !442, line: 57, baseType: !11, size: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !441, file: !442, line: 58, baseType: !11, size: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !441, file: !442, line: 59, baseType: !11, size: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !441, file: !442, line: 60, baseType: !11, size: 64, offset: 448)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !441, file: !442, line: 61, baseType: !11, size: 64, offset: 512)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !441, file: !442, line: 64, baseType: !11, size: 64, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !441, file: !442, line: 65, baseType: !11, size: 64, offset: 640)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !441, file: !442, line: 66, baseType: !11, size: 64, offset: 704)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !441, file: !442, line: 68, baseType: !457, size: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !442, line: 36, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !441, file: !442, line: 70, baseType: !460, size: 64, offset: 832)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !441, file: !442, line: 72, baseType: !9, size: 32, offset: 896)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !441, file: !442, line: 73, baseType: !9, size: 32, offset: 928)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !441, file: !442, line: 74, baseType: !464, size: 64, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 152, baseType: !23)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !441, file: !442, line: 77, baseType: !466, size: 16, offset: 1024)
!466 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !441, file: !442, line: 78, baseType: !468, size: 8, offset: 1040)
!468 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !441, file: !442, line: 79, baseType: !470, size: 8, offset: 1048)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 1)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !441, file: !442, line: 81, baseType: !474, size: 64, offset: 1088)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !442, line: 43, baseType: null)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !441, file: !442, line: 89, baseType: !477, size: 64, offset: 1152)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 153, baseType: !23)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !441, file: !442, line: 91, baseType: !479, size: 64, offset: 1216)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !442, line: 37, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !441, file: !442, line: 92, baseType: !482, size: 64, offset: 1280)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !442, line: 38, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !441, file: !442, line: 93, baseType: !460, size: 64, offset: 1344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !441, file: !442, line: 94, baseType: !5, size: 64, offset: 1408)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !441, file: !442, line: 95, baseType: !487, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !488, line: 18, baseType: !489)
!488 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!489 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !441, file: !442, line: 96, baseType: !9, size: 32, offset: 1536)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !441, file: !442, line: 98, baseType: !492, size: 160, offset: 1568)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 20)
!495 = !DISubprogram(name: "fprintf", scope: !429, file: !429, line: 350, type: !496, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!496 = !DISubroutineType(types: !497)
!497 = !{!9, !498, !432, null}
!498 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !438)
!499 = !DISubprogram(name: "exit", scope: !500, file: !500, line: 624, type: !501, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!500 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!501 = !DISubroutineType(types: !502)
!502 = !{null, !9}
!503 = !DISubprogram(name: "malloc", scope: !500, file: !500, line: 540, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DISubroutineType(types: !505)
!505 = !{!5, !487}
!506 = distinct !DISubprogram(name: "spec_mem_sum", scope: !3, file: !3, line: 101, type: !507, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!6, !13, !6, !9}
!509 = !{!510, !511, !512, !513, !531, !532}
!510 = !DILocalVariable(name: "fd", arg: 1, scope: !506, file: !3, line: 101, type: !13)
!511 = !DILocalVariable(name: "sum", arg: 2, scope: !506, file: !3, line: 101, type: !6)
!512 = !DILocalVariable(name: "bits", arg: 3, scope: !506, file: !3, line: 101, type: !9)
!513 = !DILocalVariable(name: "ctx", scope: !506, file: !3, line: 102, type: !514)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "sha512_state", file: !515, line: 13, baseType: !516)
!515 = !DIFile(filename: "sha-2/sha512.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a9972f2f4bb45d8b6de350a024786c")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !515, line: 7, size: 1664, elements: !517)
!517 = !{!518, !522, !524, !527}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !516, file: !515, line: 9, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !520, line: 27, baseType: !521)
!520 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !22, line: 45, baseType: !489)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !516, file: !515, line: 10, baseType: !523, size: 512, offset: 64)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 512, elements: !336)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "curlen", scope: !516, file: !515, line: 11, baseType: !525, size: 32, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !520, line: 26, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !22, line: 42, baseType: !8)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !516, file: !515, line: 12, baseType: !528, size: 1024, offset: 608)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 128)
!531 = !DILocalVariable(name: "currpos", scope: !506, file: !3, line: 103, type: !19)
!532 = !DILocalVariable(name: "chunk", scope: !506, file: !3, line: 104, type: !23)
!533 = distinct !DIAssignID()
!534 = !DILocation(line: 0, scope: !506)
!535 = !DILocation(line: 102, column: 5, scope: !506)
!536 = !DILocation(line: 107, column: 14, scope: !537)
!537 = distinct !DILexicalBlock(scope: !506, file: !3, line: 107, column: 9)
!538 = !DILocation(line: 107, column: 9, scope: !506)
!539 = !DILocation(line: 108, column: 15, scope: !540)
!540 = distinct !DILexicalBlock(scope: !537, file: !3, line: 107, column: 22)
!541 = !DILocation(line: 108, column: 7, scope: !540)
!542 = !DILocation(line: 109, column: 7, scope: !540)
!543 = !DILocation(line: 112, column: 13, scope: !544)
!544 = distinct !DILexicalBlock(scope: !506, file: !3, line: 112, column: 9)
!545 = !DILocation(line: 112, column: 9, scope: !506)
!546 = !DILocation(line: 113, column: 9, scope: !547)
!547 = distinct !DILexicalBlock(scope: !544, file: !3, line: 112, column: 22)
!548 = !DILocation(line: 114, column: 59, scope: !549)
!549 = distinct !DILexicalBlock(scope: !550, file: !3, line: 114, column: 9)
!550 = distinct !DILexicalBlock(scope: !547, file: !3, line: 114, column: 9)
!551 = !DILocation(line: 114, column: 53, scope: !549)
!552 = !DILocation(line: 114, column: 9, scope: !550)
!553 = !DILocation(line: 115, column: 25, scope: !554)
!554 = distinct !DILexicalBlock(scope: !555, file: !3, line: 115, column: 17)
!555 = distinct !DILexicalBlock(scope: !549, file: !3, line: 114, column: 82)
!556 = !DILocation(line: 115, column: 17, scope: !555)
!557 = !DILocation(line: 117, column: 35, scope: !555)
!558 = !DILocation(line: 117, column: 39, scope: !555)
!559 = !DILocation(line: 117, column: 50, scope: !555)
!560 = !DILocation(line: 117, column: 13, scope: !555)
!561 = !DILocation(line: 114, column: 72, scope: !549)
!562 = distinct !{!562, !552, !563}
!563 = !DILocation(line: 118, column: 9, scope: !550)
!564 = !DILocation(line: 119, column: 9, scope: !547)
!565 = !DILocation(line: 120, column: 5, scope: !547)
!566 = !DILocation(line: 122, column: 1, scope: !506)
!567 = !DILocation(line: 121, column: 5, scope: !506)
!568 = !DISubprogram(name: "sha_init", scope: !515, file: !515, line: 15, type: !569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!572 = !DISubprogram(name: "sha_process", scope: !515, file: !515, line: 16, type: !573, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !571, !575, !525}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!577 = !DISubprogram(name: "sha_done", scope: !515, file: !515, line: 17, type: !578, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !571, !5}
!580 = distinct !DISubprogram(name: "spec_mem_load", scope: !3, file: !3, line: 124, type: !581, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{!6, !13, !8, !9, !11, !19, !9, !6, !9}
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!584 = !DILocalVariable(name: "fds", arg: 1, scope: !580, file: !3, line: 124, type: !13)
!585 = !DILocalVariable(name: "fd_limit", arg: 2, scope: !580, file: !3, line: 124, type: !8)
!586 = !DILocalVariable(name: "num", arg: 3, scope: !580, file: !3, line: 124, type: !9)
