; ModuleID = 'liblzma/common/auto_decoder.c'
source_filename = "liblzma/common/auto_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_auto_decoder(ptr noundef %strm, i64 noundef %memlimit, i32 noundef %flags) local_unnamed_addr #0 !dbg !157 {
entry:
    #dbg_value(ptr %strm, !186, !DIExpression(), !194)
    #dbg_value(i64 %memlimit, !187, !DIExpression(), !194)
    #dbg_value(i32 %flags, !188, !DIExpression(), !194)
  %call = tail call i32 @lzma_strm_init(ptr noundef %strm) #3, !dbg !195
    #dbg_value(i32 %call, !189, !DIExpression(), !196)
  %cmp.not.not = icmp eq i32 %call, 0, !dbg !197
  br i1 %cmp.not.not, label %do.end, label %return

do.end:                                           ; preds = %entry
  %internal = getelementptr inbounds i8, ptr %strm, i64 56, !dbg !199
  %0 = load ptr, ptr %internal, align 8, !dbg !199
  %allocator = getelementptr inbounds i8, ptr %strm, i64 48, !dbg !199
  %1 = load ptr, ptr %allocator, align 8, !dbg !199
    #dbg_value(ptr %0, !200, !DIExpression(), !209)
    #dbg_value(ptr %1, !206, !DIExpression(), !209)
    #dbg_value(i64 %memlimit, !207, !DIExpression(), !209)
    #dbg_value(i32 %flags, !208, !DIExpression(), !209)
  %init.i = getelementptr inbounds i8, ptr %0, i64 16, !dbg !211
  %2 = load i64, ptr %init.i, align 8, !dbg !211

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !147, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/auto_decoder.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "068df4f0ac82120f07aa061486068a40")
!2 = !{!3, !19, !25, !32, !131, !134}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !34, file: !33, line: 187, baseType: !5, size: 32, elements: !124)
!33 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !33, line: 179, size: 704, elements: !35)
!35 = !{!36, !116, !117, !118, !123}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 181, baseType: !37, size: 512)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !33, line: 80, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !33, line: 124, size: 512, elements: !39)
!39 = !{!40, !43, !51, !54, !87, !92, !99, !104}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !38, file: !33, line: 126, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !33, line: 78, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !38, file: !33, line: 130, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !45, line: 63, baseType: !46)
!45 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 27, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !49, line: 45, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!50 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !38, file: !33, line: 136, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !53, line: 90, baseType: !50)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !38, file: !33, line: 139, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !33, line: 94, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !41, !60, !76, !82, !69, !84, !82, !69, !86}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !63)
!63 = !{!64, !71, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !62, file: !4, line: 376, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !68, !69, !69}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 18, baseType: !50)
!70 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !62, file: !4, line: 390, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !68, !68}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !62, file: !4, line: 401, baseType: !68, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !47, line: 24, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !49, line: 38, baseType: !81)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !38, file: !33, line: 144, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !33, line: 102, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !41, !60}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !38, file: !33, line: 148, baseType: !93, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !38, file: !33, line: 152, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!59, !41, !103, !103, !46}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !38, file: !33, line: 157, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!59, !41, !60, !108, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !111, line: 65, baseType: !112)
!111 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 43, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !111, line: 54, baseType: !44, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !112, file: !111, line: 63, baseType: !68, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !34, file: !33, line: 194, baseType: !32, size: 32, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !34, file: !33, line: 199, baseType: !69, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !34, file: !33, line: 202, baseType: !119, size: 32, offset: 640)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 32, elements: !121)
!120 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!121 = !{!122}
!122 = !DISubrange(count: 4)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !34, file: !33, line: 206, baseType: !120, size: 8, offset: 672)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!126 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!127 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!128 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!129 = !DIEnumerator(name: "ISEQ_END", value: 4)
!130 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !132)
!132 = !{!133}
!133 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !135, file: !1, line: 24, baseType: !5, size: 32, elements: !143)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 17, size: 640, elements: !136)
!136 = !{!137, !138, !139, !142}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !1, line: 19, baseType: !37, size: 512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "memlimit", scope: !135, file: !1, line: 21, baseType: !46, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !135, file: !1, line: 22, baseType: !140, size: 32, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 26, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !49, line: 42, baseType: !5)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !135, file: !1, line: 28, baseType: !134, size: 32, offset: 608)
!143 = !{!144, !145, !146}
!144 = !DIEnumerator(name: "SEQ_INIT", value: 0)
!145 = !DIEnumerator(name: "SEQ_CODE", value: 1)
!146 = !DIEnumerator(name: "SEQ_FINISH", value: 2)
!147 = !{!52, !68, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!149 = !{i32 7, !"Dwarf Version", i32 5}
!150 = !{i32 2, !"Debug Info Version", i32 3}
!151 = !{i32 1, !"wchar_size", i32 4}
!152 = !{i32 8, !"PIC Level", i32 2}
!153 = !{i32 7, !"PIE Level", i32 2}
!154 = !{i32 7, !"uwtable", i32 2}
!155 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!156 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!157 = distinct !DISubprogram(name: "lzma_auto_decoder", scope: !1, file: !1, line: 182, type: !158, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !185)
!158 = !DISubroutineType(types: !159)
!159 = !{!59, !160, !46, !140}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, elements: !163)
!163 = !{!164, !165, !166, !167, !168, !169, !170, !171, !174, !175, !176, !177, !178, !179, !180, !181, !182, !184}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !162, file: !4, line: 454, baseType: !77, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !162, file: !4, line: 455, baseType: !69, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !162, file: !4, line: 456, baseType: !46, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !162, file: !4, line: 458, baseType: !85, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !162, file: !4, line: 459, baseType: !69, size: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !162, file: !4, line: 460, baseType: !46, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !162, file: !4, line: 468, baseType: !60, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !162, file: !4, line: 471, baseType: !172, size: 64, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !34)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !162, file: !4, line: 479, baseType: !68, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !162, file: !4, line: 480, baseType: !68, size: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !162, file: !4, line: 481, baseType: !68, size: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !162, file: !4, line: 482, baseType: !68, size: 64, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !162, file: !4, line: 483, baseType: !46, size: 64, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !162, file: !4, line: 484, baseType: !46, size: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !162, file: !4, line: 485, baseType: !69, size: 64, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !162, file: !4, line: 486, baseType: !69, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !162, file: !4, line: 487, baseType: !183, size: 32, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !131)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !162, file: !4, line: 488, baseType: !183, size: 32, offset: 1056)
!185 = !{!186, !187, !188, !189, !193}
!186 = !DILocalVariable(name: "strm", arg: 1, scope: !157, file: !1, line: 182, type: !160)
!187 = !DILocalVariable(name: "memlimit", arg: 2, scope: !157, file: !1, line: 182, type: !46)
!188 = !DILocalVariable(name: "flags", arg: 3, scope: !157, file: !1, line: 182, type: !140)
!189 = !DILocalVariable(name: "ret_", scope: !190, file: !1, line: 184, type: !192)
!190 = distinct !DILexicalBlock(scope: !191, file: !1, line: 184, column: 2)
!191 = distinct !DILexicalBlock(scope: !157, file: !1, line: 184, column: 2)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!193 = !DILocalVariable(name: "ret_", scope: !191, file: !1, line: 184, type: !192)
!194 = !DILocation(line: 0, scope: !157)
!195 = !DILocation(line: 184, column: 2, scope: !190)
!196 = !DILocation(line: 0, scope: !190)
!197 = !DILocation(line: 184, column: 2, scope: !198)
!198 = distinct !DILexicalBlock(scope: !190, file: !1, line: 184, column: 2)
!199 = !DILocation(line: 184, column: 2, scope: !191)
!200 = !DILocalVariable(name: "next", arg: 1, scope: !201, file: !1, line: 150, type: !204)
!201 = distinct !DISubprogram(name: "auto_decoder_init", scope: !1, file: !1, line: 150, type: !202, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !205)
!202 = !DISubroutineType(types: !203)
!203 = !{!59, !204, !60, !46, !140}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!205 = !{!200, !206, !207, !208}
!206 = !DILocalVariable(name: "allocator", arg: 2, scope: !201, file: !1, line: 150, type: !60)
!207 = !DILocalVariable(name: "memlimit", arg: 3, scope: !201, file: !1, line: 151, type: !46)
!208 = !DILocalVariable(name: "flags", arg: 4, scope: !201, file: !1, line: 151, type: !140)
!209 = !DILocation(line: 0, scope: !201, inlinedAt: !210)
!210 = distinct !DILocation(line: 184, column: 2, scope: !191)
!211 = !DILocation(line: 153, column: 2, scope: !212, inlinedAt: !210)
!212 = distinct !DILexicalBlock(scope: !213, file: !1, line: 153, column: 2)
!213 = distinct !DILexicalBlock(scope: !201, file: !1, line: 153, column: 2)
!214 = !DILocation(line: 153, column: 2, scope: !213, inlinedAt: !210)
!215 = !DILocation(line: 155, column: 15, scope: !216, inlinedAt: !210)
!216 = distinct !DILexicalBlock(scope: !201, file: !1, line: 155, column: 6)
!217 = !DILocation(line: 155, column: 6, scope: !201, inlinedAt: !210)
!218 = !DILocation(line: 158, column: 12, scope: !219, inlinedAt: !210)
!219 = distinct !DILexicalBlock(scope: !201, file: !1, line: 158, column: 6)
!220 = !DILocation(line: 158, column: 6, scope: !201, inlinedAt: !210)
!221 = !DILocation(line: 161, column: 12, scope: !222, inlinedAt: !210)
!222 = distinct !DILexicalBlock(scope: !201, file: !1, line: 161, column: 6)
!223 = !DILocation(line: 161, column: 18, scope: !222, inlinedAt: !210)
!224 = !DILocation(line: 161, column: 6, scope: !201, inlinedAt: !210)
!225 = !DILocation(line: 162, column: 17, scope: !226, inlinedAt: !210)
!226 = distinct !DILexicalBlock(scope: !222, file: !1, line: 161, column: 27)
!227 = !DILocation(line: 162, column: 15, scope: !226, inlinedAt: !210)
!228 = !DILocation(line: 163, column: 19, scope: !229, inlinedAt: !210)
!229 = distinct !DILexicalBlock(scope: !226, file: !1, line: 163, column: 7)
!230 = !DILocation(line: 163, column: 7, scope: !226, inlinedAt: !210)
!231 = !DILocation(line: 166, column: 9, scope: !226, inlinedAt: !210)
!232 = !DILocation(line: 166, column: 14, scope: !226, inlinedAt: !210)
!233 = !DILocation(line: 167, column: 9, scope: !226, inlinedAt: !210)
!234 = !DILocation(line: 167, column: 13, scope: !226, inlinedAt: !210)
!235 = !DILocation(line: 168, column: 9, scope: !226, inlinedAt: !210)
!236 = !DILocation(line: 168, column: 19, scope: !226, inlinedAt: !210)
