; ModuleID = 'liblzma/common/common.c'
source_filename = "liblzma/common/common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [22 x i8] c"5.0.5benchmarkcpu2017\00", align 1, !dbg !0

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn memory(none) uwtable
define dso_local noundef i32 @lzma_version_number() local_unnamed_addr #0 !dbg !150 {
entry:
  ret i32 50000056, !dbg !155
}

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn memory(none) uwtable
define dso_local noundef nonnull ptr @lzma_version_string() local_unnamed_addr #0 !dbg !156 {
entry:
  ret ptr @.str, !dbg !161
}

; Function Attrs: nounwind uwtable
define dso_local ptr @lzma_alloc(i64 noundef %size, ptr noundef readonly %allocator) local_unnamed_addr #1 !dbg !162 {
entry:
    #dbg_value(i64 %size, !166, !DIExpression(), !169)
    #dbg_value(ptr %allocator, !167, !DIExpression(), !169)
  %spec.store.select = tail call i64 @llvm.umax.i64(i64 %size, i64 1), !dbg !170
    #dbg_value(i64 %spec.store.select, !166, !DIExpression(), !169)
  %cmp1.not = icmp eq ptr %allocator, null, !dbg !171
  br i1 %cmp1.not, label %if.else, label %land.lhs.true, !dbg !173

land.lhs.true:                                    ; preds = %entry
  %0 = load ptr, ptr %allocator, align 8, !dbg !174
  %cmp2.not = icmp eq ptr %0, null, !dbg !175

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 30, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "liblzma/common/common.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "4324f888732c15afaa7e948651790b3b")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 22)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !140, globals: !141, splitDebugInlining: false, nameTableKind: None)
!8 = !{!9, !25, !31, !38, !137}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 57, baseType: !11, size: 32, elements: !12)
!10 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!13 = !DIEnumerator(name: "LZMA_OK", value: 0)
!14 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!15 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!16 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!17 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!18 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!19 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!20 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!21 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!22 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!23 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!24 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 250, baseType: !11, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!28 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!29 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!30 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 27, baseType: !11, size: 32, elements: !33)
!32 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!35 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!36 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!37 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !40, file: !39, line: 187, baseType: !11, size: 32, elements: !130)
!39 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !39, line: 179, size: 704, elements: !41)
!41 = !{!42, !122, !123, !124, !129}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 181, baseType: !43, size: 512)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !39, line: 80, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !39, line: 124, size: 512, elements: !45)
!45 = !{!46, !49, !57, !60, !93, !98, !105, !110}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !44, file: !39, line: 126, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !39, line: 78, baseType: null)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !44, file: !39, line: 130, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !51, line: 63, baseType: !52)
!51 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !53, line: 27, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !55, line: 45, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!56 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !44, file: !39, line: 136, baseType: !58, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !59, line: 90, baseType: !56)
!59 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!60 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !44, file: !39, line: 139, baseType: !61, size: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !39, line: 94, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !47, !66, !82, !88, !75, !90, !88, !75, !92}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !10, line: 237, baseType: !9)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !10, line: 403, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 341, size: 192, elements: !69)
!69 = !{!70, !77, !81}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !68, file: !10, line: 376, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !74, !75, !75}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 18, baseType: !56)
!76 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !68, file: !10, line: 390, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !74, !74}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !68, file: !10, line: 401, baseType: !74, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !53, line: 24, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !55, line: 38, baseType: !87)
!87 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!88 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !10, line: 322, baseType: !25)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !44, file: !39, line: 144, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !39, line: 102, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !47, !66}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !44, file: !39, line: 148, baseType: !99, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !32, line: 55, baseType: !31)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !44, file: !39, line: 152, baseType: !106, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!65, !47, !109, !109, !52}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !44, file: !39, line: 157, baseType: !111, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!65, !47, !66, !114, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !117, line: 65, baseType: !118)
!117 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 43, size: 128, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !118, file: !117, line: 54, baseType: !50, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !118, file: !117, line: 63, baseType: !74, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !40, file: !39, line: 194, baseType: !38, size: 32, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !40, file: !39, line: 199, baseType: !75, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !40, file: !39, line: 202, baseType: !125, size: 32, offset: 640)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 32, elements: !127)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !{!128}
!128 = !DISubrange(count: 4)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !40, file: !39, line: 206, baseType: !126, size: 8, offset: 672)
!130 = !{!131, !132, !133, !134, !135, !136}
!131 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!132 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!133 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!134 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!135 = !DIEnumerator(name: "ISEQ_END", value: 4)
!136 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 44, baseType: !11, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!140 = !{!74, !58, !11}
!141 = !{!0}
!142 = !{i32 7, !"Dwarf Version", i32 5}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{i32 1, !"wchar_size", i32 4}
!145 = !{i32 8, !"PIC Level", i32 2}
!146 = !{i32 7, !"PIE Level", i32 2}
!147 = !{i32 7, !"uwtable", i32 2}
!148 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!149 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!150 = distinct !DISubprogram(name: "lzma_version_number", scope: !2, file: !2, line: 21, type: !151, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7)
!151 = !DISubroutineType(types: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !53, line: 26, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !55, line: 42, baseType: !11)
!155 = !DILocation(line: 23, column: 2, scope: !150)
!156 = distinct !DISubprogram(name: "lzma_version_string", scope: !2, file: !2, line: 28, type: !157, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7)
!157 = !DISubroutineType(types: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!161 = !DILocation(line: 30, column: 2, scope: !156)
!162 = distinct !DISubprogram(name: "lzma_alloc", scope: !2, file: !2, line: 39, type: !163, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{!74, !75, !66}
!165 = !{!166, !167, !168}
!166 = !DILocalVariable(name: "size", arg: 1, scope: !162, file: !2, line: 39, type: !75)
!167 = !DILocalVariable(name: "allocator", arg: 2, scope: !162, file: !2, line: 39, type: !66)
!168 = !DILocalVariable(name: "ptr", scope: !162, file: !2, line: 45, type: !74)
!169 = !DILocation(line: 0, scope: !162)
!170 = !DILocation(line: 42, column: 6, scope: !162)
!171 = !DILocation(line: 47, column: 16, scope: !172)
!172 = distinct !DILexicalBlock(scope: !162, file: !2, line: 47, column: 6)
!173 = !DILocation(line: 47, column: 24, scope: !172)
!174 = !DILocation(line: 47, column: 38, scope: !172)
!175 = !DILocation(line: 47, column: 44, scope: !172)
!176 = !DILocation(line: 47, column: 6, scope: !162)
!177 = !DILocation(line: 48, column: 37, scope: !172)
!178 = !DILocation(line: 48, column: 9, scope: !172)
!179 = !DILocation(line: 48, column: 3, scope: !172)
!180 = !DILocation(line: 50, column: 9, scope: !172)
!181 = !DILocation(line: 0, scope: !172)
!182 = !DILocation(line: 52, column: 2, scope: !162)
!183 = !DISubprogram(name: "malloc", scope: !184, file: !184, line: 540, type: !185, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!184 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!185 = !DISubroutineType(types: !186)
!186 = !{!74, !75}
!187 = distinct !DISubprogram(name: "lzma_free", scope: !2, file: !2, line: 57, type: !188, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !190)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !74, !66}
!190 = !{!191, !192}
!191 = !DILocalVariable(name: "ptr", arg: 1, scope: !187, file: !2, line: 57, type: !74)
!192 = !DILocalVariable(name: "allocator", arg: 2, scope: !187, file: !2, line: 57, type: !66)
!193 = !DILocation(line: 0, scope: !187)
!194 = !DILocation(line: 59, column: 16, scope: !195)
!195 = distinct !DILexicalBlock(scope: !187, file: !2, line: 59, column: 6)
!196 = !DILocation(line: 59, column: 24, scope: !195)
!197 = !DILocation(line: 59, column: 38, scope: !195)
!198 = !DILocation(line: 59, column: 43, scope: !195)
!199 = !DILocation(line: 59, column: 6, scope: !187)
!200 = !DILocation(line: 60, column: 30, scope: !195)
!201 = !DILocation(line: 60, column: 3, scope: !195)
!202 = !DILocation(line: 62, column: 3, scope: !195)
!203 = !DILocation(line: 64, column: 2, scope: !187)
!204 = !DISubprogram(name: "free", scope: !184, file: !184, line: 555, type: !205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !74}
!207 = distinct !DISubprogram(name: "lzma_bufcpy", scope: !2, file: !2, line: 73, type: !208, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !210)
!208 = !DISubroutineType(types: !209)
!209 = !{!75, !82, !88, !75, !90, !88, !75}
!210 = !{!211, !212, !213, !214, !215, !216, !217, !219, !220}
!211 = !DILocalVariable(name: "in", arg: 1, scope: !207, file: !2, line: 73, type: !82)
!212 = !DILocalVariable(name: "in_pos", arg: 2, scope: !207, file: !2, line: 73, type: !88)
!213 = !DILocalVariable(name: "in_size", arg: 3, scope: !207, file: !2, line: 74, type: !75)
!214 = !DILocalVariable(name: "out", arg: 4, scope: !207, file: !2, line: 74, type: !90)
!215 = !DILocalVariable(name: "out_pos", arg: 5, scope: !207, file: !2, line: 75, type: !88)
!216 = !DILocalVariable(name: "out_size", arg: 6, scope: !207, file: !2, line: 75, type: !75)
!217 = !DILocalVariable(name: "in_avail", scope: !207, file: !2, line: 77, type: !218)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!219 = !DILocalVariable(name: "out_avail", scope: !207, file: !2, line: 78, type: !218)
!220 = !DILocalVariable(name: "copy_size", scope: !207, file: !2, line: 79, type: !218)
!221 = !DILocation(line: 0, scope: !207)
!222 = !DILocation(line: 77, column: 36, scope: !207)
!223 = !DILocation(line: 77, column: 34, scope: !207)
!224 = !DILocation(line: 78, column: 38, scope: !207)
!225 = !DILocation(line: 78, column: 36, scope: !207)
!226 = !DILocation(line: 79, column: 27, scope: !207)
!227 = !DILocation(line: 81, column: 13, scope: !207)
!228 = !DILocation(line: 81, column: 28, scope: !207)
!229 = !DILocation(line: 81, column: 2, scope: !207)
!230 = !DILocation(line: 83, column: 10, scope: !207)
!231 = !DILocation(line: 84, column: 11, scope: !207)
!232 = !DILocation(line: 86, column: 2, scope: !207)
!233 = distinct !DISubprogram(name: "lzma_next_filter_init", scope: !2, file: !2, line: 91, type: !234, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !247)
!234 = !DISubroutineType(types: !235)
!235 = !{!65, !236, !66, !237}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !39, line: 82, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !39, line: 109, size: 192, elements: !241)
!241 = !{!242, !243, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !240, file: !39, line: 112, baseType: !50, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !240, file: !39, line: 116, baseType: !244, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !39, line: 86, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !240, file: !39, line: 119, baseType: !74, size: 64, offset: 128)
!247 = !{!248, !249, !250}
!248 = !DILocalVariable(name: "next", arg: 1, scope: !233, file: !2, line: 91, type: !236)
!249 = !DILocalVariable(name: "allocator", arg: 2, scope: !233, file: !2, line: 91, type: !66)
!250 = !DILocalVariable(name: "filters", arg: 3, scope: !233, file: !2, line: 92, type: !237)
!251 = !DILocation(line: 0, scope: !233)
!252 = !DILocation(line: 94, column: 2, scope: !253)
!253 = distinct !DILexicalBlock(scope: !254, file: !2, line: 94, column: 2)
!254 = distinct !DILexicalBlock(scope: !233, file: !2, line: 94, column: 2)
!255 = !DILocalVariable(name: "next", arg: 1, scope: !256, file: !2, line: 120, type: !236)
!256 = distinct !DISubprogram(name: "lzma_next_end", scope: !2, file: !2, line: 120, type: !257, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !236, !66}
!259 = !{!255, !260}
!260 = !DILocalVariable(name: "allocator", arg: 2, scope: !256, file: !2, line: 120, type: !66)
!261 = !DILocation(line: 0, scope: !256, inlinedAt: !262)
!262 = distinct !DILocation(line: 94, column: 2, scope: !253)
!263 = !DILocation(line: 94, column: 2, scope: !254)
!264 = !DILocation(line: 126, column: 13, scope: !265, inlinedAt: !262)
!265 = distinct !DILexicalBlock(scope: !266, file: !2, line: 126, column: 7)
!266 = distinct !DILexicalBlock(scope: !267, file: !2, line: 122, column: 39)
!267 = distinct !DILexicalBlock(scope: !256, file: !2, line: 122, column: 6)
!268 = !DILocation(line: 126, column: 17, scope: !265, inlinedAt: !262)
!269 = !DILocation(line: 0, scope: !265, inlinedAt: !262)
!270 = !DILocation(line: 126, column: 7, scope: !266, inlinedAt: !262)
!271 = !DILocation(line: 127, column: 4, scope: !265, inlinedAt: !262)
!272 = !DILocation(line: 0, scope: !187, inlinedAt: !273)
!273 = distinct !DILocation(line: 129, column: 4, scope: !265, inlinedAt: !262)
!274 = !DILocation(line: 59, column: 16, scope: !195, inlinedAt: !273)
!275 = !DILocation(line: 59, column: 24, scope: !195, inlinedAt: !273)
!276 = !DILocation(line: 59, column: 38, scope: !195, inlinedAt: !273)
!277 = !DILocation(line: 59, column: 43, scope: !195, inlinedAt: !273)
!278 = !DILocation(line: 59, column: 6, scope: !187, inlinedAt: !273)
!279 = !DILocation(line: 60, column: 30, scope: !195, inlinedAt: !273)
!280 = !DILocation(line: 60, column: 3, scope: !195, inlinedAt: !273)
!281 = !DILocation(line: 62, column: 3, scope: !195, inlinedAt: !273)
!282 = !DILocation(line: 133, column: 11, scope: !266, inlinedAt: !262)
!283 = !DILocation(line: 134, column: 2, scope: !266, inlinedAt: !262)
!284 = !DILocation(line: 95, column: 24, scope: !233)
!285 = !DILocation(line: 95, column: 8, scope: !233)
!286 = !DILocation(line: 95, column: 11, scope: !233)
!287 = !DILocation(line: 96, column: 20, scope: !233)
!288 = !DILocation(line: 96, column: 25, scope: !233)
!289 = !DILocation(line: 96, column: 9, scope: !233)
!290 = !DILocation(line: 97, column: 16, scope: !233)
!291 = !DILocation(line: 96, column: 2, scope: !233)
!292 = !DILocation(line: 0, scope: !256)
!293 = !DILocation(line: 122, column: 12, scope: !267)
!294 = !DILocation(line: 122, column: 17, scope: !267)
!295 = !DILocation(line: 122, column: 6, scope: !256)
!296 = !DILocation(line: 126, column: 13, scope: !265)
!297 = !DILocation(line: 126, column: 17, scope: !265)
!298 = !DILocation(line: 0, scope: !265)
!299 = !DILocation(line: 126, column: 7, scope: !266)
!300 = !DILocation(line: 127, column: 4, scope: !265)
!301 = !DILocation(line: 0, scope: !187, inlinedAt: !302)
!302 = distinct !DILocation(line: 129, column: 4, scope: !265)
!303 = !DILocation(line: 59, column: 16, scope: !195, inlinedAt: !302)
!304 = !DILocation(line: 59, column: 24, scope: !195, inlinedAt: !302)
!305 = !DILocation(line: 59, column: 38, scope: !195, inlinedAt: !302)
!306 = !DILocation(line: 59, column: 43, scope: !195, inlinedAt: !302)
!307 = !DILocation(line: 59, column: 6, scope: !187, inlinedAt: !302)
!308 = !DILocation(line: 60, column: 30, scope: !195, inlinedAt: !302)
!309 = !DILocation(line: 60, column: 3, scope: !195, inlinedAt: !302)
!310 = !DILocation(line: 62, column: 3, scope: !195, inlinedAt: !302)
!311 = !DILocation(line: 133, column: 11, scope: !266)
!312 = !DILocation(line: 134, column: 2, scope: !266)
!313 = !DILocation(line: 136, column: 2, scope: !256)
!314 = distinct !DISubprogram(name: "lzma_next_filter_update", scope: !2, file: !2, line: 102, type: !315, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !317)
!315 = !DISubroutineType(types: !316)
!316 = !{!65, !236, !66, !114}
!317 = !{!318, !319, !320}
!318 = !DILocalVariable(name: "next", arg: 1, scope: !314, file: !2, line: 102, type: !236)
!319 = !DILocalVariable(name: "allocator", arg: 2, scope: !314, file: !2, line: 102, type: !66)
!320 = !DILocalVariable(name: "reversed_filters", arg: 3, scope: !314, file: !2, line: 103, type: !114)
!321 = !DILocation(line: 0, scope: !314)
!322 = !DILocation(line: 108, column: 26, scope: !323)
!323 = distinct !DILexicalBlock(scope: !314, file: !2, line: 108, column: 6)
!324 = !DILocation(line: 108, column: 38, scope: !323)
!325 = !DILocation(line: 108, column: 29, scope: !323)
!326 = !DILocation(line: 108, column: 6, scope: !314)
!327 = !DILocation(line: 111, column: 29, scope: !328)
!328 = distinct !DILexicalBlock(scope: !314, file: !2, line: 111, column: 6)
!329 = !DILocation(line: 111, column: 6, scope: !314)
!330 = !DILocation(line: 115, column: 15, scope: !314)
!331 = !DILocation(line: 115, column: 28, scope: !314)
!332 = !DILocation(line: 115, column: 9, scope: !314)
!333 = !DILocation(line: 115, column: 2, scope: !314)
!334 = !DILocation(line: 116, column: 1, scope: !314)
!335 = distinct !DISubprogram(name: "lzma_strm_init", scope: !2, file: !2, line: 145, type: !336, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !363)
!336 = !DISubroutineType(types: !337)
!337 = !{!65, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !10, line: 490, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 453, size: 1088, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !352, !353, !354, !355, !356, !357, !358, !359, !360, !362}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !340, file: !10, line: 454, baseType: !83, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !340, file: !10, line: 455, baseType: !75, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !340, file: !10, line: 456, baseType: !52, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !340, file: !10, line: 458, baseType: !91, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !340, file: !10, line: 459, baseType: !75, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !340, file: !10, line: 460, baseType: !52, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !340, file: !10, line: 468, baseType: !66, size: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !340, file: !10, line: 471, baseType: !350, size: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !10, line: 411, baseType: !40)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !340, file: !10, line: 479, baseType: !74, size: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !340, file: !10, line: 480, baseType: !74, size: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !340, file: !10, line: 481, baseType: !74, size: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !340, file: !10, line: 482, baseType: !74, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !340, file: !10, line: 483, baseType: !52, size: 64, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !340, file: !10, line: 484, baseType: !52, size: 64, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !340, file: !10, line: 485, baseType: !75, size: 64, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !340, file: !10, line: 486, baseType: !75, size: 64, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !340, file: !10, line: 487, baseType: !361, size: 32, offset: 1024)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !10, line: 46, baseType: !137)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !340, file: !10, line: 488, baseType: !361, size: 32, offset: 1056)
!363 = !{!364}
!364 = !DILocalVariable(name: "strm", arg: 1, scope: !335, file: !2, line: 145, type: !338)
!365 = !DILocation(line: 0, scope: !335)
!366 = !DILocation(line: 147, column: 11, scope: !367)
!367 = distinct !DILexicalBlock(scope: !335, file: !2, line: 147, column: 6)
!368 = !DILocation(line: 147, column: 6, scope: !335)
!369 = !DILocation(line: 150, column: 12, scope: !370)
!370 = distinct !DILexicalBlock(scope: !335, file: !2, line: 150, column: 6)
!371 = !DILocation(line: 150, column: 21, scope: !370)
!372 = !DILocation(line: 150, column: 6, scope: !335)
!373 = !DILocation(line: 152, column: 11, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !2, line: 150, column: 30)
!375 = !DILocation(line: 0, scope: !162, inlinedAt: !376)
!376 = distinct !DILocation(line: 151, column: 20, scope: !374)
!377 = !DILocation(line: 47, column: 16, scope: !172, inlinedAt: !376)
!378 = !DILocation(line: 47, column: 24, scope: !172, inlinedAt: !376)
!379 = !DILocation(line: 47, column: 38, scope: !172, inlinedAt: !376)
!380 = !DILocation(line: 47, column: 44, scope: !172, inlinedAt: !376)
!381 = !DILocation(line: 47, column: 6, scope: !162, inlinedAt: !376)
!382 = !DILocation(line: 48, column: 37, scope: !172, inlinedAt: !376)
!383 = !DILocation(line: 48, column: 9, scope: !172, inlinedAt: !376)
!384 = !DILocation(line: 48, column: 3, scope: !172, inlinedAt: !376)
!385 = !DILocation(line: 50, column: 9, scope: !172, inlinedAt: !376)
!386 = !DILocation(line: 0, scope: !172, inlinedAt: !376)
!387 = !DILocation(line: 151, column: 18, scope: !374)
!388 = !DILocation(line: 153, column: 22, scope: !389)
!389 = distinct !DILexicalBlock(scope: !374, file: !2, line: 153, column: 7)
!390 = !DILocation(line: 153, column: 7, scope: !374)
!391 = !DILocation(line: 156, column: 26, scope: !374)
!392 = !DILocation(line: 159, column: 8, scope: !335)
!393 = !DILocation(line: 157, column: 2, scope: !374)
!394 = !DILocation(line: 159, column: 18, scope: !335)
!395 = !DILocation(line: 159, column: 46, scope: !335)
!396 = !DILocation(line: 160, column: 8, scope: !335)
!397 = !DILocation(line: 160, column: 2, scope: !335)
!398 = !DILocation(line: 160, column: 53, scope: !335)
!399 = !DILocation(line: 161, column: 8, scope: !335)
!400 = !DILocation(line: 161, column: 2, scope: !335)
!401 = !DILocation(line: 161, column: 53, scope: !335)
!402 = !DILocation(line: 162, column: 8, scope: !335)
!403 = !DILocation(line: 162, column: 2, scope: !335)
!404 = !DILocation(line: 162, column: 49, scope: !335)
!405 = !DILocation(line: 163, column: 8, scope: !335)
!406 = !DILocation(line: 163, column: 18, scope: !335)
!407 = !DILocation(line: 163, column: 27, scope: !335)
!408 = !DILocation(line: 164, column: 8, scope: !335)
!409 = !DILocation(line: 164, column: 18, scope: !335)
!410 = !DILocation(line: 164, column: 34, scope: !335)
!411 = !DILocation(line: 166, column: 8, scope: !335)
!412 = !DILocation(line: 166, column: 17, scope: !335)
!413 = !DILocation(line: 167, column: 8, scope: !335)
!414 = !DILocation(line: 167, column: 18, scope: !335)
!415 = !DILocation(line: 169, column: 2, scope: !335)
!416 = !DILocation(line: 170, column: 1, scope: !335)
!417 = distinct !DISubprogram(name: "lzma_code", scope: !2, file: !2, line: 174, type: !418, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !420)
!418 = !DISubroutineType(types: !419)
!419 = !{!65, !338, !92}
!420 = !{!421, !422, !423, !424, !425}
!421 = !DILocalVariable(name: "strm", arg: 1, scope: !417, file: !2, line: 174, type: !338)
!422 = !DILocalVariable(name: "action", arg: 2, scope: !417, file: !2, line: 174, type: !92)
!423 = !DILocalVariable(name: "in_pos", scope: !417, file: !2, line: 251, type: !75)
!424 = !DILocalVariable(name: "out_pos", scope: !417, file: !2, line: 252, type: !75)
