; ModuleID = 'liblzma/common/filter_common.c'
source_filename = "liblzma/common/filter_common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i64, i64, i8, i8, i8 }
%struct.lzma_filter = type { i64, ptr }
%struct.lzma_filter_info_s = type { i64, ptr, ptr }

@features = internal unnamed_addr constant [10 x %struct.anon] [%struct.anon { i64 4611686018427387905, i64 112, i8 0, i8 1, i8 1 }, %struct.anon { i64 33, i64 112, i8 0, i8 1, i8 1 }, %struct.anon { i64 4, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 5, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 6, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 7, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 8, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 9, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 3, i64 40, i8 1, i8 0, i8 0 }, %struct.anon { i64 -1, i64 0, i8 0, i8 0, i8 0 }], align 16, !dbg !0

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @lzma_filters_copy(ptr noundef readonly %src, ptr noundef %dest, ptr noundef %allocator) local_unnamed_addr #0 !dbg !66 {
entry:
    #dbg_value(ptr %src, !93, !DIExpression(), !105)
    #dbg_value(ptr %dest, !94, !DIExpression(), !105)
    #dbg_value(ptr %allocator, !95, !DIExpression(), !105)
  %cmp = icmp eq ptr %src, null, !dbg !106
  %cmp1 = icmp eq ptr %dest, null
  %or.cond = or i1 %cmp, %cmp1, !dbg !108

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "features", scope: !2, file: !3, line: 36, type: !37, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !36, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "liblzma/common/filter_common.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "40ce9c1355191130339ea0043a46dd45")
!4 = !{!5, !21, !27}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 57, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "LZMA_OK", value: 0)
!10 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!11 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!12 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!13 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!14 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!15 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!16 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!17 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!18 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!19 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!20 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 250, baseType: !7, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!24 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!25 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!26 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 27, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!31 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!32 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!33 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !{!0}
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 1920, elements: !56)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 16, size: 192, elements: !40)
!40 = !{!41, !49, !52, !54, !55}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !39, file: !3, line: 18, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !43, line: 63, baseType: !44)
!43 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !45, line: 27, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !47, line: 45, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!48 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "options_size", scope: !39, file: !3, line: 21, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 18, baseType: !48)
!51 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "non_last_ok", scope: !39, file: !3, line: 25, baseType: !53, size: 8, offset: 128)
!53 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "last_ok", scope: !39, file: !3, line: 29, baseType: !53, size: 8, offset: 136)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "changes_size", scope: !39, file: !3, line: 34, baseType: !53, size: 8, offset: 144)
!56 = !{!57}
!57 = !DISubrange(count: 10)
!58 = !{i32 7, !"Dwarf Version", i32 5}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{i32 1, !"wchar_size", i32 4}
!61 = !{i32 8, !"PIC Level", i32 2}
!62 = !{i32 7, !"PIE Level", i32 2}
!63 = !{i32 7, !"uwtable", i32 2}
!64 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!65 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!66 = distinct !DISubprogram(name: "lzma_filters_copy", scope: !3, file: !3, line: 125, type: !67, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !92)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !70, !78, !79}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !6, line: 237, baseType: !5)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !73, line: 65, baseType: !74)
!73 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 43, size: 128, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !73, line: 54, baseType: !42, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !74, file: !73, line: 63, baseType: !35, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !6, line: 403, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 341, size: 192, elements: !82)
!82 = !{!83, !87, !91}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !81, file: !6, line: 376, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!35, !35, !50, !50}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !81, file: !6, line: 390, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !35, !35}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !81, file: !6, line: 401, baseType: !35, size: 64, offset: 128)
!92 = !{!93, !94, !95, !96, !97, !98, !104}
!93 = !DILocalVariable(name: "src", arg: 1, scope: !66, file: !3, line: 125, type: !70)
!94 = !DILocalVariable(name: "dest", arg: 2, scope: !66, file: !3, line: 125, type: !78)
!95 = !DILocalVariable(name: "allocator", arg: 3, scope: !66, file: !3, line: 126, type: !79)
!96 = !DILocalVariable(name: "ret", scope: !66, file: !3, line: 131, type: !69)
!97 = !DILocalVariable(name: "i", scope: !66, file: !3, line: 132, type: !50)
!98 = !DILocalVariable(name: "j", scope: !99, file: !3, line: 154, type: !50)
!99 = distinct !DILexicalBlock(scope: !100, file: !3, line: 145, column: 10)
!100 = distinct !DILexicalBlock(scope: !101, file: !3, line: 143, column: 7)
!101 = distinct !DILexicalBlock(scope: !102, file: !3, line: 133, column: 50)
!102 = distinct !DILexicalBlock(scope: !103, file: !3, line: 133, column: 2)
!103 = distinct !DILexicalBlock(scope: !66, file: !3, line: 133, column: 2)
!104 = !DILabel(scope: !66, name: "error", file: !3, line: 182)
!105 = !DILocation(line: 0, scope: !66)
!106 = !DILocation(line: 128, column: 10, scope: !107)
!107 = distinct !DILexicalBlock(scope: !66, file: !3, line: 128, column: 6)
!108 = !DILocation(line: 128, column: 18, scope: !107)
!109 = !DILocation(line: 133, column: 21, scope: !102)
!110 = !DILocation(line: 133, column: 24, scope: !102)
!111 = !DILocation(line: 133, column: 2, scope: !103)
!112 = !DILocation(line: 141, column: 14, scope: !101)
!113 = !DILocation(line: 143, column: 14, scope: !100)
!114 = !DILocation(line: 143, column: 22, scope: !100)
!115 = !DILocation(line: 143, column: 7, scope: !101)
!116 = !DILocation(line: 0, scope: !99)
!117 = !DILocation(line: 155, column: 4, scope: !118)
!118 = distinct !DILexicalBlock(scope: !99, file: !3, line: 155, column: 4)
!119 = !DILocation(line: 144, column: 12, scope: !120)
!120 = distinct !DILexicalBlock(scope: !100, file: !3, line: 143, column: 31)
!121 = !DILocation(line: 144, column: 20, scope: !120)
!122 = !DILocation(line: 145, column: 3, scope: !120)
!123 = !DILocation(line: 163, column: 45, scope: !99)
!124 = !DILocation(line: 155, column: 29, scope: !125)
!125 = distinct !DILexicalBlock(scope: !118, file: !3, line: 155, column: 4)
!126 = !DILocation(line: 163, column: 22, scope: !99)
!127 = !DILocation(line: 163, column: 12, scope: !99)
!128 = !DILocation(line: 163, column: 20, scope: !99)
!129 = !DILocation(line: 165, column: 24, scope: !130)
!130 = distinct !DILexicalBlock(scope: !99, file: !3, line: 165, column: 8)
!131 = !DILocation(line: 165, column: 8, scope: !99)
!132 = !DILocation(line: 170, column: 35, scope: !99)
!133 = !DILocation(line: 170, column: 4, scope: !99)
!134 = !DILocation(line: 133, column: 14, scope: !102)
!135 = distinct !{!135, !111, !136}
!136 = !DILocation(line: 173, column: 2, scope: !103)
!137 = !DILocation(line: 136, column: 9, scope: !138)
!138 = distinct !DILexicalBlock(scope: !101, file: !3, line: 136, column: 7)
!139 = !DILocation(line: 141, column: 3, scope: !101)
!140 = !DILocation(line: 133, scope: !103)
!141 = !DILocation(line: 177, column: 2, scope: !66)
!142 = !DILocation(line: 177, column: 13, scope: !66)
!143 = !DILocation(line: 178, column: 10, scope: !66)
!144 = !DILocation(line: 178, column: 18, scope: !66)
!145 = !DILocation(line: 180, column: 2, scope: !66)
!146 = !DILocation(line: 0, scope: !101)
!147 = !DILocation(line: 182, column: 1, scope: !66)
!148 = !DILocation(line: 184, column: 2, scope: !66)
!149 = !DILocation(line: 184, column: 10, scope: !66)
!150 = !DILocation(line: 185, column: 21, scope: !151)
!151 = distinct !DILexicalBlock(scope: !66, file: !3, line: 184, column: 18)
!152 = !DILocation(line: 185, column: 3, scope: !151)
!153 = !DILocation(line: 186, column: 19, scope: !151)
!154 = !DILocation(line: 184, column: 13, scope: !66)
!155 = distinct !{!155, !148, !156}
!156 = !DILocation(line: 187, column: 2, scope: !66)
!157 = !DILocation(line: 190, column: 1, scope: !66)
!158 = !DISubprogram(name: "lzma_alloc", scope: !159, file: !159, line: 211, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!159 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!160 = !DISubroutineType(types: !161)
!161 = !{!35, !50, !79}
!162 = !DISubprogram(name: "lzma_free", scope: !159, file: !159, line: 215, type: !163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !35, !79}
!165 = distinct !DISubprogram(name: "lzma_raw_coder_init", scope: !3, file: !3, line: 242, type: !166, scopeLine: 245, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !246)
!166 = !DISubroutineType(types: !167)
!167 = !{!69, !168, !79, !70, !216, !53}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !159, line: 80, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !159, line: 124, size: 512, elements: !171)
!171 = !{!172, !175, !176, !179, !195, !200, !207, !212}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !170, file: !159, line: 126, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !159, line: 78, baseType: null)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !170, file: !159, line: 130, baseType: !42, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !170, file: !159, line: 136, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !178, line: 90, baseType: !48)
!178 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!179 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !170, file: !159, line: 139, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !159, line: 94, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!69, !173, !79, !184, !190, !50, !192, !190, !50, !194}
!184 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 24, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !47, line: 38, baseType: !189)
!189 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!190 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !6, line: 322, baseType: !21)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !170, file: !159, line: 144, baseType: !196, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !159, line: 102, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !173, !79}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !170, file: !159, line: 148, baseType: !201, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !28, line: 55, baseType: !27)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !170, file: !159, line: 152, baseType: !208, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!69, !173, !211, !211, !44}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !170, file: !159, line: 157, baseType: !213, size: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!69, !173, !79, !70, !70}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_find", file: !217, line: 35, baseType: !218)
!217 = !DIFile(filename: "liblzma/common/filter_common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "2b3d0d0ae4b0d967ddcb9fa677c708ca")
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !42}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_coder", file: !217, line: 32, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 20, size: 192, elements: !225)
!225 = !{!226, !227, !240}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !224, file: !217, line: 22, baseType: !42, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !224, file: !217, line: 26, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !159, line: 86, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!69, !168, !79, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !159, line: 82, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !159, line: 109, size: 192, elements: !236)
!236 = !{!237, !238, !239}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !235, file: !159, line: 112, baseType: !42, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !235, file: !159, line: 116, baseType: !228, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !235, file: !159, line: 119, baseType: !35, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !224, file: !217, line: 30, baseType: !241, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!44, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !256, !260, !264, !268, !270, !273, !276}
!247 = !DILocalVariable(name: "next", arg: 1, scope: !165, file: !3, line: 242, type: !168)
!248 = !DILocalVariable(name: "allocator", arg: 2, scope: !165, file: !3, line: 242, type: !79)
!249 = !DILocalVariable(name: "options", arg: 3, scope: !165, file: !3, line: 243, type: !70)
!250 = !DILocalVariable(name: "coder_find", arg: 4, scope: !165, file: !3, line: 244, type: !216)
!251 = !DILocalVariable(name: "is_encoder", arg: 5, scope: !165, file: !3, line: 244, type: !53)
!252 = !DILocalVariable(name: "count", scope: !165, file: !3, line: 247, type: !50)
!253 = !DILocalVariable(name: "ret_", scope: !254, file: !3, line: 248, type: !255)
!254 = distinct !DILexicalBlock(scope: !165, file: !3, line: 248, column: 2)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!256 = !DILocalVariable(name: "filters", scope: !165, file: !3, line: 251, type: !257)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 960, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 5)
!260 = !DILocalVariable(name: "i", scope: !261, file: !3, line: 253, type: !50)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 253, column: 3)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 252, column: 18)
!263 = distinct !DILexicalBlock(scope: !165, file: !3, line: 252, column: 6)
!264 = !DILocalVariable(name: "j", scope: !265, file: !3, line: 257, type: !267)
!265 = distinct !DILexicalBlock(scope: !266, file: !3, line: 253, column: 38)
!266 = distinct !DILexicalBlock(scope: !261, file: !3, line: 253, column: 3)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!268 = !DILocalVariable(name: "fc", scope: !265, file: !3, line: 259, type: !269)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!270 = !DILocalVariable(name: "i", scope: !271, file: !3, line: 269, type: !50)
!271 = distinct !DILexicalBlock(scope: !272, file: !3, line: 269, column: 3)
!272 = distinct !DILexicalBlock(scope: !263, file: !3, line: 268, column: 9)
!273 = !DILocalVariable(name: "fc", scope: !274, file: !3, line: 270, type: !269)
!274 = distinct !DILexicalBlock(scope: !275, file: !3, line: 269, column: 38)
!275 = distinct !DILexicalBlock(scope: !271, file: !3, line: 269, column: 3)
!276 = !DILocalVariable(name: "ret", scope: !165, file: !3, line: 286, type: !255)
!277 = distinct !DIAssignID()
!278 = !DILocation(line: 0, scope: !165)
!279 = !DILocalVariable(name: "filters", arg: 1, scope: !280, file: !3, line: 194, type: !70)
!280 = distinct !DISubprogram(name: "validate_chain", scope: !3, file: !3, line: 194, type: !281, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !283)
!281 = !DISubroutineType(types: !282)
!282 = !{!69, !70, !191}
!283 = !{!279, !284, !285, !286, !287, !288, !289}
!284 = !DILocalVariable(name: "count", arg: 2, scope: !280, file: !3, line: 194, type: !191)
!285 = !DILocalVariable(name: "changes_size_count", scope: !280, file: !3, line: 202, type: !50)
!286 = !DILocalVariable(name: "non_last_ok", scope: !280, file: !3, line: 205, type: !53)
!287 = !DILocalVariable(name: "last_ok", scope: !280, file: !3, line: 210, type: !53)
!288 = !DILocalVariable(name: "i", scope: !280, file: !3, line: 212, type: !50)
!289 = !DILocalVariable(name: "j", scope: !290, file: !3, line: 214, type: !50)
!290 = distinct !DILexicalBlock(scope: !280, file: !3, line: 213, column: 5)
!291 = !DILocation(line: 0, scope: !280, inlinedAt: !292)
