; ModuleID = 'liblzma/common/filter_encoder.c'
source_filename = "liblzma/common/filter_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_filter_encoder = type { i64, ptr, ptr, ptr, ptr, i32, ptr }
%struct.lzma_filter = type { i64, ptr }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "encoders", scope: !2, file: !3, line: 56, type: !169, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !136, globals: !168, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "liblzma/common/filter_encoder.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "fc5fadddba740b28186eb750b5e2aebe")
!4 = !{!5, !21, !27, !34, !133}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 57, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "LZMA_OK", value: 0)
!10 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!11 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!12 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!13 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!14 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!15 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!16 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!17 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!18 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!19 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!20 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 250, baseType: !7, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!24 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!25 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!26 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 27, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!31 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!32 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!33 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !36, file: !35, line: 187, baseType: !7, size: 32, elements: !126)
!35 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !35, line: 179, size: 704, elements: !37)
!37 = !{!38, !118, !119, !120, !125}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !35, line: 181, baseType: !39, size: 512)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !35, line: 80, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !35, line: 124, size: 512, elements: !41)
!41 = !{!42, !45, !53, !56, !89, !94, !101, !106}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !40, file: !35, line: 126, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !35, line: 78, baseType: null)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !35, line: 130, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !47, line: 63, baseType: !48)
!47 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !49, line: 27, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !51, line: 45, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!52 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !40, file: !35, line: 136, baseType: !54, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !55, line: 90, baseType: !52)
!55 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !40, file: !35, line: 139, baseType: !57, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !35, line: 94, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !43, !62, !78, !84, !71, !86, !84, !71, !88}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !6, line: 237, baseType: !5)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !6, line: 403, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 341, size: 192, elements: !65)
!65 = !{!66, !73, !77}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !64, file: !6, line: 376, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !70, !71, !71}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 18, baseType: !52)
!72 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !64, file: !6, line: 390, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !70, !70}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !64, file: !6, line: 401, baseType: !70, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !49, line: 24, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !51, line: 38, baseType: !83)
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !6, line: 322, baseType: !21)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !40, file: !35, line: 144, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !35, line: 102, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !43, !62}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !40, file: !35, line: 148, baseType: !95, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !28, line: 55, baseType: !27)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !40, file: !35, line: 152, baseType: !102, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!61, !43, !105, !105, !48}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !40, file: !35, line: 157, baseType: !107, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!61, !43, !62, !110, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !113, line: 65, baseType: !114)
!113 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 43, size: 128, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !114, file: !113, line: 54, baseType: !46, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !114, file: !113, line: 63, baseType: !70, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !36, file: !35, line: 194, baseType: !34, size: 32, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !36, file: !35, line: 199, baseType: !71, size: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !36, file: !35, line: 202, baseType: !121, size: 32, offset: 640)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 32, elements: !123)
!122 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!123 = !{!124}
!124 = !DISubrange(count: 4)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !36, file: !35, line: 206, baseType: !122, size: 8, offset: 672)
!126 = !{!127, !128, !129, !130, !131, !132}
!127 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!128 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!129 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!130 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!131 = !DIEnumerator(name: "ISEQ_END", value: 4)
!132 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 44, baseType: !7, size: 32, elements: !134)
!134 = !{!135}
!135 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!136 = !{!70, !137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_find", file: !138, line: 35, baseType: !139)
!138 = !DIFile(filename: "liblzma/common/filter_common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "2b3d0d0ae4b0d967ddcb9fa677c708ca")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !46}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_coder", file: !138, line: 32, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 20, size: 192, elements: !146)
!146 = !{!147, !148, !162}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !138, line: 22, baseType: !46, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !145, file: !138, line: 26, baseType: !149, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !35, line: 86, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!61, !153, !62, !154}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !35, line: 82, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !35, line: 109, size: 192, elements: !158)
!158 = !{!159, !160, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !157, file: !35, line: 112, baseType: !46, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !157, file: !35, line: 116, baseType: !149, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !157, file: !35, line: 119, baseType: !70, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !145, file: !138, line: 30, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!48, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!168 = !{!0}
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 4032, elements: !193)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_encoder", file: !3, line: 53, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 21, size: 448, elements: !173)
!173 = !{!174, !175, !176, !177, !181, !188, !189}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !172, file: !3, line: 23, baseType: !46, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !172, file: !3, line: 27, baseType: !149, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !172, file: !3, line: 31, baseType: !163, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !172, file: !3, line: 37, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!46, !166}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "props_size_get", scope: !172, file: !3, line: 42, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!61, !185, !166}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 26, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !51, line: 42, baseType: !7)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "props_size_fixed", scope: !172, file: !3, line: 43, baseType: !186, size: 32, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "props_encode", scope: !172, file: !3, line: 51, baseType: !190, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!61, !166, !87}
!193 = !{!194}
!194 = !DISubrange(count: 9)
!195 = !{i32 7, !"Dwarf Version", i32 5}
!196 = !{i32 2, !"Debug Info Version", i32 3}
!197 = !{i32 1, !"wchar_size", i32 4}
!198 = !{i32 8, !"PIC Level", i32 2}
!199 = !{i32 7, !"PIE Level", i32 2}
!200 = !{i32 7, !"uwtable", i32 2}
!201 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!202 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!203 = distinct !DISubprogram(name: "lzma_filter_encoder_is_supported", scope: !3, file: !3, line: 165, type: !204, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !207)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !46}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !6, line: 29, baseType: !83)
!207 = !{!208}
!208 = !DILocalVariable(name: "id", arg: 1, scope: !203, file: !3, line: 165, type: !46)
!209 = !DILocation(line: 0, scope: !203)
!210 = !DILocalVariable(name: "id", arg: 1, scope: !211, file: !3, line: 154, type: !46)
!211 = distinct !DISubprogram(name: "encoder_find", scope: !3, file: !3, line: 154, type: !212, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !215)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !46}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!215 = !{!210, !216}
!216 = !DILocalVariable(name: "i", scope: !217, file: !3, line: 156, type: !71)
!217 = distinct !DILexicalBlock(scope: !211, file: !3, line: 156, column: 2)
!218 = !DILocation(line: 0, scope: !211, inlinedAt: !219)
!219 = distinct !DILocation(line: 167, column: 9, scope: !203)
!220 = !DILocation(line: 0, scope: !217, inlinedAt: !219)
!221 = !DILocation(line: 157, column: 7, scope: !222, inlinedAt: !219)
!222 = distinct !DILexicalBlock(scope: !217, file: !3, line: 156, column: 2)
!223 = !DILocation(line: 158, column: 4, scope: !224, inlinedAt: !219)
!224 = distinct !DILexicalBlock(scope: !222, file: !3, line: 157, column: 7)
!225 = !DILocation(line: 167, column: 2, scope: !203)
!226 = !DILocation(line: 0, scope: !211)
!227 = !DILocation(line: 0, scope: !217)
!228 = !DILocation(line: 157, column: 7, scope: !222)
!229 = !DILocation(line: 158, column: 20, scope: !224)
!230 = !DILocation(line: 158, column: 4, scope: !224)
!231 = !DILocation(line: 161, column: 1, scope: !211)
!232 = distinct !DISubprogram(name: "lzma_filters_update", scope: !3, file: !3, line: 172, type: !233, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!233 = !DISubroutineType(types: !234)
!234 = !{!61, !235, !110}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !6, line: 490, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 453, size: 1088, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !249, !250, !251, !252, !253, !254, !255, !256, !257, !259}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !237, file: !6, line: 454, baseType: !79, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !237, file: !6, line: 455, baseType: !71, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !237, file: !6, line: 456, baseType: !48, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !237, file: !6, line: 458, baseType: !87, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !237, file: !6, line: 459, baseType: !71, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !237, file: !6, line: 460, baseType: !48, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !237, file: !6, line: 468, baseType: !62, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !6, line: 471, baseType: !247, size: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !6, line: 411, baseType: !36)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !237, file: !6, line: 479, baseType: !70, size: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !237, file: !6, line: 480, baseType: !70, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !237, file: !6, line: 481, baseType: !70, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !237, file: !6, line: 482, baseType: !70, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !237, file: !6, line: 483, baseType: !48, size: 64, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !237, file: !6, line: 484, baseType: !48, size: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !237, file: !6, line: 485, baseType: !71, size: 64, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !237, file: !6, line: 486, baseType: !71, size: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !237, file: !6, line: 487, baseType: !258, size: 32, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !6, line: 46, baseType: !133)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !237, file: !6, line: 488, baseType: !258, size: 32, offset: 1056)
!260 = !{!261, !262, !263, !264, !268}
!261 = !DILocalVariable(name: "strm", arg: 1, scope: !232, file: !3, line: 172, type: !235)
!262 = !DILocalVariable(name: "filters", arg: 2, scope: !232, file: !3, line: 172, type: !110)
!263 = !DILocalVariable(name: "count", scope: !232, file: !3, line: 183, type: !71)
!264 = !DILocalVariable(name: "reversed_filters", scope: !232, file: !3, line: 187, type: !265)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 640, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 5)
!268 = !DILocalVariable(name: "i", scope: !269, file: !3, line: 188, type: !71)
!269 = distinct !DILexicalBlock(scope: !232, file: !3, line: 188, column: 2)
!270 = distinct !DIAssignID()
!271 = !DILocation(line: 0, scope: !232)
!272 = !DILocation(line: 174, column: 12, scope: !273)
!273 = distinct !DILexicalBlock(scope: !232, file: !3, line: 174, column: 6)
!274 = !DILocation(line: 174, column: 27, scope: !273)
!275 = !DILocation(line: 174, column: 34, scope: !273)
!276 = !DILocation(line: 174, column: 6, scope: !232)
!277 = !DILocalVariable(name: "filters", arg: 1, scope: !278, file: !3, line: 222, type: !110)
!278 = distinct !DISubprogram(name: "lzma_raw_encoder_memusage", scope: !3, file: !3, line: 222, type: !279, scopeLine: 223, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !281)
!279 = !DISubroutineType(types: !280)
!280 = !{!48, !110}
!281 = !{!277}
!282 = !DILocation(line: 0, scope: !278, inlinedAt: !283)
!283 = distinct !DILocation(line: 178, column: 6, scope: !284)
!284 = distinct !DILexicalBlock(scope: !232, file: !3, line: 178, column: 6)
!285 = !DILocation(line: 224, column: 9, scope: !278, inlinedAt: !283)
!286 = !DILocation(line: 178, column: 41, scope: !284)
!287 = !DILocation(line: 178, column: 6, scope: !232)
!288 = !DILocation(line: 184, column: 9, scope: !232)
!289 = !DILocation(line: 184, column: 24, scope: !232)
!290 = !DILocation(line: 184, column: 27, scope: !232)
!291 = !DILocation(line: 185, column: 3, scope: !232)
!292 = !DILocation(line: 184, column: 2, scope: !232)
!293 = distinct !{!293, !292, !294}
!294 = !DILocation(line: 185, column: 5, scope: !232)
!295 = !DILocation(line: 187, column: 2, scope: !232)
!296 = !DILocation(line: 0, scope: !269)
!297 = !DILocation(line: 188, column: 23, scope: !298)
!298 = distinct !DILexicalBlock(scope: !269, file: !3, line: 188, column: 2)
!299 = !DILocation(line: 188, column: 2, scope: !269)
!300 = !DILocation(line: 189, column: 30, scope: !298)
!301 = !DILocation(line: 189, column: 3, scope: !298)
!302 = !DILocation(line: 189, column: 37, scope: !298)
!303 = !DILocation(line: 191, column: 2, scope: !232)
!304 = !DILocation(line: 191, column: 29, scope: !232)
!305 = !DILocation(line: 193, column: 15, scope: !232)
!306 = !DILocation(line: 193, column: 30, scope: !232)
!307 = !DILocation(line: 193, column: 58, scope: !232)
!308 = !DILocation(line: 194, column: 10, scope: !232)
!309 = !DILocation(line: 193, column: 9, scope: !232)
!310 = !DILocation(line: 195, column: 1, scope: !232)
!311 = !DILocation(line: 188, column: 32, scope: !298)
!312 = distinct !{!312, !299, !313}
!313 = !DILocation(line: 189, column: 46, scope: !269)
!314 = !DILocation(line: 0, scope: !278)
!315 = !DILocation(line: 224, column: 9, scope: !278)
!316 = !DILocation(line: 224, column: 2, scope: !278)
!317 = distinct !DISubprogram(name: "lzma_raw_encoder_init", scope: !3, file: !3, line: 199, type: !318, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{!61, !153, !62, !110}
!320 = !{!321, !322, !323}
!321 = !DILocalVariable(name: "next", arg: 1, scope: !317, file: !3, line: 199, type: !153)
