; ModuleID = 'liblzma/common/index.c'
source_filename = "liblzma/common/index.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.index_record = type { i64, i64 }
%struct.index_cat_info = type { i64, i64, i64, i32, ptr }

; Function Attrs: nounwind uwtable
define dso_local ptr @lzma_index_init(ptr noundef %allocator) local_unnamed_addr #0 !dbg !143 {
entry:
    #dbg_value(ptr %allocator, !171, !DIExpression(), !174)
    #dbg_value(ptr %allocator, !175, !DIExpression(), !179)
  %call.i = tail call ptr @lzma_alloc(i64 noundef 80, ptr noundef %allocator) #12, !dbg !181
    #dbg_value(ptr %call.i, !178, !DIExpression(), !179)
  %cmp.not.i = icmp eq ptr %call.i, null, !dbg !182
  br i1 %cmp.not.i, label %cleanup5, label %if.end, !dbg !184

if.end:                                           ; preds = %entry
    #dbg_value(ptr %call.i, !185, !DIExpression(), !191)
  tail call void @llvm.memset.p0.i64(ptr noundef nonnull align 8 dereferenceable(28) %call.i, i8 0, i64 28, i1 false), !dbg !194
  %uncompressed_size.i = getelementptr inbounds i8, ptr %call.i, i64 32, !dbg !195
  %prealloc.i = getelementptr inbounds i8, ptr %call.i, i64 64, !dbg !196
  tail call void @llvm.memset.p0.i64(ptr noundef nonnull align 8 dereferenceable(32) %uncompressed_size.i, i8 0, i64 32, i1 false), !dbg !197
  store i64 512, ptr %prealloc.i, align 8, !dbg !198

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !48, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/index.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "a67edd3e4f07ad87d5aa64b659eab087")
!2 = !{!3, !11, !15, !29, !36, !41}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 27, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!8 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!9 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!10 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 44, baseType: !5, size: 32, elements: !13)
!12 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!13 = !{!14}
!14 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 57, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!17 = !DIEnumerator(name: "LZMA_OK", value: 0)
!18 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!19 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!20 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!21 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!22 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!23 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!24 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!25 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!26 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!27 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!28 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 956, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35}
!31 = !DIEnumerator(name: "ITER_INDEX", value: 0)
!32 = !DIEnumerator(name: "ITER_STREAM", value: 1)
!33 = !DIEnumerator(name: "ITER_GROUP", value: 2)
!34 = !DIEnumerator(name: "ITER_RECORD", value: 3)
!35 = !DIEnumerator(name: "ITER_METHOD", value: 4)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 966, baseType: !5, size: 32, elements: !37)
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "ITER_METHOD_NORMAL", value: 0)
!39 = !DIEnumerator(name: "ITER_METHOD_NEXT", value: 1)
!40 = !DIEnumerator(name: "ITER_METHOD_LEFTMOST", value: 2)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !42, line: 226, baseType: !5, size: 32, elements: !43)
!42 = !DIFile(filename: "liblzma/api/lzma/index.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "923fbd07d3b348bf7a676d089b5c066f")
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "LZMA_INDEX_ITER_ANY", value: 0)
!45 = !DIEnumerator(name: "LZMA_INDEX_ITER_STREAM", value: 1)
!46 = !DIEnumerator(name: "LZMA_INDEX_ITER_BLOCK", value: 2)
!47 = !DIEnumerator(name: "LZMA_INDEX_ITER_NONEMPTY_BLOCK", value: 3)
!48 = !{!49, !50, !53, !115, !133, !134, !5}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 18, baseType: !52)
!51 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!52 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_stream", file: !1, line: 142, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 107, size: 1344, elements: !57)
!57 = !{!58, !74, !77, !78, !86, !87, !88, !114}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !56, file: !1, line: 109, baseType: !59, size: 320)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_tree_node", file: !1, line: 29, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "index_tree_node_s", file: !1, line: 30, size: 320, elements: !61)
!61 = !{!62, !69, !70, !72, !73}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_base", scope: !60, file: !1, line: 34, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !64, line: 63, baseType: !65)
!64 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !66, line: 27, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !68, line: 45, baseType: !52)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_base", scope: !60, file: !1, line: 37, baseType: !63, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !60, file: !1, line: 39, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !60, file: !1, line: 40, baseType: !71, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !60, file: !1, line: 41, baseType: !71, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !56, file: !1, line: 112, baseType: !75, size: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !66, line: 26, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !68, line: 42, baseType: !5)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "block_number_base", scope: !56, file: !1, line: 115, baseType: !63, size: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !56, file: !1, line: 122, baseType: !79, size: 256, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_tree", file: !1, line: 62, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 46, size: 256, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !80, file: !1, line: 48, baseType: !71, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "leftmost", scope: !80, file: !1, line: 53, baseType: !71, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rightmost", scope: !80, file: !1, line: 57, baseType: !71, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !80, file: !1, line: 60, baseType: !75, size: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "record_count", scope: !56, file: !1, line: 125, baseType: !63, size: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "index_list_size", scope: !56, file: !1, line: 130, baseType: !63, size: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "stream_flags", scope: !56, file: !1, line: 136, baseType: !89, size: 448, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream_flags", file: !90, line: 105, baseType: !91)
!90 = !DIFile(filename: "liblzma/api/lzma/stream_flags.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "d3814c86a389337e759db33a259f1072")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 33, size: 448, elements: !92)
!92 = !{!93, !94, !95, !97, !99, !100, !101, !102, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !91, file: !90, line: 51, baseType: !75, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "backward_size", scope: !91, file: !90, line: 69, baseType: !63, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !91, file: !90, line: 79, baseType: !96, size: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !4, line: 55, baseType: !3)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !91, file: !90, line: 90, baseType: !98, size: 32, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !12, line: 46, baseType: !11)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !91, file: !90, line: 91, baseType: !98, size: 32, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !91, file: !90, line: 92, baseType: !98, size: 32, offset: 224)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !91, file: !90, line: 93, baseType: !98, size: 32, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !91, file: !90, line: 94, baseType: !103, size: 8, offset: 288)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !12, line: 29, baseType: !104)
!104 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !91, file: !90, line: 95, baseType: !103, size: 8, offset: 296)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !91, file: !90, line: 96, baseType: !103, size: 8, offset: 304)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !91, file: !90, line: 97, baseType: !103, size: 8, offset: 312)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !91, file: !90, line: 98, baseType: !103, size: 8, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !91, file: !90, line: 99, baseType: !103, size: 8, offset: 328)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !91, file: !90, line: 100, baseType: !103, size: 8, offset: 336)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !91, file: !90, line: 101, baseType: !103, size: 8, offset: 344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !91, file: !90, line: 102, baseType: !75, size: 32, offset: 352)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !91, file: !90, line: 103, baseType: !75, size: 32, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "stream_padding", scope: !56, file: !1, line: 140, baseType: !63, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_group", file: !1, line: 104, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 71, size: 512, elements: !119)
!119 = !{!120, !121, !122, !123, !124}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !118, file: !1, line: 73, baseType: !59, size: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "number_base", scope: !118, file: !1, line: 76, baseType: !63, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !118, file: !1, line: 79, baseType: !50, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !118, file: !1, line: 82, baseType: !50, size: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !118, file: !1, line: 102, baseType: !125, offset: 512)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, elements: !131)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_record", file: !1, line: 68, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 65, size: 128, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_sum", scope: !127, file: !1, line: 66, baseType: !63, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_sum", scope: !127, file: !1, line: 67, baseType: !63, size: 64, offset: 64)
!131 = !{!132}
!132 = !DISubrange(count: -1)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!135 = !{i32 7, !"Dwarf Version", i32 5}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = !{i32 8, !"PIC Level", i32 2}
!139 = !{i32 7, !"PIE Level", i32 2}
!140 = !{i32 7, !"uwtable", i32 2}
!141 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!142 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!143 = distinct !DISubprogram(name: "lzma_index_init", scope: !1, file: !1, line: 398, type: !144, scopeLine: 399, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !170)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !157}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index", file: !42, line: 37, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_s", file: !1, line: 145, size: 640, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !148, file: !1, line: 149, baseType: !79, size: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !148, file: !1, line: 152, baseType: !63, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !148, file: !1, line: 155, baseType: !63, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "record_count", scope: !148, file: !1, line: 158, baseType: !63, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "index_list_size", scope: !148, file: !1, line: 166, baseType: !63, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc", scope: !148, file: !1, line: 171, baseType: !50, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !148, file: !1, line: 177, baseType: !75, size: 32, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !12, line: 403, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 341, size: 192, elements: !160)
!160 = !{!161, !165, !169}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !159, file: !12, line: 376, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!49, !49, !50, !50}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !159, file: !12, line: 390, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !49, !49}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !159, file: !12, line: 401, baseType: !49, size: 64, offset: 128)
!170 = !{!171, !172, !173}
!171 = !DILocalVariable(name: "allocator", arg: 1, scope: !143, file: !1, line: 398, type: !157)
!172 = !DILocalVariable(name: "i", scope: !143, file: !1, line: 400, type: !146)
!173 = !DILocalVariable(name: "s", scope: !143, file: !1, line: 404, type: !133)
!174 = !DILocation(line: 0, scope: !143)
!175 = !DILocalVariable(name: "allocator", arg: 1, scope: !176, file: !1, line: 380, type: !157)
!176 = distinct !DISubprogram(name: "index_init_plain", scope: !1, file: !1, line: 380, type: !144, scopeLine: 381, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !177)
!177 = !{!175, !178}
!178 = !DILocalVariable(name: "i", scope: !176, file: !1, line: 382, type: !146)
!179 = !DILocation(line: 0, scope: !176, inlinedAt: !180)
!180 = distinct !DILocation(line: 400, column: 18, scope: !143)
!181 = !DILocation(line: 382, column: 18, scope: !176, inlinedAt: !180)
!182 = !DILocation(line: 383, column: 8, scope: !183, inlinedAt: !180)
!183 = distinct !DILexicalBlock(scope: !176, file: !1, line: 383, column: 6)
!184 = !DILocation(line: 383, column: 6, scope: !176, inlinedAt: !180)
!185 = !DILocalVariable(name: "tree", arg: 1, scope: !186, file: !1, line: 182, type: !189)
!186 = distinct !DISubprogram(name: "index_tree_init", scope: !1, file: !1, line: 182, type: !187, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !190)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!190 = !{!185}
!191 = !DILocation(line: 0, scope: !186, inlinedAt: !192)
!192 = distinct !DILocation(line: 384, column: 3, scope: !193, inlinedAt: !180)
!193 = distinct !DILexicalBlock(scope: !183, file: !1, line: 383, column: 17)
!194 = !DILocation(line: 185, column: 17, scope: !186, inlinedAt: !192)
!195 = !DILocation(line: 385, column: 6, scope: !193, inlinedAt: !180)
!196 = !DILocation(line: 389, column: 6, scope: !193, inlinedAt: !180)
!197 = !DILocation(line: 385, column: 24, scope: !193, inlinedAt: !180)
!198 = !DILocation(line: 389, column: 15, scope: !193, inlinedAt: !180)
!199 = !DILocation(line: 390, column: 6, scope: !193, inlinedAt: !180)
!200 = !DILocation(line: 390, column: 13, scope: !193, inlinedAt: !180)
!201 = !DILocalVariable(name: "compressed_base", arg: 1, scope: !202, file: !1, line: 341, type: !63)
!202 = distinct !DISubprogram(name: "index_stream_init", scope: !1, file: !1, line: 341, type: !203, scopeLine: 344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !205)
!203 = !DISubroutineType(types: !204)
!204 = !{!133, !63, !63, !63, !63, !157}
!205 = !{!201, !206, !207, !208, !209, !210}
!206 = !DILocalVariable(name: "uncompressed_base", arg: 2, scope: !202, file: !1, line: 341, type: !63)
!207 = !DILocalVariable(name: "stream_number", arg: 3, scope: !202, file: !1, line: 342, type: !63)
!208 = !DILocalVariable(name: "block_number_base", arg: 4, scope: !202, file: !1, line: 342, type: !63)
!209 = !DILocalVariable(name: "allocator", arg: 5, scope: !202, file: !1, line: 343, type: !157)
!210 = !DILocalVariable(name: "s", scope: !202, file: !1, line: 345, type: !133)
!211 = !DILocation(line: 0, scope: !202, inlinedAt: !212)
!212 = distinct !DILocation(line: 404, column: 20, scope: !143)
!213 = !DILocation(line: 345, column: 20, scope: !202, inlinedAt: !212)
!214 = !DILocation(line: 346, column: 8, scope: !215, inlinedAt: !212)
!215 = distinct !DILexicalBlock(scope: !202, file: !1, line: 346, column: 6)
!216 = !DILocation(line: 346, column: 6, scope: !202, inlinedAt: !212)
!217 = !DILocation(line: 406, column: 3, scope: !218)
!218 = distinct !DILexicalBlock(scope: !219, file: !1, line: 405, column: 17)
!219 = distinct !DILexicalBlock(scope: !143, file: !1, line: 405, column: 6)
!220 = !DILocation(line: 407, column: 3, scope: !218)
!221 = !DILocation(line: 355, column: 5, scope: !202, inlinedAt: !212)
!222 = !DILocation(line: 350, column: 26, scope: !202, inlinedAt: !212)
!223 = !DILocation(line: 355, column: 12, scope: !202, inlinedAt: !212)
!224 = !DILocation(line: 356, column: 5, scope: !202, inlinedAt: !212)
!225 = !DILocation(line: 0, scope: !186, inlinedAt: !226)
!226 = distinct !DILocation(line: 358, column: 2, scope: !202, inlinedAt: !212)
!227 = !DILocation(line: 360, column: 5, scope: !202, inlinedAt: !212)
!228 = !DILocation(line: 362, column: 5, scope: !202, inlinedAt: !212)
!229 = !DILocation(line: 360, column: 18, scope: !202, inlinedAt: !212)
!230 = !DILocation(line: 185, column: 17, scope: !186, inlinedAt: !226)
!231 = !DILocation(line: 362, column: 26, scope: !202, inlinedAt: !212)
!232 = !DILocation(line: 363, column: 5, scope: !202, inlinedAt: !212)
!233 = !DILocation(line: 363, column: 20, scope: !202, inlinedAt: !212)
!234 = !DILocation(line: 410, column: 2, scope: !143)
!235 = !DILocation(line: 412, column: 2, scope: !143)
!236 = !DILocation(line: 413, column: 1, scope: !143)
!237 = !DISubprogram(name: "lzma_free", scope: !238, file: !238, line: 215, type: !239, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!239 = !DISubroutineType(types: !240)
!240 = !{null, !49, !157}
!241 = distinct !DISubprogram(name: "index_tree_append", scope: !1, file: !1, line: 231, type: !242, scopeLine: 232, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !244)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !189, !71}
!244 = !{!245, !246, !247, !248}
!245 = !DILocalVariable(name: "tree", arg: 1, scope: !241, file: !1, line: 231, type: !189)
!246 = !DILocalVariable(name: "node", arg: 2, scope: !241, file: !1, line: 231, type: !71)
!247 = !DILocalVariable(name: "up", scope: !241, file: !1, line: 261, type: !75)
!248 = !DILocalVariable(name: "pivot", scope: !249, file: !1, line: 270, type: !71)
!249 = distinct !DILexicalBlock(scope: !250, file: !1, line: 262, column: 15)
!250 = distinct !DILexicalBlock(scope: !241, file: !1, line: 262, column: 6)
!251 = !DILocation(line: 0, scope: !241)
!252 = !DILocation(line: 233, column: 23, scope: !241)
!253 = !DILocation(line: 233, column: 8, scope: !241)
!254 = !DILocation(line: 233, column: 15, scope: !241)
!255 = !DILocation(line: 234, column: 8, scope: !241)
!256 = !DILocation(line: 237, column: 10, scope: !241)
!257 = !DILocation(line: 235, column: 14, scope: !241)
!258 = !DILocation(line: 237, column: 2, scope: !241)
!259 = !DILocation(line: 240, column: 12, scope: !260)
!260 = distinct !DILexicalBlock(scope: !241, file: !1, line: 240, column: 6)
!261 = !DILocation(line: 240, column: 17, scope: !260)
!262 = !DILocation(line: 240, column: 6, scope: !241)
!263 = !DILocation(line: 241, column: 14, scope: !264)
!264 = distinct !DILexicalBlock(scope: !260, file: !1, line: 240, column: 26)
!265 = !DILocation(line: 242, column: 9, scope: !264)
!266 = !DILocation(line: 242, column: 18, scope: !264)
!267 = !DILocation(line: 243, column: 19, scope: !264)
!268 = !DILocation(line: 244, column: 3, scope: !264)
!269 = !DILocation(line: 253, column: 8, scope: !241)
!270 = !DILocation(line: 253, column: 19, scope: !241)
!271 = !DILocation(line: 253, column: 25, scope: !241)
!272 = !DILocation(line: 254, column: 18, scope: !241)
!273 = !DILocation(line: 261, column: 22, scope: !241)
!274 = !DILocalVariable(name: "n", arg: 1, scope: !275, file: !276, line: 364, type: !75)
!275 = distinct !DISubprogram(name: "bsr32", scope: !276, file: !276, line: 364, type: !277, scopeLine: 365, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !279)
!276 = !DIFile(filename: "common/tuklib_integer.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "877bd6a1d04ec1170bc985c87ef412ed")
!277 = !DISubroutineType(types: !278)
!278 = !{!75, !75}
!279 = !{!274, !280}
!280 = !DILocalVariable(name: "i", scope: !275, file: !276, line: 391, type: !75)
!281 = !DILocation(line: 0, scope: !275, inlinedAt: !282)
!282 = distinct !DILocation(line: 261, column: 46, scope: !241)
!283 = !DILocation(line: 393, column: 33, scope: !284, inlinedAt: !282)
!284 = distinct !DILexicalBlock(scope: !275, file: !276, line: 393, column: 6)
!285 = !DILocation(line: 393, column: 6, scope: !275, inlinedAt: !282)
!286 = !DILocation(line: 398, column: 33, scope: !287, inlinedAt: !282)
!287 = distinct !DILexicalBlock(scope: !275, file: !276, line: 398, column: 6)
!288 = !DILocation(line: 398, column: 6, scope: !275, inlinedAt: !282)
!289 = !DILocation(line: 403, column: 33, scope: !290, inlinedAt: !282)
!290 = distinct !DILexicalBlock(scope: !275, file: !276, line: 403, column: 6)
!291 = !DILocation(line: 403, column: 6, scope: !275, inlinedAt: !282)
!292 = !DILocation(line: 408, column: 33, scope: !293, inlinedAt: !282)
!293 = distinct !DILexicalBlock(scope: !275, file: !276, line: 408, column: 6)
!294 = !DILocation(line: 408, column: 6, scope: !275, inlinedAt: !282)
!295 = !DILocation(line: 413, column: 6, scope: !275, inlinedAt: !282)
!296 = !DILocation(line: 261, column: 43, scope: !241)
!297 = !DILocation(line: 262, column: 9, scope: !250)
!298 = !DILocation(line: 262, column: 6, scope: !241)
!299 = !DILocalVariable(name: "n", arg: 1, scope: !300, file: !276, line: 475, type: !75)
!300 = distinct !DISubprogram(name: "ctz32", scope: !276, file: !276, line: 475, type: !277, scopeLine: 476, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !301)
!301 = !{!299, !302}
!302 = !DILocalVariable(name: "i", scope: !300, file: !276, line: 495, type: !75)
!303 = !DILocation(line: 0, scope: !300, inlinedAt: !304)
!304 = distinct !DILocation(line: 264, column: 8, scope: !249)
!305 = !DILocation(line: 497, column: 9, scope: !306, inlinedAt: !304)
!306 = distinct !DILexicalBlock(scope: !300, file: !276, line: 497, column: 6)
!307 = !DILocation(line: 497, column: 33, scope: !306, inlinedAt: !304)
!308 = !DILocation(line: 497, column: 6, scope: !300, inlinedAt: !304)
!309 = !DILocation(line: 502, column: 9, scope: !310, inlinedAt: !304)
!310 = distinct !DILexicalBlock(scope: !300, file: !276, line: 502, column: 6)
!311 = !DILocation(line: 502, column: 33, scope: !310, inlinedAt: !304)
!312 = !DILocation(line: 502, column: 6, scope: !300, inlinedAt: !304)
!313 = !DILocation(line: 507, column: 9, scope: !314, inlinedAt: !304)
!314 = distinct !DILexicalBlock(scope: !300, file: !276, line: 507, column: 6)
!315 = !DILocation(line: 507, column: 33, scope: !314, inlinedAt: !304)
!316 = !DILocation(line: 507, column: 6, scope: !300, inlinedAt: !304)
!317 = !DILocation(line: 512, column: 9, scope: !318, inlinedAt: !304)
!318 = distinct !DILexicalBlock(scope: !300, file: !276, line: 512, column: 6)
!319 = !DILocation(line: 512, column: 33, scope: !318, inlinedAt: !304)
!320 = !DILocation(line: 512, column: 6, scope: !300, inlinedAt: !304)
!321 = !DILocation(line: 517, column: 9, scope: !322, inlinedAt: !304)
!322 = distinct !DILexicalBlock(scope: !300, file: !276, line: 517, column: 6)
!323 = !DILocation(line: 517, column: 6, scope: !300, inlinedAt: !304)
!324 = !DILocation(line: 264, column: 27, scope: !249)
!325 = !DILocation(line: 265, column: 3, scope: !249)
!326 = !DILocation(line: 0, scope: !249)
!327 = !DILocation(line: 266, column: 17, scope: !328)
!328 = distinct !DILexicalBlock(scope: !249, file: !1, line: 265, column: 6)
!329 = !DILocation(line: 267, column: 12, scope: !249)
!330 = !DILocation(line: 267, column: 3, scope: !328)
!331 = distinct !{!331, !332}
!332 = !{!"llvm.loop.unroll.disable"}
!333 = !DILocation(line: 267, column: 17, scope: !249)
!334 = distinct !{!334, !325, !335}
!335 = !DILocation(line: 267, column: 20, scope: !249)
!336 = !DILocation(line: 270, column: 34, scope: !249)
!337 = !DILocation(line: 272, column: 13, scope: !338)
!338 = distinct !DILexicalBlock(scope: !249, file: !1, line: 272, column: 7)
!339 = !DILocation(line: 272, column: 20, scope: !338)
!340 = !DILocation(line: 272, column: 7, scope: !249)
!341 = !DILocation(line: 0, scope: !338)
!342 = !DILocation(line: 279, column: 25, scope: !249)
!343 = !DILocation(line: 279, column: 10, scope: !249)
!344 = !DILocation(line: 279, column: 17, scope: !249)
!345 = !DILocation(line: 281, column: 24, scope: !249)
!346 = !DILocation(line: 281, column: 15, scope: !249)
!347 = !DILocation(line: 282, column: 19, scope: !348)
!348 = distinct !DILexicalBlock(scope: !249, file: !1, line: 282, column: 7)
!349 = !DILocation(line: 282, column: 7, scope: !249)
!350 = !DILocation(line: 283, column: 17, scope: !348)
!351 = !DILocation(line: 283, column: 24, scope: !348)
!352 = !DILocation(line: 283, column: 4, scope: !348)
!353 = !DILocation(line: 285, column: 15, scope: !249)
!354 = !DILocation(line: 286, column: 16, scope: !249)
!355 = !DILocation(line: 287, column: 2, scope: !249)
!356 = !DILocation(line: 290, column: 1, scope: !241)
!357 = distinct !DISubprogram(name: "lzma_index_end", scope: !1, file: !1, line: 417, type: !358, scopeLine: 418, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !360)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !146, !157}
!360 = !{!361, !362}
!361 = !DILocalVariable(name: "i", arg: 1, scope: !357, file: !1, line: 417, type: !146)
!362 = !DILocalVariable(name: "allocator", arg: 2, scope: !357, file: !1, line: 417, type: !157)
!363 = !DILocation(line: 0, scope: !357)
!364 = !DILocation(line: 421, column: 8, scope: !365)
!365 = distinct !DILexicalBlock(scope: !357, file: !1, line: 421, column: 6)
!366 = !DILocation(line: 421, column: 6, scope: !357)
!367 = !DILocation(line: 422, column: 3, scope: !368)
!368 = distinct !DILexicalBlock(scope: !365, file: !1, line: 421, column: 17)
!369 = !DILocalVariable(name: "tree", arg: 1, scope: !370, file: !1, line: 218, type: !189)
!370 = distinct !DISubprogram(name: "index_tree_end", scope: !1, file: !1, line: 218, type: !371, scopeLine: 220, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !374)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !189, !157, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!374 = !{!369, !375, !376}
!375 = !DILocalVariable(name: "allocator", arg: 2, scope: !370, file: !1, line: 218, type: !157)
!376 = !DILocalVariable(name: "free_func", arg: 3, scope: !370, file: !1, line: 219, type: !373)
!377 = !DILocation(line: 0, scope: !370, inlinedAt: !378)
!378 = distinct !DILocation(line: 422, column: 3, scope: !368)
!379 = !DILocation(line: 221, column: 17, scope: !380, inlinedAt: !378)
!380 = distinct !DILexicalBlock(scope: !370, file: !1, line: 221, column: 6)
!381 = !DILocation(line: 221, column: 6, scope: !370, inlinedAt: !378)
!382 = !DILocation(line: 222, column: 3, scope: !380, inlinedAt: !378)
!383 = !DILocation(line: 423, column: 3, scope: !368)
!384 = !DILocation(line: 424, column: 2, scope: !368)
!385 = !DILocation(line: 426, column: 2, scope: !357)
!386 = distinct !DISubprogram(name: "index_stream_end", scope: !1, file: !1, line: 371, type: !239, scopeLine: 372, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !387)
!387 = !{!388, !389, !390}
!388 = !DILocalVariable(name: "node", arg: 1, scope: !386, file: !1, line: 371, type: !49)
!389 = !DILocalVariable(name: "allocator", arg: 2, scope: !386, file: !1, line: 371, type: !157)
!390 = !DILocalVariable(name: "s", scope: !386, file: !1, line: 373, type: !133)
!391 = !DILocation(line: 0, scope: !386)
!392 = !DILocation(line: 374, column: 21, scope: !386)
!393 = !DILocation(line: 374, column: 2, scope: !386)
!394 = !DILocation(line: 0, scope: !370, inlinedAt: !395)
!395 = distinct !DILocation(line: 374, column: 2, scope: !386)
!396 = !DILocation(line: 221, column: 17, scope: !380, inlinedAt: !395)
!397 = !DILocation(line: 221, column: 6, scope: !370, inlinedAt: !395)
!398 = !DILocation(line: 222, column: 3, scope: !380, inlinedAt: !395)
!399 = !DILocation(line: 376, column: 1, scope: !386)
!400 = distinct !DISubprogram(name: "lzma_index_prealloc", scope: !1, file: !1, line: 431, type: !401, scopeLine: 432, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !403)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !146, !63}
!403 = !{!404, !405}
!404 = !DILocalVariable(name: "i", arg: 1, scope: !400, file: !1, line: 431, type: !146)
!405 = !DILocalVariable(name: "records", arg: 2, scope: !400, file: !1, line: 431, type: !63)
!406 = !DILocation(line: 0, scope: !400)
!407 = !DILocation(line: 433, column: 6, scope: !400)
!408 = !DILocation(line: 436, column: 5, scope: !400)
!409 = !DILocation(line: 436, column: 14, scope: !400)
!410 = !DILocation(line: 437, column: 2, scope: !400)
!411 = distinct !DISubprogram(name: "lzma_index_memusage", scope: !1, file: !1, line: 442, type: !412, scopeLine: 443, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!65, !63, !63}
!414 = !{!415, !416, !417, !419, !420, !421, !423, !425, !426, !427}
!415 = !DILocalVariable(name: "streams", arg: 1, scope: !411, file: !1, line: 442, type: !63)
!416 = !DILocalVariable(name: "blocks", arg: 2, scope: !411, file: !1, line: 442, type: !63)
!417 = !DILocalVariable(name: "alloc_overhead", scope: !411, file: !1, line: 451, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!419 = !DILocalVariable(name: "stream_base", scope: !411, file: !1, line: 456, type: !418)
!420 = !DILocalVariable(name: "group_base", scope: !411, file: !1, line: 460, type: !418)
!421 = !DILocalVariable(name: "groups", scope: !411, file: !1, line: 466, type: !422)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!423 = !DILocalVariable(name: "streams_mem", scope: !411, file: !1, line: 470, type: !424)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!425 = !DILocalVariable(name: "groups_mem", scope: !411, file: !1, line: 471, type: !424)
!426 = !DILocalVariable(name: "index_base", scope: !411, file: !1, line: 474, type: !424)
!427 = !DILocalVariable(name: "limit", scope: !411, file: !1, line: 479, type: !424)
!428 = !DILocation(line: 0, scope: !411)
!429 = !DILocation(line: 467, column: 33, scope: !411)
!430 = !DILocation(line: 467, column: 38, scope: !411)
!431 = !DILocation(line: 470, column: 39, scope: !411)
!432 = !DILocation(line: 471, column: 37, scope: !411)
!433 = !DILocation(line: 480, column: 19, scope: !434)
!434 = distinct !DILexicalBlock(scope: !411, file: !1, line: 480, column: 6)
!435 = !DILocation(line: 487, column: 1, scope: !411)
!436 = distinct !DISubprogram(name: "lzma_index_memused", scope: !1, file: !1, line: 491, type: !437, scopeLine: 492, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !441)
!437 = !DISubroutineType(types: !438)
!438 = !{!65, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!441 = !{!442}
!442 = !DILocalVariable(name: "i", arg: 1, scope: !436, file: !1, line: 491, type: !439)
!443 = !DILocation(line: 0, scope: !436)
!444 = !DILocation(line: 493, column: 40, scope: !436)
!445 = !DILocation(line: 493, column: 29, scope: !436)
!446 = !DILocation(line: 493, column: 50, scope: !436)
!447 = !DILocation(line: 0, scope: !411, inlinedAt: !448)
!448 = distinct !DILocation(line: 493, column: 9, scope: !436)
!449 = !DILocation(line: 467, column: 33, scope: !411, inlinedAt: !448)
!450 = !DILocation(line: 467, column: 38, scope: !411, inlinedAt: !448)
!451 = !DILocation(line: 470, column: 39, scope: !411, inlinedAt: !448)
!452 = !DILocation(line: 471, column: 37, scope: !411, inlinedAt: !448)
!453 = !DILocation(line: 480, column: 19, scope: !434, inlinedAt: !448)
!454 = !DILocation(line: 493, column: 2, scope: !436)
!455 = distinct !DISubprogram(name: "lzma_index_block_count", scope: !1, file: !1, line: 498, type: !456, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!63, !439}
!458 = !{!459}
!459 = !DILocalVariable(name: "i", arg: 1, scope: !455, file: !1, line: 498, type: !439)
!460 = !DILocation(line: 0, scope: !455)
!461 = !DILocation(line: 500, column: 12, scope: !455)
!462 = !DILocation(line: 500, column: 2, scope: !455)
!463 = distinct !DISubprogram(name: "lzma_index_stream_count", scope: !1, file: !1, line: 505, type: !456, scopeLine: 506, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !464)
!464 = !{!465}
!465 = !DILocalVariable(name: "i", arg: 1, scope: !463, file: !1, line: 505, type: !439)
!466 = !DILocation(line: 0, scope: !463)
!467 = !DILocation(line: 507, column: 20, scope: !463)
!468 = !DILocation(line: 507, column: 9, scope: !463)
!469 = !DILocation(line: 507, column: 2, scope: !463)
!470 = distinct !DISubprogram(name: "lzma_index_size", scope: !1, file: !1, line: 512, type: !456, scopeLine: 513, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !471)
!471 = !{!472}
!472 = !DILocalVariable(name: "i", arg: 1, scope: !470, file: !1, line: 512, type: !439)
!473 = !DILocation(line: 0, scope: !470)
!474 = !DILocation(line: 514, column: 23, scope: !470)
!475 = !DILocation(line: 514, column: 40, scope: !470)
!476 = !DILocalVariable(name: "count", arg: 1, scope: !477, file: !478, line: 57, type: !63)
!477 = distinct !DISubprogram(name: "index_size", scope: !478, file: !478, line: 57, type: !479, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !481)
!478 = !DIFile(filename: "liblzma/common/index.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "8c1da33cfb6445c1ed40367774c91b69")
!479 = !DISubroutineType(types: !480)
!480 = !{!63, !63, !63}
!481 = !{!476, !482}
!482 = !DILocalVariable(name: "index_list_size", arg: 2, scope: !477, file: !478, line: 57, type: !63)
!483 = !DILocation(line: 0, scope: !477, inlinedAt: !484)
!484 = distinct !DILocation(line: 514, column: 9, scope: !470)
!485 = !DILocalVariable(name: "count", arg: 1, scope: !486, file: !478, line: 48, type: !63)
!486 = distinct !DISubprogram(name: "index_size_unpadded", scope: !478, file: !478, line: 48, type: !479, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !487)
!487 = !{!485, !488}
!488 = !DILocalVariable(name: "index_list_size", arg: 2, scope: !486, file: !478, line: 48, type: !63)
!489 = !DILocation(line: 0, scope: !486, inlinedAt: !490)
!490 = distinct !DILocation(line: 59, column: 19, scope: !477, inlinedAt: !484)
!491 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !490)
!492 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !490)
!493 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !490)
!494 = !DILocalVariable(name: "vli", arg: 1, scope: !495, file: !478, line: 39, type: !63)
!495 = distinct !DISubprogram(name: "vli_ceil4", scope: !478, file: !478, line: 39, type: !496, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{!63, !63}
!498 = !{!494}
!499 = !DILocation(line: 0, scope: !495, inlinedAt: !500)
!500 = distinct !DILocation(line: 59, column: 9, scope: !477, inlinedAt: !484)
!501 = !DILocation(line: 51, column: 52, scope: !486, inlinedAt: !490)
!502 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !500)
!503 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !500)
!504 = !DILocation(line: 514, column: 2, scope: !470)
!505 = distinct !DISubprogram(name: "lzma_index_total_size", scope: !1, file: !1, line: 519, type: !456, scopeLine: 520, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !506)
!506 = !{!507}
!507 = !DILocalVariable(name: "i", arg: 1, scope: !505, file: !1, line: 519, type: !439)
!508 = !DILocation(line: 0, scope: !505)
!509 = !DILocation(line: 521, column: 12, scope: !505)
!510 = !DILocation(line: 521, column: 2, scope: !505)
!511 = distinct !DISubprogram(name: "lzma_index_stream_size", scope: !1, file: !1, line: 526, type: !456, scopeLine: 527, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !512)
!512 = !{!513}
!513 = !DILocalVariable(name: "i", arg: 1, scope: !511, file: !1, line: 526, type: !439)
!514 = !DILocation(line: 0, scope: !511)
!515 = !DILocation(line: 529, column: 38, scope: !511)
!516 = !DILocation(line: 530, column: 20, scope: !511)
!517 = !DILocation(line: 530, column: 37, scope: !511)
!518 = !DILocation(line: 0, scope: !477, inlinedAt: !519)
!519 = distinct !DILocation(line: 530, column: 6, scope: !511)
!520 = !DILocation(line: 0, scope: !486, inlinedAt: !521)
!521 = distinct !DILocation(line: 59, column: 19, scope: !477, inlinedAt: !519)
!522 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !521)
!523 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !521)
!524 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !521)
!525 = !DILocation(line: 0, scope: !495, inlinedAt: !526)
!526 = distinct !DILocation(line: 59, column: 9, scope: !477, inlinedAt: !519)
!527 = !DILocation(line: 51, column: 52, scope: !486, inlinedAt: !521)
!528 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !526)
!529 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !526)
!530 = !DILocation(line: 530, column: 4, scope: !511)
!531 = !DILocation(line: 531, column: 4, scope: !511)
!532 = !DILocation(line: 529, column: 2, scope: !511)
!533 = distinct !DISubprogram(name: "lzma_index_file_size", scope: !1, file: !1, line: 560, type: !456, scopeLine: 561, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !534)
!534 = !{!535, !536, !537}
!535 = !DILocalVariable(name: "i", arg: 1, scope: !533, file: !1, line: 560, type: !439)
!536 = !DILocalVariable(name: "s", scope: !533, file: !1, line: 562, type: !53)
!537 = !DILocalVariable(name: "g", scope: !533, file: !1, line: 563, type: !115)
!538 = !DILocation(line: 0, scope: !533)
!539 = !DILocation(line: 562, column: 60, scope: !533)
!540 = !DILocation(line: 563, column: 57, scope: !533)
!541 = !DILocation(line: 564, column: 33, scope: !533)
!542 = !DILocation(line: 565, column: 6, scope: !533)
!543 = !DILocation(line: 565, column: 4, scope: !533)
!544 = !DILocation(line: 565, column: 23, scope: !533)
!545 = !DILocation(line: 565, column: 34, scope: !533)
!546 = !DILocation(line: 565, column: 40, scope: !533)
!547 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !548)
!548 = distinct !DILocation(line: 546, column: 23, scope: !549, inlinedAt: !559)
!549 = distinct !DISubprogram(name: "index_file_size", scope: !1, file: !1, line: 536, type: !550, scopeLine: 539, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!63, !63, !63, !63, !63, !63}
!552 = !{!553, !554, !555, !556, !557, !558}
!553 = !DILocalVariable(name: "compressed_base", arg: 1, scope: !549, file: !1, line: 536, type: !63)
!554 = !DILocalVariable(name: "unpadded_sum", arg: 2, scope: !549, file: !1, line: 536, type: !63)
!555 = !DILocalVariable(name: "record_count", arg: 3, scope: !549, file: !1, line: 537, type: !63)
!556 = !DILocalVariable(name: "index_list_size", arg: 4, scope: !549, file: !1, line: 537, type: !63)
!557 = !DILocalVariable(name: "stream_padding", arg: 5, scope: !549, file: !1, line: 538, type: !63)
!558 = !DILocalVariable(name: "file_size", scope: !549, file: !1, line: 545, type: !63)
!559 = distinct !DILocation(line: 564, column: 9, scope: !533)
!560 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !548)
!561 = !DILocation(line: 567, column: 7, scope: !533)
!562 = !DILocation(line: 0, scope: !549, inlinedAt: !559)
!563 = !DILocation(line: 545, column: 39, scope: !549, inlinedAt: !559)
!564 = !DILocation(line: 0, scope: !495, inlinedAt: !548)
!565 = !DILocation(line: 546, column: 4, scope: !549, inlinedAt: !559)
!566 = !DILocation(line: 546, column: 21, scope: !549, inlinedAt: !559)
!567 = !DILocation(line: 547, column: 16, scope: !568, inlinedAt: !559)
!568 = distinct !DILexicalBlock(scope: !549, file: !1, line: 547, column: 6)
!569 = !DILocation(line: 547, column: 6, scope: !549, inlinedAt: !559)
!570 = !DILocation(line: 566, column: 24, scope: !533)
!571 = !DILocation(line: 566, column: 7, scope: !533)
!572 = !DILocation(line: 0, scope: !477, inlinedAt: !573)
!573 = distinct !DILocation(line: 551, column: 15, scope: !549, inlinedAt: !559)
!574 = !DILocation(line: 0, scope: !486, inlinedAt: !575)
!575 = distinct !DILocation(line: 59, column: 19, scope: !477, inlinedAt: !573)
!576 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !575)
!577 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !575)
!578 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !575)
!579 = !DILocation(line: 0, scope: !495, inlinedAt: !580)
!580 = distinct !DILocation(line: 59, column: 9, scope: !477, inlinedAt: !573)
!581 = !DILocation(line: 51, column: 52, scope: !486, inlinedAt: !575)
!582 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !580)
!583 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !580)
!584 = !DILocation(line: 551, column: 12, scope: !549, inlinedAt: !559)
!585 = !DILocation(line: 564, column: 2, scope: !533)
!586 = distinct !DISubprogram(name: "lzma_index_uncompressed_size", scope: !1, file: !1, line: 572, type: !456, scopeLine: 573, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !587)
!587 = !{!588}
!588 = !DILocalVariable(name: "i", arg: 1, scope: !586, file: !1, line: 572, type: !439)
!589 = !DILocation(line: 0, scope: !586)
!590 = !DILocation(line: 574, column: 12, scope: !586)
!591 = !DILocation(line: 574, column: 2, scope: !586)
!592 = distinct !DISubprogram(name: "lzma_index_checks", scope: !1, file: !1, line: 579, type: !593, scopeLine: 580, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !595)
!593 = !DISubroutineType(types: !594)
!594 = !{!75, !439}
!595 = !{!596, !597, !598}
!596 = !DILocalVariable(name: "i", arg: 1, scope: !592, file: !1, line: 579, type: !439)
!597 = !DILocalVariable(name: "checks", scope: !592, file: !1, line: 581, type: !75)
!598 = !DILocalVariable(name: "s", scope: !592, file: !1, line: 584, type: !53)
!599 = !DILocation(line: 0, scope: !592)
!600 = !DILocation(line: 581, column: 23, scope: !592)
!601 = !DILocation(line: 584, column: 60, scope: !592)
!602 = !DILocation(line: 585, column: 9, scope: !603)
!603 = distinct !DILexicalBlock(scope: !592, file: !1, line: 585, column: 6)
!604 = !DILocation(line: 585, column: 22, scope: !603)
!605 = !DILocation(line: 585, column: 30, scope: !603)
!606 = !DILocation(line: 585, column: 6, scope: !592)
!607 = !DILocation(line: 586, column: 44, scope: !603)
!608 = !DILocation(line: 586, column: 25, scope: !603)
!609 = !DILocation(line: 586, column: 10, scope: !603)
!610 = !DILocation(line: 586, column: 3, scope: !603)
!611 = !DILocation(line: 588, column: 2, scope: !592)
!612 = distinct !DISubprogram(name: "lzma_index_padding_size", scope: !1, file: !1, line: 593, type: !593, scopeLine: 594, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !613)
!613 = !{!614}
!614 = !DILocalVariable(name: "i", arg: 1, scope: !612, file: !1, line: 593, type: !439)
!615 = !DILocation(line: 0, scope: !612)
!616 = !DILocation(line: 596, column: 7, scope: !612)
!617 = !DILocation(line: 596, column: 24, scope: !612)
!618 = !DILocation(line: 0, scope: !486, inlinedAt: !619)
!619 = distinct !DILocation(line: 595, column: 26, scope: !612)
!620 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !619)
!621 = !DILocation(line: 595, column: 9, scope: !612)
!622 = !DILocation(line: 595, column: 2, scope: !612)
!623 = distinct !DISubprogram(name: "lzma_index_stream_flags", scope: !1, file: !1, line: 601, type: !624, scopeLine: 602, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !629)
!624 = !DISubroutineType(types: !625)
!625 = !{!626, !146, !627}
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !12, line: 237, baseType: !15)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!629 = !{!630, !631, !632, !635}
!630 = !DILocalVariable(name: "i", arg: 1, scope: !623, file: !1, line: 601, type: !146)
!631 = !DILocalVariable(name: "stream_flags", arg: 2, scope: !623, file: !1, line: 601, type: !627)
!632 = !DILocalVariable(name: "ret_", scope: !633, file: !1, line: 607, type: !634)
!633 = distinct !DILexicalBlock(scope: !623, file: !1, line: 607, column: 2)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!635 = !DILocalVariable(name: "s", scope: !623, file: !1, line: 610, type: !133)
!636 = !DILocation(line: 0, scope: !623)
!637 = !DILocation(line: 603, column: 8, scope: !638)
!638 = distinct !DILexicalBlock(scope: !623, file: !1, line: 603, column: 6)
!639 = !DILocation(line: 603, column: 16, scope: !638)
!640 = !DILocation(line: 607, column: 2, scope: !633)
!641 = !DILocation(line: 0, scope: !633)
!642 = !DILocation(line: 607, column: 2, scope: !643)
!643 = distinct !DILexicalBlock(scope: !633, file: !1, line: 607, column: 2)
!644 = !DILocation(line: 610, column: 48, scope: !623)
!645 = !DILocation(line: 611, column: 5, scope: !623)
!646 = !DILocation(line: 611, column: 20, scope: !623)
!647 = !DILocation(line: 614, column: 1, scope: !623)
!648 = !DISubprogram(name: "lzma_stream_flags_compare", scope: !90, file: !90, line: 221, type: !649, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!649 = !DISubroutineType(types: !650)
!650 = !{!626, !627, !627}
!651 = distinct !DISubprogram(name: "lzma_index_stream_padding", scope: !1, file: !1, line: 618, type: !652, scopeLine: 619, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !654)
!652 = !DISubroutineType(types: !653)
!653 = !{!626, !146, !63}
!654 = !{!655, !656, !657, !658}
!655 = !DILocalVariable(name: "i", arg: 1, scope: !651, file: !1, line: 618, type: !146)
!656 = !DILocalVariable(name: "stream_padding", arg: 2, scope: !651, file: !1, line: 618, type: !63)
!657 = !DILocalVariable(name: "s", scope: !651, file: !1, line: 624, type: !133)
!658 = !DILocalVariable(name: "old_stream_padding", scope: !651, file: !1, line: 627, type: !422)
!659 = !DILocation(line: 0, scope: !651)
!660 = !DILocation(line: 620, column: 8, scope: !661)
!661 = distinct !DILexicalBlock(scope: !651, file: !1, line: 620, column: 6)
!662 = !DILocation(line: 620, column: 16, scope: !661)
!663 = !DILocation(line: 624, column: 48, scope: !651)
!664 = !DILocation(line: 627, column: 41, scope: !651)
!665 = !DILocation(line: 628, column: 20, scope: !651)
!666 = !DILocation(line: 0, scope: !533, inlinedAt: !667)
!667 = distinct !DILocation(line: 629, column: 6, scope: !668)
!668 = distinct !DILexicalBlock(scope: !651, file: !1, line: 629, column: 6)
!669 = !DILocation(line: 562, column: 60, scope: !533, inlinedAt: !667)
!670 = !DILocation(line: 563, column: 57, scope: !533, inlinedAt: !667)
!671 = !DILocation(line: 564, column: 33, scope: !533, inlinedAt: !667)
!672 = !DILocation(line: 565, column: 6, scope: !533, inlinedAt: !667)
!673 = !DILocation(line: 565, column: 4, scope: !533, inlinedAt: !667)
!674 = !DILocation(line: 565, column: 23, scope: !533, inlinedAt: !667)
!675 = !DILocation(line: 565, column: 34, scope: !533, inlinedAt: !667)
!676 = !DILocation(line: 565, column: 40, scope: !533, inlinedAt: !667)
!677 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !678)
!678 = distinct !DILocation(line: 546, column: 23, scope: !549, inlinedAt: !679)
!679 = distinct !DILocation(line: 564, column: 9, scope: !533, inlinedAt: !667)
!680 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !678)
!681 = !DILocation(line: 567, column: 7, scope: !533, inlinedAt: !667)
!682 = !DILocation(line: 0, scope: !549, inlinedAt: !679)
!683 = !DILocation(line: 545, column: 39, scope: !549, inlinedAt: !679)
!684 = !DILocation(line: 0, scope: !495, inlinedAt: !678)
!685 = !DILocation(line: 546, column: 4, scope: !549, inlinedAt: !679)
!686 = !DILocation(line: 546, column: 21, scope: !549, inlinedAt: !679)
!687 = !DILocation(line: 547, column: 16, scope: !568, inlinedAt: !679)
!688 = !DILocation(line: 547, column: 6, scope: !549, inlinedAt: !679)
!689 = !DILocation(line: 566, column: 24, scope: !533, inlinedAt: !667)
!690 = !DILocation(line: 566, column: 7, scope: !533, inlinedAt: !667)
!691 = !DILocation(line: 0, scope: !477, inlinedAt: !692)
!692 = distinct !DILocation(line: 551, column: 15, scope: !549, inlinedAt: !679)
!693 = !DILocation(line: 0, scope: !486, inlinedAt: !694)
!694 = distinct !DILocation(line: 59, column: 19, scope: !477, inlinedAt: !692)
!695 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !694)
!696 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !694)
!697 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !694)
!698 = !DILocation(line: 0, scope: !495, inlinedAt: !699)
!699 = distinct !DILocation(line: 59, column: 9, scope: !477, inlinedAt: !692)
!700 = !DILocation(line: 51, column: 52, scope: !486, inlinedAt: !694)
!701 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !699)
!702 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !699)
!703 = !DILocation(line: 551, column: 12, scope: !549, inlinedAt: !679)
!704 = !DILocation(line: 629, column: 30, scope: !668)
!705 = !DILocation(line: 629, column: 47, scope: !668)
!706 = !DILocation(line: 636, column: 1, scope: !651)
!707 = distinct !DISubprogram(name: "lzma_index_append", scope: !1, file: !1, line: 640, type: !708, scopeLine: 642, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{!626, !146, !157, !63, !63}
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719}
!711 = !DILocalVariable(name: "i", arg: 1, scope: !707, file: !1, line: 640, type: !146)
!712 = !DILocalVariable(name: "allocator", arg: 2, scope: !707, file: !1, line: 640, type: !157)
!713 = !DILocalVariable(name: "unpadded_size", arg: 3, scope: !707, file: !1, line: 641, type: !63)
!714 = !DILocalVariable(name: "uncompressed_size", arg: 4, scope: !707, file: !1, line: 641, type: !63)
!715 = !DILocalVariable(name: "s", scope: !707, file: !1, line: 649, type: !133)
!716 = !DILocalVariable(name: "g", scope: !707, file: !1, line: 650, type: !134)
!717 = !DILocalVariable(name: "compressed_base", scope: !707, file: !1, line: 652, type: !422)
!718 = !DILocalVariable(name: "uncompressed_base", scope: !707, file: !1, line: 654, type: !422)
!719 = !DILocalVariable(name: "index_list_size_add", scope: !707, file: !1, line: 656, type: !720)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!721 = !DILocation(line: 0, scope: !707)
!722 = !DILocation(line: 644, column: 8, scope: !723)
!723 = distinct !DILexicalBlock(scope: !707, file: !1, line: 644, column: 6)
!724 = !DILocation(line: 644, column: 16, scope: !723)
!725 = !DILocation(line: 649, column: 48, scope: !707)
!726 = !DILocation(line: 650, column: 38, scope: !707)
!727 = !DILocation(line: 650, column: 45, scope: !707)
!728 = !DILocation(line: 652, column: 37, scope: !707)
!729 = !DILocation(line: 652, column: 35, scope: !707)
!730 = !DILocation(line: 653, column: 19, scope: !707)
!731 = !DILocation(line: 653, column: 30, scope: !707)
!732 = !DILocation(line: 653, column: 36, scope: !707)
!733 = !DILocation(line: 0, scope: !495, inlinedAt: !734)
!734 = distinct !DILocation(line: 653, column: 6, scope: !707)
!735 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !734)
!736 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !734)
!737 = !DILocation(line: 655, column: 6, scope: !707)
!738 = !DILocation(line: 655, column: 26, scope: !707)
!739 = !DILocation(line: 654, column: 37, scope: !707)
!740 = !DILocation(line: 656, column: 39, scope: !707)
!741 = !DILocation(line: 657, column: 6, scope: !707)
!742 = !DILocation(line: 657, column: 4, scope: !707)
!743 = !DILocation(line: 660, column: 30, scope: !744)
!744 = distinct !DILexicalBlock(scope: !707, file: !1, line: 660, column: 6)
!745 = !DILocation(line: 661, column: 20, scope: !744)
!746 = !DILocation(line: 661, column: 40, scope: !744)
!747 = !DILocation(line: 662, column: 25, scope: !744)
!748 = !DILocation(line: 663, column: 7, scope: !744)
!749 = !DILocation(line: 0, scope: !549, inlinedAt: !750)
!750 = distinct !DILocation(line: 660, column: 6, scope: !744)
!751 = !DILocation(line: 0, scope: !495, inlinedAt: !752)
!752 = distinct !DILocation(line: 546, column: 23, scope: !549, inlinedAt: !750)
!753 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !752)
!754 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !752)
!755 = !DILocation(line: 545, column: 39, scope: !549, inlinedAt: !750)
!756 = !DILocation(line: 546, column: 4, scope: !549, inlinedAt: !750)
!757 = !DILocation(line: 546, column: 21, scope: !549, inlinedAt: !750)
!758 = !DILocation(line: 547, column: 16, scope: !568, inlinedAt: !750)
!759 = !DILocation(line: 547, column: 6, scope: !549, inlinedAt: !750)
!760 = !DILocation(line: 662, column: 7, scope: !744)
!761 = !DILocation(line: 661, column: 53, scope: !744)
!762 = !DILocation(line: 0, scope: !477, inlinedAt: !763)
!763 = distinct !DILocation(line: 551, column: 15, scope: !549, inlinedAt: !750)
!764 = !DILocation(line: 0, scope: !486, inlinedAt: !765)
!765 = distinct !DILocation(line: 59, column: 19, scope: !477, inlinedAt: !763)
!766 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !765)
!767 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !765)
!768 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !765)
!769 = !DILocation(line: 0, scope: !495, inlinedAt: !770)
!770 = distinct !DILocation(line: 59, column: 9, scope: !477, inlinedAt: !763)
!771 = !DILocation(line: 662, column: 23, scope: !744)
!772 = !DILocation(line: 51, column: 52, scope: !486, inlinedAt: !765)
!773 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !770)
!774 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !770)
!775 = !DILocation(line: 551, column: 12, scope: !549, inlinedAt: !750)
!776 = !DILocation(line: 663, column: 23, scope: !744)
!777 = !DILocation(line: 660, column: 6, scope: !707)
!778 = !DILocation(line: 668, column: 20, scope: !779)
!779 = distinct !DILexicalBlock(scope: !707, file: !1, line: 668, column: 6)
!780 = !DILocation(line: 668, column: 33, scope: !779)
!781 = !DILocation(line: 669, column: 7, scope: !779)
!782 = !DILocation(line: 0, scope: !477, inlinedAt: !783)
!783 = distinct !DILocation(line: 668, column: 6, scope: !779)
!784 = !DILocation(line: 0, scope: !486, inlinedAt: !785)
!785 = distinct !DILocation(line: 59, column: 19, scope: !477, inlinedAt: !783)
!786 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !785)
!787 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !785)
!788 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !785)
!789 = !DILocation(line: 0, scope: !495, inlinedAt: !790)
!790 = distinct !DILocation(line: 59, column: 9, scope: !477, inlinedAt: !783)
!791 = !DILocation(line: 51, column: 52, scope: !486, inlinedAt: !785)
!792 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !790)
!793 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !790)
!794 = !DILocation(line: 670, column: 4, scope: !779)
!795 = !DILocation(line: 668, column: 6, scope: !707)
!796 = !DILocation(line: 673, column: 16, scope: !797)
!797 = distinct !DILexicalBlock(scope: !707, file: !1, line: 673, column: 6)
!798 = !DILocation(line: 673, column: 22, scope: !797)
!799 = !DILocation(line: 673, column: 27, scope: !797)
!800 = !DILocation(line: 673, column: 36, scope: !797)
!801 = !DILocation(line: 673, column: 31, scope: !797)
!802 = !DILocation(line: 673, column: 6, scope: !707)
!803 = !DILocation(line: 675, column: 3, scope: !804)
!804 = distinct !DILexicalBlock(scope: !797, file: !1, line: 673, column: 47)
!805 = !DILocation(line: 676, column: 2, scope: !804)
!806 = !DILocation(line: 679, column: 10, scope: !807)
!807 = distinct !DILexicalBlock(scope: !797, file: !1, line: 676, column: 9)
!808 = !DILocation(line: 679, column: 19, scope: !807)
!809 = !DILocation(line: 679, column: 5, scope: !807)
!810 = !DILocation(line: 678, column: 7, scope: !807)
!811 = !DILocation(line: 681, column: 9, scope: !812)
!812 = distinct !DILexicalBlock(scope: !807, file: !1, line: 681, column: 7)
!813 = !DILocation(line: 681, column: 7, scope: !807)
!814 = !DILocation(line: 684, column: 6, scope: !807)
!815 = !DILocation(line: 684, column: 11, scope: !807)
!816 = !DILocation(line: 685, column: 21, scope: !807)
!817 = !DILocation(line: 685, column: 6, scope: !807)
!818 = !DILocation(line: 685, column: 16, scope: !807)
!819 = !DILocation(line: 689, column: 15, scope: !807)
!820 = !DILocation(line: 692, column: 29, scope: !807)
!821 = !DILocation(line: 693, column: 11, scope: !807)
!822 = !DILocation(line: 693, column: 27, scope: !807)
!823 = !DILocation(line: 694, column: 23, scope: !807)
!824 = !DILocation(line: 694, column: 36, scope: !807)
!825 = !DILocation(line: 694, column: 6, scope: !807)
!826 = !DILocation(line: 694, column: 18, scope: !807)
!827 = !DILocation(line: 697, column: 3, scope: !807)
!828 = !DILocation(line: 701, column: 16, scope: !707)
!829 = !DILocation(line: 702, column: 24, scope: !707)
!830 = !DILocation(line: 701, column: 5, scope: !707)
!831 = !DILocation(line: 701, column: 2, scope: !707)
!832 = !DILocation(line: 702, column: 4, scope: !707)
!833 = !DILocation(line: 703, column: 22, scope: !707)
!834 = !DILocation(line: 704, column: 4, scope: !707)
!835 = !DILocation(line: 707, column: 2, scope: !707)
!836 = !DILocation(line: 0, scope: !495, inlinedAt: !837)
!837 = distinct !DILocation(line: 710, column: 19, scope: !707)
!838 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !837)
!839 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !837)
!840 = !DILocation(line: 710, column: 5, scope: !707)
!841 = !DILocation(line: 711, column: 5, scope: !707)
!842 = !DILocation(line: 711, column: 23, scope: !707)
!843 = !DILocation(line: 710, column: 16, scope: !707)
!844 = !DILocation(line: 713, column: 21, scope: !707)
!845 = !DILocation(line: 715, column: 2, scope: !707)
!846 = !DILocation(line: 716, column: 1, scope: !707)
!847 = !DISubprogram(name: "lzma_vli_size", scope: !64, file: !64, line: 165, type: !848, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!848 = !DISubroutineType(types: !849)
!849 = !{!75, !63}
!850 = !DISubprogram(name: "lzma_alloc", scope: !238, file: !238, line: 211, type: !851, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!851 = !DISubroutineType(types: !852)
!852 = !{!49, !50, !157}
!853 = distinct !DISubprogram(name: "lzma_index_cat", scope: !1, file: !1, line: 767, type: !854, scopeLine: 769, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !857)
!854 = !DISubroutineType(types: !855)
!855 = !{!626, !856, !856, !157}
!856 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !146)
!857 = !{!858, !859, !860, !861, !862, !864, !865, !867, !868, !871}
!858 = !DILocalVariable(name: "dest", arg: 1, scope: !853, file: !1, line: 767, type: !856)
!859 = !DILocalVariable(name: "src", arg: 2, scope: !853, file: !1, line: 767, type: !856)
!860 = !DILocalVariable(name: "allocator", arg: 3, scope: !853, file: !1, line: 768, type: !157)
!861 = !DILocalVariable(name: "dest_file_size", scope: !853, file: !1, line: 770, type: !422)
!862 = !DILocalVariable(name: "dest_size", scope: !863, file: !1, line: 785, type: !422)
!863 = distinct !DILexicalBlock(scope: !853, file: !1, line: 784, column: 2)
!864 = !DILocalVariable(name: "src_size", scope: !863, file: !1, line: 787, type: !422)
!865 = !DILocalVariable(name: "s", scope: !866, file: !1, line: 796, type: !133)
!866 = distinct !DILexicalBlock(scope: !853, file: !1, line: 795, column: 2)
!867 = !DILocalVariable(name: "g", scope: !866, file: !1, line: 797, type: !134)
!868 = !DILocalVariable(name: "newg", scope: !869, file: !1, line: 802, type: !134)
!869 = distinct !DILexicalBlock(scope: !870, file: !1, line: 798, column: 48)
!870 = distinct !DILexicalBlock(scope: !866, file: !1, line: 798, column: 7)
!871 = !DILocalVariable(name: "info", scope: !853, file: !1, line: 837, type: !872)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_cat_info", file: !1, line: 738, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 720, size: 320, elements: !875)
!875 = !{!876, !877, !878, !879, !880}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !874, file: !1, line: 722, baseType: !63, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !874, file: !1, line: 725, baseType: !63, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "block_number_add", scope: !874, file: !1, line: 728, baseType: !63, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "stream_number_add", scope: !874, file: !1, line: 733, baseType: !75, size: 32, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !874, file: !1, line: 736, baseType: !189, size: 64, offset: 256)
!881 = distinct !DIAssignID()
!882 = !DILocation(line: 0, scope: !853)
!883 = !DILocation(line: 0, scope: !533, inlinedAt: !884)
!884 = distinct !DILocation(line: 770, column: 34, scope: !853)
!885 = !DILocation(line: 562, column: 60, scope: !533, inlinedAt: !884)
!886 = !DILocation(line: 563, column: 57, scope: !533, inlinedAt: !884)
!887 = !DILocation(line: 564, column: 33, scope: !533, inlinedAt: !884)
!888 = !DILocation(line: 565, column: 6, scope: !533, inlinedAt: !884)
!889 = !DILocation(line: 565, column: 4, scope: !533, inlinedAt: !884)
!890 = !DILocation(line: 565, column: 23, scope: !533, inlinedAt: !884)
!891 = !DILocation(line: 565, column: 34, scope: !533, inlinedAt: !884)
!892 = !DILocation(line: 565, column: 40, scope: !533, inlinedAt: !884)
!893 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !894)
!894 = distinct !DILocation(line: 546, column: 23, scope: !549, inlinedAt: !895)
!895 = distinct !DILocation(line: 564, column: 9, scope: !533, inlinedAt: !884)
!896 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !894)
!897 = !DILocation(line: 567, column: 7, scope: !533, inlinedAt: !884)
!898 = !DILocation(line: 0, scope: !549, inlinedAt: !895)
!899 = !DILocation(line: 545, column: 39, scope: !549, inlinedAt: !895)
!900 = !DILocation(line: 0, scope: !495, inlinedAt: !894)
!901 = !DILocation(line: 546, column: 4, scope: !549, inlinedAt: !895)
!902 = !DILocation(line: 546, column: 21, scope: !549, inlinedAt: !895)
!903 = !DILocation(line: 547, column: 16, scope: !568, inlinedAt: !895)
!904 = !DILocation(line: 547, column: 6, scope: !549, inlinedAt: !895)
!905 = !DILocation(line: 566, column: 24, scope: !533, inlinedAt: !884)
!906 = !DILocation(line: 566, column: 7, scope: !533, inlinedAt: !884)
!907 = !DILocation(line: 0, scope: !477, inlinedAt: !908)
!908 = distinct !DILocation(line: 551, column: 15, scope: !549, inlinedAt: !895)
!909 = !DILocation(line: 0, scope: !486, inlinedAt: !910)
!910 = distinct !DILocation(line: 59, column: 19, scope: !477, inlinedAt: !908)
!911 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !910)
!912 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !910)
!913 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !910)
!914 = !DILocation(line: 0, scope: !495, inlinedAt: !915)
!915 = distinct !DILocation(line: 59, column: 9, scope: !477, inlinedAt: !908)
!916 = !DILocation(line: 51, column: 52, scope: !486, inlinedAt: !910)
!917 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !915)
!918 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !915)
!919 = !DILocation(line: 551, column: 12, scope: !549, inlinedAt: !895)
!920 = !DILocation(line: 0, scope: !533, inlinedAt: !921)
!921 = distinct !DILocation(line: 773, column: 23, scope: !922)
!922 = distinct !DILexicalBlock(scope: !853, file: !1, line: 773, column: 6)
!923 = !DILocation(line: 562, column: 60, scope: !533, inlinedAt: !921)
!924 = !DILocation(line: 563, column: 57, scope: !533, inlinedAt: !921)
!925 = !DILocation(line: 564, column: 33, scope: !533, inlinedAt: !921)
!926 = !DILocation(line: 565, column: 6, scope: !533, inlinedAt: !921)
!927 = !DILocation(line: 565, column: 4, scope: !533, inlinedAt: !921)
!928 = !DILocation(line: 565, column: 23, scope: !533, inlinedAt: !921)
!929 = !DILocation(line: 565, column: 34, scope: !533, inlinedAt: !921)
!930 = !DILocation(line: 565, column: 40, scope: !533, inlinedAt: !921)
!931 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !932)
!932 = distinct !DILocation(line: 546, column: 23, scope: !549, inlinedAt: !933)
!933 = distinct !DILocation(line: 564, column: 9, scope: !533, inlinedAt: !921)
!934 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !932)
!935 = !DILocation(line: 567, column: 7, scope: !533, inlinedAt: !921)
!936 = !DILocation(line: 0, scope: !549, inlinedAt: !933)
!937 = !DILocation(line: 545, column: 39, scope: !549, inlinedAt: !933)
!938 = !DILocation(line: 0, scope: !495, inlinedAt: !932)
!939 = !DILocation(line: 546, column: 4, scope: !549, inlinedAt: !933)
!940 = !DILocation(line: 546, column: 21, scope: !549, inlinedAt: !933)
!941 = !DILocation(line: 547, column: 16, scope: !568, inlinedAt: !933)
!942 = !DILocation(line: 547, column: 6, scope: !549, inlinedAt: !933)
!943 = !DILocation(line: 566, column: 24, scope: !533, inlinedAt: !921)
!944 = !DILocation(line: 566, column: 7, scope: !533, inlinedAt: !921)
!945 = !DILocation(line: 0, scope: !477, inlinedAt: !946)
!946 = distinct !DILocation(line: 551, column: 15, scope: !549, inlinedAt: !933)
!947 = !DILocation(line: 0, scope: !486, inlinedAt: !948)
!948 = distinct !DILocation(line: 59, column: 19, scope: !477, inlinedAt: !946)
!949 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !948)
!950 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !948)
!951 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !948)
!952 = !DILocation(line: 0, scope: !495, inlinedAt: !953)
!953 = distinct !DILocation(line: 59, column: 9, scope: !477, inlinedAt: !946)
!954 = !DILocation(line: 51, column: 52, scope: !486, inlinedAt: !948)
!955 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !953)
!956 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !953)
!957 = !DILocation(line: 551, column: 12, scope: !549, inlinedAt: !933)
!958 = !DILocation(line: 773, column: 21, scope: !922)
!959 = !DILocation(line: 773, column: 49, scope: !922)
!960 = !DILocation(line: 774, column: 4, scope: !922)
!961 = !DILocation(line: 774, column: 13, scope: !922)
!962 = !DILocation(line: 774, column: 38, scope: !922)
!963 = !DILocation(line: 774, column: 31, scope: !922)
!964 = !DILocation(line: 775, column: 5, scope: !922)
!965 = !DILocation(line: 773, column: 6, scope: !853)
!966 = !DILocation(line: 786, column: 11, scope: !863)
!967 = !DILocation(line: 786, column: 31, scope: !863)
!968 = !DILocation(line: 0, scope: !486, inlinedAt: !969)
!969 = distinct !DILocation(line: 785, column: 30, scope: !863)
!970 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !969)
!971 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !969)
!972 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !969)
!973 = !DILocation(line: 0, scope: !863)
!974 = !DILocation(line: 788, column: 10, scope: !863)
!975 = !DILocation(line: 0, scope: !486, inlinedAt: !976)
!976 = distinct !DILocation(line: 787, column: 29, scope: !863)
!977 = !DILocation(line: 51, column: 13, scope: !486, inlinedAt: !976)
!978 = !DILocation(line: 51, column: 11, scope: !486, inlinedAt: !976)
!979 = !DILocation(line: 51, column: 9, scope: !486, inlinedAt: !976)
!980 = !DILocation(line: 0, scope: !495, inlinedAt: !981)
!981 = distinct !DILocation(line: 789, column: 7, scope: !982)
!982 = distinct !DILexicalBlock(scope: !863, file: !1, line: 789, column: 7)
!983 = !DILocation(line: 51, column: 34, scope: !486, inlinedAt: !969)
!984 = !DILocation(line: 51, column: 52, scope: !486, inlinedAt: !969)
!985 = !DILocation(line: 789, column: 27, scope: !982)
!986 = !DILocation(line: 42, column: 14, scope: !495, inlinedAt: !981)
!987 = !DILocation(line: 42, column: 19, scope: !495, inlinedAt: !981)
!988 = !DILocation(line: 789, column: 39, scope: !982)
!989 = !DILocation(line: 0, scope: !866)
!990 = !DILocation(line: 797, column: 39, scope: !866)
!991 = !DILocation(line: 797, column: 46, scope: !866)
!992 = !DILocation(line: 798, column: 9, scope: !870)
!993 = !DILocation(line: 798, column: 17, scope: !870)
!994 = !DILocation(line: 798, column: 23, scope: !870)
!995 = !DILocation(line: 798, column: 28, scope: !870)
!996 = !DILocation(line: 798, column: 37, scope: !870)
!997 = !DILocation(line: 798, column: 32, scope: !870)
!998 = !DILocation(line: 798, column: 7, scope: !866)
!999 = !DILocation(line: 804, column: 6, scope: !869)
!1000 = !DILocation(line: 803, column: 6, scope: !869)
!1001 = !DILocation(line: 802, column: 24, scope: !869)
!1002 = !DILocation(line: 0, scope: !869)
!1003 = !DILocation(line: 806, column: 13, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !869, file: !1, line: 806, column: 8)
!1005 = !DILocation(line: 806, column: 8, scope: !869)
!1006 = !DILocation(line: 809, column: 20, scope: !869)
!1007 = !DILocation(line: 810, column: 25, scope: !869)
!1008 = !DILocation(line: 810, column: 30, scope: !869)
!1009 = !DILocation(line: 810, column: 10, scope: !869)
!1010 = !DILocation(line: 810, column: 20, scope: !869)
!1011 = !DILocation(line: 811, column: 20, scope: !869)
!1012 = !DILocation(line: 811, column: 10, scope: !869)
!1013 = !DILocation(line: 811, column: 15, scope: !869)
!1014 = !DILocation(line: 812, column: 27, scope: !869)
!1015 = !DILocation(line: 812, column: 10, scope: !869)
!1016 = !DILocation(line: 812, column: 22, scope: !869)
!1017 = !DILocation(line: 814, column: 17, scope: !869)
!1018 = !DILocation(line: 814, column: 29, scope: !869)
!1019 = !DILocation(line: 815, column: 6, scope: !869)
!1020 = !DILocation(line: 814, column: 4, scope: !869)
!1021 = !DILocation(line: 817, column: 16, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !869, file: !1, line: 817, column: 8)
!1023 = !DILocation(line: 817, column: 23, scope: !1022)
!1024 = !DILocation(line: 817, column: 8, scope: !869)
!1025 = !DILocation(line: 819, column: 21, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !1, line: 817, column: 32)
!1027 = !DILocation(line: 819, column: 27, scope: !1026)
!1028 = !DILocation(line: 820, column: 4, scope: !1026)
!1029 = !DILocation(line: 822, column: 18, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !869, file: !1, line: 822, column: 8)
!1031 = !DILocation(line: 822, column: 27, scope: !1030)
!1032 = !DILocation(line: 822, column: 8, scope: !869)
!1033 = !DILocation(line: 824, column: 24, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !1, line: 822, column: 40)
!1035 = !DILocation(line: 825, column: 20, scope: !1034)
!1036 = !DILocation(line: 826, column: 4, scope: !1034)
!1037 = !DILocation(line: 828, column: 18, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !869, file: !1, line: 828, column: 8)
!1039 = !DILocation(line: 828, column: 28, scope: !1038)
!1040 = !DILocation(line: 828, column: 8, scope: !869)
!1041 = !DILocation(line: 829, column: 25, scope: !1038)
!1042 = !DILocation(line: 829, column: 5, scope: !1038)
!1043 = !DILocation(line: 831, column: 4, scope: !869)
!1044 = !DILocation(line: 837, column: 2, scope: !853)
!1045 = !DILocation(line: 837, column: 30, scope: !853)
!1046 = distinct !DIAssignID()
!1047 = distinct !DIAssignID()
!1048 = distinct !DIAssignID()
!1049 = !DILocation(line: 840, column: 38, scope: !853)
!1050 = distinct !DIAssignID()
!1051 = distinct !DIAssignID()
!1052 = !DILocation(line: 844, column: 56, scope: !853)
!1053 = !DILocation(line: 844, column: 2, scope: !853)
!1054 = !DILocation(line: 847, column: 26, scope: !853)
!1055 = !DILocation(line: 848, column: 27, scope: !853)
!1056 = !DILocation(line: 848, column: 8, scope: !853)
!1057 = !DILocation(line: 848, column: 19, scope: !853)
!1058 = !DILocation(line: 849, column: 21, scope: !853)
!1059 = !DILocation(line: 0, scope: !592, inlinedAt: !1060)
!1060 = distinct !DILocation(line: 851, column: 17, scope: !853)
!1061 = !DILocation(line: 581, column: 23, scope: !592, inlinedAt: !1060)
!1062 = !DILocation(line: 584, column: 60, scope: !592, inlinedAt: !1060)
!1063 = !DILocation(line: 585, column: 9, scope: !603, inlinedAt: !1060)
!1064 = !DILocation(line: 585, column: 22, scope: !603, inlinedAt: !1060)
!1065 = !DILocation(line: 585, column: 30, scope: !603, inlinedAt: !1060)
!1066 = !DILocation(line: 585, column: 6, scope: !592, inlinedAt: !1060)
!1067 = !DILocation(line: 586, column: 44, scope: !603, inlinedAt: !1060)
!1068 = !DILocation(line: 586, column: 25, scope: !603, inlinedAt: !1060)
!1069 = !DILocation(line: 586, column: 10, scope: !603, inlinedAt: !1060)
!1070 = !DILocation(line: 586, column: 3, scope: !603, inlinedAt: !1060)
!1071 = !DILocation(line: 851, column: 48, scope: !853)
!1072 = !DILocation(line: 851, column: 41, scope: !853)
!1073 = !DILocation(line: 851, column: 15, scope: !853)
!1074 = !DILocation(line: 854, column: 2, scope: !853)
!1075 = !DILocation(line: 857, column: 1, scope: !853)
!1076 = distinct !DISubprogram(name: "index_cat_helper", scope: !1, file: !1, line: 745, type: !1077, scopeLine: 746, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1080)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{null, !1079, !133}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!1080 = !{!1081, !1082, !1083, !1084}
!1081 = !DILocalVariable(name: "info", arg: 1, scope: !1076, file: !1, line: 745, type: !1079)
!1082 = !DILocalVariable(name: "this", arg: 2, scope: !1076, file: !1, line: 745, type: !133)
!1083 = !DILocalVariable(name: "left", scope: !1076, file: !1, line: 747, type: !133)
!1084 = !DILocalVariable(name: "right", scope: !1076, file: !1, line: 748, type: !133)
!1085 = !DILocation(line: 0, scope: !1076)
!1086 = !DILocation(line: 747, column: 51, scope: !1076)
!1087 = !DILocation(line: 748, column: 52, scope: !1076)
!1088 = !DILocation(line: 750, column: 11, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1076, file: !1, line: 750, column: 6)
!1090 = !DILocation(line: 750, column: 6, scope: !1076)
!1091 = !DILocation(line: 751, column: 3, scope: !1089)
!1092 = !DILocation(line: 753, column: 40, scope: !1076)
!1093 = !DILocation(line: 753, column: 31, scope: !1076)
!1094 = !DILocation(line: 754, column: 38, scope: !1076)
!1095 = !DILocation(line: 754, column: 13, scope: !1076)
!1096 = !DILocation(line: 754, column: 29, scope: !1076)
!1097 = !DILocation(line: 755, column: 24, scope: !1076)
!1098 = !DILocation(line: 755, column: 8, scope: !1076)
!1099 = !DILocation(line: 755, column: 15, scope: !1076)
!1100 = !DILocation(line: 756, column: 35, scope: !1076)
!1101 = !DILocation(line: 756, column: 8, scope: !1076)
!1102 = !DILocation(line: 756, column: 26, scope: !1076)
!1103 = !DILocation(line: 757, column: 26, scope: !1076)
!1104 = !DILocation(line: 757, column: 2, scope: !1076)
!1105 = !DILocation(line: 759, column: 12, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1076, file: !1, line: 759, column: 6)
!1107 = !DILocation(line: 759, column: 6, scope: !1076)
!1108 = !DILocation(line: 763, column: 1, scope: !1076)
!1109 = distinct !DISubprogram(name: "lzma_index_dup", scope: !1, file: !1, line: 922, type: !1110, scopeLine: 923, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1112)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!146, !439, !157}
!1112 = !{!1113, !1114, !1115, !1116, !1117}
!1113 = !DILocalVariable(name: "src", arg: 1, scope: !1109, file: !1, line: 922, type: !439)
!1114 = !DILocalVariable(name: "allocator", arg: 2, scope: !1109, file: !1, line: 922, type: !157)
!1115 = !DILocalVariable(name: "dest", scope: !1109, file: !1, line: 925, type: !146)
!1116 = !DILocalVariable(name: "srcstream", scope: !1109, file: !1, line: 936, type: !53)
!1117 = !DILocalVariable(name: "deststream", scope: !1118, file: !1, line: 939, type: !133)
!1118 = distinct !DILexicalBlock(scope: !1109, file: !1, line: 938, column: 5)
!1119 = !DILocation(line: 0, scope: !1109)
!1120 = !DILocation(line: 0, scope: !176, inlinedAt: !1121)
!1121 = distinct !DILocation(line: 925, column: 21, scope: !1109)
!1122 = !DILocation(line: 382, column: 18, scope: !176, inlinedAt: !1121)
!1123 = !DILocation(line: 383, column: 8, scope: !183, inlinedAt: !1121)
!1124 = !DILocation(line: 383, column: 6, scope: !176, inlinedAt: !1121)
!1125 = !DILocation(line: 0, scope: !186, inlinedAt: !1126)
!1126 = distinct !DILocation(line: 384, column: 3, scope: !193, inlinedAt: !1121)
!1127 = !DILocation(line: 185, column: 17, scope: !186, inlinedAt: !1126)
!1128 = !DILocation(line: 385, column: 6, scope: !193, inlinedAt: !1121)
!1129 = !DILocation(line: 389, column: 6, scope: !193, inlinedAt: !1121)
!1130 = !DILocation(line: 385, column: 24, scope: !193, inlinedAt: !1121)
!1131 = !DILocation(line: 389, column: 15, scope: !193, inlinedAt: !1121)
!1132 = !DILocation(line: 390, column: 6, scope: !193, inlinedAt: !1121)
!1133 = !DILocation(line: 390, column: 13, scope: !193, inlinedAt: !1121)
!1134 = !DILocation(line: 930, column: 33, scope: !1109)
!1135 = !DILocation(line: 930, column: 26, scope: !1109)
!1136 = !DILocation(line: 931, column: 26, scope: !1109)
!1137 = !DILocation(line: 931, column: 8, scope: !1109)
!1138 = !DILocation(line: 931, column: 19, scope: !1109)
!1139 = !DILocation(line: 932, column: 28, scope: !1109)
!1140 = !DILocation(line: 932, column: 8, scope: !1109)
!1141 = !DILocation(line: 932, column: 21, scope: !1109)
!1142 = !DILocation(line: 933, column: 31, scope: !1109)
!1143 = !DILocation(line: 933, column: 8, scope: !1109)
!1144 = !DILocation(line: 933, column: 24, scope: !1109)
!1145 = !DILocation(line: 937, column: 42, scope: !1109)
!1146 = !DILocalVariable(name: "src", arg: 1, scope: !1147, file: !1, line: 862, type: !53)
!1147 = distinct !DISubprogram(name: "index_dup_stream", scope: !1, file: !1, line: 862, type: !1148, scopeLine: 863, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1150)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!133, !53, !157}
!1150 = !{!1146, !1151, !1152, !1153, !1154, !1155}
!1151 = !DILocalVariable(name: "allocator", arg: 2, scope: !1147, file: !1, line: 862, type: !157)
!1152 = !DILocalVariable(name: "dest", scope: !1147, file: !1, line: 869, type: !133)
!1153 = !DILocalVariable(name: "destg", scope: !1147, file: !1, line: 887, type: !134)
!1154 = !DILocalVariable(name: "srcg", scope: !1147, file: !1, line: 903, type: !115)
!1155 = !DILocalVariable(name: "i", scope: !1147, file: !1, line: 904, type: !50)
!1156 = !DILocation(line: 0, scope: !1147, inlinedAt: !1157)
!1157 = distinct !DILocation(line: 939, column: 30, scope: !1118)
!1158 = !DILocation(line: 865, column: 11, scope: !1159, inlinedAt: !1157)
!1159 = distinct !DILexicalBlock(scope: !1147, file: !1, line: 865, column: 6)
!1160 = !DILocation(line: 865, column: 24, scope: !1159, inlinedAt: !1157)
!1161 = !DILocation(line: 865, column: 6, scope: !1147, inlinedAt: !1157)
!1162 = !DILocation(line: 870, column: 14, scope: !1147, inlinedAt: !1157)
!1163 = !DILocation(line: 870, column: 38, scope: !1147, inlinedAt: !1157)
!1164 = !DILocation(line: 871, column: 9, scope: !1147, inlinedAt: !1157)
!1165 = !DILocation(line: 0, scope: !202, inlinedAt: !1166)
!1166 = distinct !DILocation(line: 869, column: 23, scope: !1147, inlinedAt: !1157)
!1167 = !DILocation(line: 345, column: 20, scope: !202, inlinedAt: !1166)
!1168 = !DILocation(line: 346, column: 8, scope: !215, inlinedAt: !1166)
!1169 = !DILocation(line: 346, column: 6, scope: !202, inlinedAt: !1166)
!1170 = !DILocation(line: 349, column: 28, scope: !202, inlinedAt: !1166)
!1171 = !DILocation(line: 351, column: 10, scope: !202, inlinedAt: !1166)
!1172 = !DILocation(line: 355, column: 5, scope: !202, inlinedAt: !1166)
!1173 = !DILocation(line: 352, column: 15, scope: !202, inlinedAt: !1166)
!1174 = !DILocation(line: 355, column: 12, scope: !202, inlinedAt: !1166)
!1175 = !DILocation(line: 356, column: 5, scope: !202, inlinedAt: !1166)
!1176 = !DILocation(line: 356, column: 23, scope: !202, inlinedAt: !1166)
!1177 = !DILocation(line: 358, column: 22, scope: !202, inlinedAt: !1166)
!1178 = !DILocation(line: 0, scope: !186, inlinedAt: !1179)
!1179 = distinct !DILocation(line: 358, column: 2, scope: !202, inlinedAt: !1166)
!1180 = !DILocation(line: 185, column: 17, scope: !186, inlinedAt: !1179)
!1181 = !DILocation(line: 360, column: 5, scope: !202, inlinedAt: !1166)
!1182 = !DILocation(line: 362, column: 5, scope: !202, inlinedAt: !1166)
!1183 = !DILocation(line: 360, column: 18, scope: !202, inlinedAt: !1166)
!1184 = !DILocation(line: 362, column: 26, scope: !202, inlinedAt: !1166)
!1185 = !DILocation(line: 363, column: 5, scope: !202, inlinedAt: !1166)
!1186 = !DILocation(line: 363, column: 20, scope: !202, inlinedAt: !1166)
!1187 = !DILocation(line: 875, column: 34, scope: !1188, inlinedAt: !1157)
!1188 = distinct !DILexicalBlock(scope: !1147, file: !1, line: 875, column: 6)
!1189 = !DILocation(line: 875, column: 43, scope: !1188, inlinedAt: !1157)
!1190 = !DILocation(line: 875, column: 6, scope: !1147, inlinedAt: !1157)
!1191 = !DILocation(line: 879, column: 28, scope: !1147, inlinedAt: !1157)
!1192 = !DILocation(line: 879, column: 21, scope: !1147, inlinedAt: !1157)
!1193 = !DILocation(line: 880, column: 31, scope: !1147, inlinedAt: !1157)
!1194 = !DILocation(line: 880, column: 8, scope: !1147, inlinedAt: !1157)
!1195 = !DILocation(line: 880, column: 24, scope: !1147, inlinedAt: !1157)
!1196 = !DILocation(line: 881, column: 28, scope: !1147, inlinedAt: !1157)
!1197 = !DILocation(line: 882, column: 30, scope: !1147, inlinedAt: !1157)
!1198 = !DILocation(line: 882, column: 23, scope: !1147, inlinedAt: !1157)
!1199 = !DILocation(line: 888, column: 11, scope: !1147, inlinedAt: !1157)
!1200 = !DILocation(line: 888, column: 24, scope: !1147, inlinedAt: !1157)
!1201 = !DILocation(line: 888, column: 4, scope: !1147, inlinedAt: !1157)
!1202 = !DILocation(line: 887, column: 23, scope: !1147, inlinedAt: !1157)
!1203 = !DILocation(line: 890, column: 12, scope: !1204, inlinedAt: !1157)
!1204 = distinct !DILexicalBlock(scope: !1147, file: !1, line: 890, column: 6)
!1205 = !DILocation(line: 890, column: 6, scope: !1147, inlinedAt: !1157)
!1206 = !DILocation(line: 0, scope: !386, inlinedAt: !1207)
!1207 = distinct !DILocation(line: 891, column: 3, scope: !1208, inlinedAt: !1157)
!1208 = distinct !DILexicalBlock(scope: !1204, file: !1, line: 890, column: 21)
!1209 = !DILocation(line: 374, column: 2, scope: !386, inlinedAt: !1207)
!1210 = !DILocation(line: 0, scope: !370, inlinedAt: !1211)
!1211 = distinct !DILocation(line: 374, column: 2, scope: !386, inlinedAt: !1207)
!1212 = !DILocation(line: 221, column: 17, scope: !380, inlinedAt: !1211)
!1213 = !DILocation(line: 221, column: 6, scope: !370, inlinedAt: !1211)
!1214 = !DILocation(line: 222, column: 3, scope: !380, inlinedAt: !1211)
!1215 = !DILocation(line: 898, column: 9, scope: !1147, inlinedAt: !1157)
!1216 = !DILocation(line: 897, column: 30, scope: !1147, inlinedAt: !1157)
!1217 = !DILocation(line: 898, column: 21, scope: !1147, inlinedAt: !1157)
!1218 = !DILocation(line: 899, column: 26, scope: !1147, inlinedAt: !1157)
!1219 = !DILocation(line: 899, column: 9, scope: !1147, inlinedAt: !1157)
!1220 = !DILocation(line: 899, column: 19, scope: !1147, inlinedAt: !1157)
!1221 = !DILocation(line: 900, column: 34, scope: !1147, inlinedAt: !1157)
!1222 = !DILocation(line: 900, column: 9, scope: !1147, inlinedAt: !1157)
!1223 = !DILocation(line: 900, column: 14, scope: !1147, inlinedAt: !1157)
!1224 = !DILocation(line: 903, column: 62, scope: !1147, inlinedAt: !1157)
!1225 = !DILocation(line: 905, column: 2, scope: !1147, inlinedAt: !1157)
!1226 = !DILocation(line: 906, column: 25, scope: !1227, inlinedAt: !1157)
!1227 = distinct !DILexicalBlock(scope: !1147, file: !1, line: 905, column: 5)
!1228 = !DILocation(line: 906, column: 36, scope: !1227, inlinedAt: !1157)
!1229 = !DILocation(line: 907, column: 12, scope: !1227, inlinedAt: !1157)
!1230 = !DILocation(line: 907, column: 22, scope: !1227, inlinedAt: !1157)
!1231 = !DILocation(line: 906, column: 3, scope: !1227, inlinedAt: !1157)
!1232 = !DILocation(line: 908, column: 14, scope: !1227, inlinedAt: !1157)
!1233 = !DILocation(line: 908, column: 19, scope: !1227, inlinedAt: !1157)
!1234 = !DILocation(line: 908, column: 5, scope: !1227, inlinedAt: !1157)
!1235 = !DILocalVariable(name: "node", arg: 1, scope: !1236, file: !1, line: 295, type: !1239)
!1236 = distinct !DISubprogram(name: "index_tree_next", scope: !1, file: !1, line: 295, type: !1237, scopeLine: 296, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1241)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!49, !1239}
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!1241 = !{!1235}
!1242 = !DILocation(line: 0, scope: !1236, inlinedAt: !1243)
!1243 = distinct !DILocation(line: 909, column: 10, scope: !1227, inlinedAt: !1157)
!1244 = !DILocation(line: 297, column: 12, scope: !1245, inlinedAt: !1243)
!1245 = distinct !DILexicalBlock(scope: !1236, file: !1, line: 297, column: 6)
!1246 = !DILocation(line: 297, column: 18, scope: !1245, inlinedAt: !1243)
!1247 = !DILocation(line: 297, column: 6, scope: !1236, inlinedAt: !1243)
!1248 = !DILocation(line: 0, scope: !1249, inlinedAt: !1243)
!1249 = distinct !DILexicalBlock(scope: !1245, file: !1, line: 297, column: 27)
!1250 = !DILocation(line: 299, column: 16, scope: !1249, inlinedAt: !1243)
!1251 = !DILocation(line: 299, column: 21, scope: !1249, inlinedAt: !1243)
!1252 = !DILocation(line: 299, column: 3, scope: !1249, inlinedAt: !1243)
!1253 = distinct !{!1253, !1252, !1254}
!1254 = !DILocation(line: 300, column: 17, scope: !1249, inlinedAt: !1243)
!1255 = !DILocation(line: 305, column: 15, scope: !1236, inlinedAt: !1243)
!1256 = !DILocation(line: 305, column: 22, scope: !1236, inlinedAt: !1243)
!1257 = !DILocation(line: 305, column: 30, scope: !1236, inlinedAt: !1243)
!1258 = !DILocation(line: 305, column: 47, scope: !1236, inlinedAt: !1243)
!1259 = !DILocation(line: 305, column: 53, scope: !1236, inlinedAt: !1243)
!1260 = !DILocation(line: 305, column: 2, scope: !1236, inlinedAt: !1243)
!1261 = distinct !{!1261, !1260, !1262}
!1262 = !DILocation(line: 306, column: 16, scope: !1236, inlinedAt: !1243)
!1263 = !DILocation(line: 910, column: 2, scope: !1227, inlinedAt: !1157)
!1264 = distinct !{!1264, !1225, !1265}
!1265 = !DILocation(line: 910, column: 23, scope: !1147, inlinedAt: !1157)
!1266 = !DILocation(line: 915, column: 2, scope: !1147, inlinedAt: !1157)
!1267 = !DILocation(line: 0, scope: !1118)
!1268 = !DILocation(line: 941, column: 7, scope: !1118)
!1269 = !DILocation(line: 0, scope: !357, inlinedAt: !1270)
!1270 = distinct !DILocation(line: 942, column: 4, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1272, file: !1, line: 941, column: 27)
!1272 = distinct !DILexicalBlock(scope: !1118, file: !1, line: 941, column: 7)
!1273 = !DILocation(line: 422, column: 3, scope: !368, inlinedAt: !1270)
!1274 = !DILocation(line: 0, scope: !370, inlinedAt: !1275)
!1275 = distinct !DILocation(line: 422, column: 3, scope: !368, inlinedAt: !1270)
!1276 = !DILocation(line: 221, column: 17, scope: !380, inlinedAt: !1275)
!1277 = !DILocation(line: 221, column: 6, scope: !370, inlinedAt: !1275)
!1278 = !DILocation(line: 222, column: 3, scope: !380, inlinedAt: !1275)
!1279 = !DILocation(line: 423, column: 3, scope: !368, inlinedAt: !1270)
!1280 = !DILocation(line: 946, column: 3, scope: !1118)
!1281 = !DILocation(line: 0, scope: !1236, inlinedAt: !1282)
!1282 = distinct !DILocation(line: 948, column: 15, scope: !1118)
!1283 = !DILocation(line: 297, column: 12, scope: !1245, inlinedAt: !1282)
!1284 = !DILocation(line: 297, column: 18, scope: !1245, inlinedAt: !1282)
!1285 = !DILocation(line: 297, column: 6, scope: !1236, inlinedAt: !1282)
!1286 = !DILocation(line: 0, scope: !1249, inlinedAt: !1282)
!1287 = !DILocation(line: 299, column: 16, scope: !1249, inlinedAt: !1282)
!1288 = !DILocation(line: 299, column: 21, scope: !1249, inlinedAt: !1282)
!1289 = !DILocation(line: 299, column: 3, scope: !1249, inlinedAt: !1282)
!1290 = distinct !{!1290, !1289, !1291}
!1291 = !DILocation(line: 300, column: 17, scope: !1249, inlinedAt: !1282)
!1292 = !DILocation(line: 305, column: 15, scope: !1236, inlinedAt: !1282)
!1293 = !DILocation(line: 305, column: 22, scope: !1236, inlinedAt: !1282)
!1294 = !DILocation(line: 305, column: 30, scope: !1236, inlinedAt: !1282)
!1295 = !DILocation(line: 305, column: 47, scope: !1236, inlinedAt: !1282)
!1296 = !DILocation(line: 305, column: 53, scope: !1236, inlinedAt: !1282)
!1297 = !DILocation(line: 305, column: 2, scope: !1236, inlinedAt: !1282)
!1298 = distinct !{!1298, !1297, !1299}
!1299 = !DILocation(line: 306, column: 16, scope: !1236, inlinedAt: !1282)
!1300 = !DILocation(line: 952, column: 1, scope: !1109)
!1301 = distinct !DISubprogram(name: "lzma_index_iter_init", scope: !1, file: !1, line: 1077, type: !1302, scopeLine: 1078, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1357)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{null, !1304, !439}
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_iter", file: !42, line: 220, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 43, size: 2432, elements: !1307)
!1307 = !{!1308, !1328, !1348}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1306, file: !42, line: 114, baseType: !1309, size: 960)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1306, file: !42, line: 44, size: 960, elements: !1310)
!1310 = !{!1311, !1312, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1309, file: !42, line: 51, baseType: !627, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !1309, file: !42, line: 53, baseType: !1313, size: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !1309, file: !42, line: 54, baseType: !1313, size: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !1309, file: !42, line: 55, baseType: !1313, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !1309, file: !42, line: 62, baseType: !63, size: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !1309, file: !42, line: 70, baseType: !63, size: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_offset", scope: !1309, file: !42, line: 78, baseType: !63, size: 64, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_offset", scope: !1309, file: !42, line: 86, baseType: !63, size: 64, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !1309, file: !42, line: 94, baseType: !63, size: 64, offset: 512)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !1309, file: !42, line: 99, baseType: !63, size: 64, offset: 576)
