; ModuleID = 'liblzma/common/index_hash.c'
source_filename = "liblzma/common/index_hash.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind uwtable
define dso_local noundef ptr @lzma_index_hash_init(ptr noundef %index_hash, ptr noundef %allocator) local_unnamed_addr #0 !dbg !109 {
entry:
    #dbg_value(ptr %index_hash, !129, !DIExpression(), !131)
    #dbg_value(ptr %allocator, !130, !DIExpression(), !131)
  %cmp = icmp eq ptr %index_hash, null, !dbg !132
  br i1 %cmp, label %if.then, label %if.end3, !dbg !134

if.then:                                          ; preds = %entry
  %call = tail call ptr @lzma_alloc(i64 noundef 320, ptr noundef %allocator) #5, !dbg !135
    #dbg_value(ptr %call, !129, !DIExpression(), !131)
  %cmp1 = icmp eq ptr %call, null, !dbg !137
  br i1 %cmp1, label %return, label %if.end3, !dbg !139

if.end3:                                          ; preds = %if.then, %entry
  %index_hash.addr.0 = phi ptr [ %call, %if.then ], [ %index_hash, %entry ]
    #dbg_value(ptr %index_hash.addr.0, !129, !DIExpression(), !131)
  store i32 0, ptr %index_hash.addr.0, align 8, !dbg !140
  %blocks = getelementptr inbounds i8, ptr %index_hash.addr.0, i64 8, !dbg !141
  %records = getelementptr inbounds i8, ptr %index_hash.addr.0, i64 144, !dbg !142
  %unpadded_size = getelementptr inbounds i8, ptr %index_hash.addr.0, i64 288, !dbg !143

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !97, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/index_hash.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5b32f3be9e6ab3427cac2d3fabd9ce41")
!2 = !{!3, !75, !82}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !4, file: !1, line: 38, baseType: !41, size: 32, elements: !67)
!4 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_hash_s", file: !1, line: 37, size: 2560, elements: !5)
!5 = !{!6, !7, !59, !60, !61, !62, !63, !66}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !4, file: !1, line: 46, baseType: !3, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !4, file: !1, line: 49, baseType: !8, size: 1088, offset: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_hash_info", file: !1, line: 34, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 18, size: 1088, elements: !10)
!10 = !{!11, !19, !20, !21, !22}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_size", scope: !9, file: !1, line: 20, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !13, line: 63, baseType: !14)
!13 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !15, line: 27, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !17, line: 45, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!18 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !9, file: !1, line: 23, baseType: !12, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !9, file: !1, line: 26, baseType: !12, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "index_list_size", scope: !9, file: !1, line: 29, baseType: !12, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !9, file: !1, line: 32, baseType: !23, size: 832, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check_state", file: !24, line: 56, baseType: !25)
!24 = !DIFile(filename: "liblzma/check/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "938220df6e0ab33115ef85b0d8c70c5b")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 34, size: 832, elements: !26)
!26 = !{!27, !48}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !25, file: !24, line: 40, baseType: !28, size: 512)
!28 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !24, line: 36, size: 512, elements: !29)
!29 = !{!30, !37, !44}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !28, file: !24, line: 37, baseType: !31, size: 512)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, elements: !35)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 24, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !17, line: 38, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!36}
!36 = !DISubrange(count: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !28, file: !24, line: 38, baseType: !38, size: 512)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 512, elements: !42)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 26, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !17, line: 42, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !{!43}
!43 = !DISubrange(count: 16)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !28, file: !24, line: 39, baseType: !45, size: 512)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 8)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !25, file: !24, line: 54, baseType: !49, size: 320, offset: 512)
!49 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !24, line: 43, size: 320, elements: !50)
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !49, file: !24, line: 44, baseType: !39, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "crc64", scope: !49, file: !24, line: 45, baseType: !14, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !49, file: !24, line: 53, baseType: !54, size: 320)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !49, file: !24, line: 47, size: 320, elements: !55)
!55 = !{!56, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !54, file: !24, line: 49, baseType: !57, size: 256)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !46)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !24, line: 52, baseType: !14, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !4, file: !1, line: 52, baseType: !8, size: 1088, offset: 1152)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !4, file: !1, line: 55, baseType: !12, size: 64, offset: 2240)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_size", scope: !4, file: !1, line: 58, baseType: !12, size: 64, offset: 2304)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !4, file: !1, line: 61, baseType: !12, size: 64, offset: 2368)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !4, file: !1, line: 65, baseType: !64, size: 64, offset: 2432)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 18, baseType: !18)
!65 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !4, file: !1, line: 68, baseType: !39, size: 32, offset: 2496)
!67 = !{!68, !69, !70, !71, !72, !73, !74}
!68 = !DIEnumerator(name: "SEQ_BLOCK", value: 0)
!69 = !DIEnumerator(name: "SEQ_COUNT", value: 1)
!70 = !DIEnumerator(name: "SEQ_UNPADDED", value: 2)
!71 = !DIEnumerator(name: "SEQ_UNCOMPRESSED", value: 3)
!72 = !DIEnumerator(name: "SEQ_PADDING_INIT", value: 4)
!73 = !DIEnumerator(name: "SEQ_PADDING", value: 5)
!74 = !DIEnumerator(name: "SEQ_CRC32", value: 6)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 27, baseType: !41, size: 32, elements: !77)
!76 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!77 = !{!78, !79, !80, !81}
!78 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!79 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!80 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!81 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 57, baseType: !41, size: 32, elements: !84)
!83 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!85 = !DIEnumerator(name: "LZMA_OK", value: 0)
!86 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!87 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!88 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!89 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!90 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!91 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!92 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!93 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!94 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!95 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!96 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!101 = !{i32 7, !"Dwarf Version", i32 5}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{i32 1, !"wchar_size", i32 4}
!104 = !{i32 8, !"PIC Level", i32 2}
!105 = !{i32 7, !"PIE Level", i32 2}
!106 = !{i32 7, !"uwtable", i32 2}
!107 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!108 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!109 = distinct !DISubprogram(name: "lzma_index_hash_init", scope: !1, file: !1, line: 73, type: !110, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !128)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !112, !115}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_hash", file: !114, line: 25, baseType: !4)
!114 = !DIFile(filename: "liblzma/api/lzma/index_hash.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "93f41ec399d5b72fa726dbb2f572cbec")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !83, line: 403, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 341, size: 192, elements: !118)
!118 = !{!119, !123, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !117, file: !83, line: 376, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!98, !98, !64, !64}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !117, file: !83, line: 390, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !98, !98}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !117, file: !83, line: 401, baseType: !98, size: 64, offset: 128)
!128 = !{!129, !130}
!129 = !DILocalVariable(name: "index_hash", arg: 1, scope: !109, file: !1, line: 73, type: !112)
!130 = !DILocalVariable(name: "allocator", arg: 2, scope: !109, file: !1, line: 73, type: !115)
!131 = !DILocation(line: 0, scope: !109)
!132 = !DILocation(line: 75, column: 17, scope: !133)
!133 = distinct !DILexicalBlock(scope: !109, file: !1, line: 75, column: 6)
!134 = !DILocation(line: 75, column: 6, scope: !109)
!135 = !DILocation(line: 76, column: 16, scope: !136)
!136 = distinct !DILexicalBlock(scope: !133, file: !1, line: 75, column: 26)
!137 = !DILocation(line: 77, column: 18, scope: !138)
!138 = distinct !DILexicalBlock(scope: !136, file: !1, line: 77, column: 7)
!139 = !DILocation(line: 77, column: 7, scope: !136)
!140 = !DILocation(line: 81, column: 23, scope: !109)
!141 = !DILocation(line: 82, column: 14, scope: !109)
!142 = !DILocation(line: 86, column: 14, scope: !109)
!143 = !DILocation(line: 90, column: 14, scope: !109)
!144 = !DILocation(line: 96, column: 44, scope: !109)
!145 = !DILocation(line: 82, column: 33, scope: !109)
!146 = !DILocation(line: 86, column: 34, scope: !109)
!147 = !DILocation(line: 90, column: 28, scope: !109)
!148 = !DILocation(line: 96, column: 8, scope: !109)
!149 = !DILocation(line: 97, column: 45, scope: !109)
!150 = !DILocation(line: 97, column: 8, scope: !109)
!151 = !DILocation(line: 99, column: 2, scope: !109)
!152 = !DILocation(line: 100, column: 1, scope: !109)
!153 = !DISubprogram(name: "lzma_alloc", scope: !154, file: !154, line: 211, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!154 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!155 = !DISubroutineType(types: !156)
!156 = !{!98, !64, !115}
!157 = !DISubprogram(name: "lzma_check_init", scope: !24, file: !24, line: 75, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !160, !161}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !76, line: 55, baseType: !75)
!162 = distinct !DISubprogram(name: "lzma_index_hash_end", scope: !1, file: !1, line: 104, type: !163, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !112, !115}
!165 = !{!166, !167}
!166 = !DILocalVariable(name: "index_hash", arg: 1, scope: !162, file: !1, line: 104, type: !112)
!167 = !DILocalVariable(name: "allocator", arg: 2, scope: !162, file: !1, line: 104, type: !115)
!168 = !DILocation(line: 0, scope: !162)
!169 = !DILocation(line: 106, column: 2, scope: !162)
!170 = !DILocation(line: 107, column: 2, scope: !162)
!171 = !DISubprogram(name: "lzma_free", scope: !154, file: !154, line: 215, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !98, !115}
!174 = distinct !DISubprogram(name: "lzma_index_hash_size", scope: !1, file: !1, line: 112, type: !175, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !179)
!175 = !DISubroutineType(types: !176)
!176 = !{!12, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!179 = !{!180}
!180 = !DILocalVariable(name: "index_hash", arg: 1, scope: !174, file: !1, line: 112, type: !177)
!181 = !DILocation(line: 0, scope: !174)
!182 = !DILocation(line: 117, column: 39, scope: !174)
!183 = !DILocation(line: 118, column: 23, scope: !174)
!184 = !DILocalVariable(name: "count", arg: 1, scope: !185, file: !186, line: 57, type: !12)
