; ModuleID = 'liblzma/lzma/lzma_encoder.c'
source_filename = "liblzma/lzma/lzma_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_lz_options = type { i64, i64, i64, i64, i64, i32, i32, ptr, i32 }

@lzma_rc_prices = external local_unnamed_addr constant [128 x i8], align 16
@lzma_fastpos = external local_unnamed_addr constant [8192 x i8], align 16

; Function Attrs: nounwind uwtable
define dso_local range(i32 0, 2) i32 @lzma_lzma_encode(ptr noundef %pcoder, ptr noalias noundef %mf, ptr noalias nocapture noundef writeonly %out, ptr noalias nocapture noundef %out_pos, i64 noundef %out_size, i32 noundef %limit) local_unnamed_addr #0 !dbg !112 {
entry:
  %len = alloca i32, align 4, !DIAssignID !282
    #dbg_assign(i1 undef, !279, !DIExpression(), !282, ptr %len, !DIExpression(), !283)
  %back = alloca i32, align 4, !DIAssignID !284
    #dbg_assign(i1 undef, !281, !DIExpression(), !284, ptr %back, !DIExpression(), !283)
    #dbg_value(ptr %pcoder, !167, !DIExpression(), !285)
    #dbg_value(ptr %mf, !168, !DIExpression(), !285)
    #dbg_value(ptr %out, !169, !DIExpression(), !285)
    #dbg_value(ptr %out_pos, !170, !DIExpression(), !285)
    #dbg_value(i64 %out_size, !171, !DIExpression(), !285)
    #dbg_value(i32 %limit, !172, !DIExpression(), !285)
    #dbg_value(ptr %pcoder, !173, !DIExpression(), !285)

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !102, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lzma/lzma_encoder.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "05efdea695ffcfbe246da60087a9dd58")
!2 = !{!3, !19, !25, !65, !80, !85, !92, !95}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !27, file: !26, line: 40, baseType: !5, size: 32, elements: !59)
!26 = !DIFile(filename: "liblzma/rangecoder/range_encoder.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e02ad9079871d268a82b8ebf2e7d385d")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 27, size: 5888, elements: !28)
!28 = !{!29, !35, !36, !39, !43, !46, !47, !51}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !27, file: !26, line: 28, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 27, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !33, line: 45, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!34 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !27, file: !26, line: 29, baseType: !30, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !27, file: !26, line: 30, baseType: !37, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 26, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !33, line: 42, baseType: !5)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !27, file: !26, line: 31, baseType: !40, size: 8, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !31, line: 24, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !33, line: 38, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !27, file: !26, line: 34, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 18, baseType: !34)
!45 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !27, file: !26, line: 37, baseType: !44, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !27, file: !26, line: 46, baseType: !48, size: 1856, offset: 320)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 1856, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 58)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !27, file: !26, line: 49, baseType: !52, size: 3712, offset: 2176)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 3712, elements: !49)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "probability", file: !55, line: 71, baseType: !56)
!55 = !DIFile(filename: "liblzma/rangecoder/range_common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "7d3e93a1bf35640522f499de026cfdad")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !31, line: 25, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !33, line: 40, baseType: !58)
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !{!60, !61, !62, !63, !64}
!60 = !DIEnumerator(name: "RC_BIT_0", value: 0)
!61 = !DIEnumerator(name: "RC_BIT_1", value: 1)
!62 = !DIEnumerator(name: "RC_DIRECT_0", value: 2)
!63 = !DIEnumerator(name: "RC_DIRECT_1", value: 3)
!64 = !DIEnumerator(name: "RC_FLUSH", value: 4)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 56, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "liblzma/lzma/lzma_common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "ce364754aa91e57f603599f25328df33")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!68 = !DIEnumerator(name: "STATE_LIT_LIT", value: 0)
!69 = !DIEnumerator(name: "STATE_MATCH_LIT_LIT", value: 1)
!70 = !DIEnumerator(name: "STATE_REP_LIT_LIT", value: 2)
!71 = !DIEnumerator(name: "STATE_SHORTREP_LIT_LIT", value: 3)
!72 = !DIEnumerator(name: "STATE_MATCH_LIT", value: 4)
!73 = !DIEnumerator(name: "STATE_REP_LIT", value: 5)
!74 = !DIEnumerator(name: "STATE_SHORTREP_LIT", value: 6)
!75 = !DIEnumerator(name: "STATE_LIT_MATCH", value: 7)
!76 = !DIEnumerator(name: "STATE_LIT_LONGREP", value: 8)
!77 = !DIEnumerator(name: "STATE_LIT_SHORTREP", value: 9)
!78 = !DIEnumerator(name: "STATE_NONLIT_MATCH", value: 10)
!79 = !DIEnumerator(name: "STATE_NONLIT_REP", value: 11)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 138, baseType: !5, size: 32, elements: !82)
!81 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "c59c540efa0aff44f03d71331089fff8")
!82 = !{!83, !84}
!83 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!84 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 58, baseType: !5, size: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91}
!87 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!88 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!89 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!90 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!91 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !93)
!93 = !{!94}
!94 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 27, baseType: !5, size: 32, elements: !97)
!96 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!97 = !{!98, !99, !100, !101}
!98 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!99 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!100 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!101 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!102 = !{!103, !30, !37, !40}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !{i32 7, !"Dwarf Version", i32 5}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{i32 1, !"wchar_size", i32 4}
!107 = !{i32 8, !"PIC Level", i32 2}
!108 = !{i32 7, !"PIE Level", i32 2}
!109 = !{i32 7, !"uwtable", i32 2}
!110 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!111 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!112 = distinct !DISubprogram(name: "lzma_lzma_encode", scope: !1, file: !1, line: 318, type: !113, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !166)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !116, !119, !163, !164, !44, !37}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !118, line: 78, baseType: null)
!118 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!119 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !122, line: 28, baseType: !123)
!122 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "780f78e6e21a3ca52f57df68bfdc6f53")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !122, line: 29, size: 960, elements: !124)
!124 = !{!125, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !146, !150, !152, !153, !154, !155, !156, !157, !158, !159, !161, !162}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !123, file: !122, line: 35, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !123, file: !122, line: 39, baseType: !37, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !123, file: !122, line: 45, baseType: !37, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !123, file: !122, line: 51, baseType: !37, size: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !123, file: !122, line: 58, baseType: !37, size: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !123, file: !122, line: 63, baseType: !37, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !123, file: !122, line: 67, baseType: !37, size: 32, offset: 224)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !123, file: !122, line: 75, baseType: !37, size: 32, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !123, file: !122, line: 80, baseType: !37, size: 32, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !123, file: !122, line: 84, baseType: !37, size: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !123, file: !122, line: 92, baseType: !137, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!37, !120, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !122, line: 25, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 22, size: 64, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !142, file: !122, line: 23, baseType: !37, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !142, file: !122, line: 24, baseType: !37, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !123, file: !122, line: 97, baseType: !147, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !120, !37}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !123, file: !122, line: 99, baseType: !151, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !123, file: !122, line: 100, baseType: !151, size: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !123, file: !122, line: 101, baseType: !37, size: 32, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !123, file: !122, line: 102, baseType: !37, size: 32, offset: 672)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !123, file: !122, line: 103, baseType: !37, size: 32, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !123, file: !122, line: 106, baseType: !37, size: 32, offset: 736)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !123, file: !122, line: 109, baseType: !37, size: 32, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !123, file: !122, line: 114, baseType: !37, size: 32, offset: 800)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !123, file: !122, line: 119, baseType: !160, size: 32, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !123, file: !122, line: 122, baseType: !37, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !123, file: !122, line: 125, baseType: !37, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !126)
!164 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !278, !279, !281}
!167 = !DILocalVariable(name: "pcoder", arg: 1, scope: !112, file: !1, line: 318, type: !116)
!168 = !DILocalVariable(name: "mf", arg: 2, scope: !112, file: !1, line: 318, type: !119)
!169 = !DILocalVariable(name: "out", arg: 3, scope: !112, file: !1, line: 319, type: !163)
!170 = !DILocalVariable(name: "out_pos", arg: 4, scope: !112, file: !1, line: 319, type: !164)
!171 = !DILocalVariable(name: "out_size", arg: 5, scope: !112, file: !1, line: 320, type: !44)
!172 = !DILocalVariable(name: "limit", arg: 6, scope: !112, file: !1, line: 320, type: !37)
!173 = !DILocalVariable(name: "coder", scope: !112, file: !1, line: 322, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !177, line: 72, size: 1996608, elements: !178)
!177 = !DIFile(filename: "liblzma/lzma/lzma_encoder_private.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "0c1b7b41ddfbed104b8c32f19cfcc2b2")
!178 = !{!179, !181, !183, !187, !191, !192, !193, !195, !196, !197, !198, !199, !200, !205, !209, !212, !213, !214, !215, !216, !220, !224, !227, !249, !250, !252, !256, !257, !258, !259, !260, !261, !262}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !176, file: !177, line: 74, baseType: !180, size: 5888)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_range_encoder", file: !26, line: 51, baseType: !27)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !176, file: !177, line: 77, baseType: !182, size: 32, offset: 5888)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lzma_state", file: !66, line: 69, baseType: !65)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "reps", scope: !176, file: !177, line: 80, baseType: !184, size: 128, offset: 5920)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 128, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 4)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !176, file: !177, line: 83, baseType: !188, size: 17536, offset: 6048)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 17536, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 274)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "matches_count", scope: !176, file: !177, line: 86, baseType: !37, size: 32, offset: 23584)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "longest_match_length", scope: !176, file: !177, line: 90, baseType: !37, size: 32, offset: 23616)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fast_mode", scope: !176, file: !177, line: 93, baseType: !194, size: 8, offset: 23648)
!194 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !176, file: !177, line: 97, baseType: !194, size: 8, offset: 23656)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "is_flushed", scope: !176, file: !177, line: 101, baseType: !194, size: 8, offset: 23664)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pos_mask", scope: !176, file: !177, line: 103, baseType: !37, size: 32, offset: 23680)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "literal_context_bits", scope: !176, file: !177, line: 104, baseType: !37, size: 32, offset: 23712)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "literal_pos_mask", scope: !176, file: !177, line: 105, baseType: !37, size: 32, offset: 23744)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "literal", scope: !176, file: !177, line: 108, baseType: !201, size: 196608, offset: 23776)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 196608, elements: !202)
!202 = !{!203, !204}
!203 = !DISubrange(count: 16)
!204 = !DISubrange(count: 768)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "is_match", scope: !176, file: !177, line: 109, baseType: !206, size: 3072, offset: 220384)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 3072, elements: !207)
!207 = !{!208, !203}
!208 = !DISubrange(count: 12)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep", scope: !176, file: !177, line: 110, baseType: !210, size: 192, offset: 223456)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 192, elements: !211)
!211 = !{!208}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0", scope: !176, file: !177, line: 111, baseType: !210, size: 192, offset: 223648)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep1", scope: !176, file: !177, line: 112, baseType: !210, size: 192, offset: 223840)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep2", scope: !176, file: !177, line: 113, baseType: !210, size: 192, offset: 224032)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0_long", scope: !176, file: !177, line: 114, baseType: !206, size: 3072, offset: 224224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot", scope: !176, file: !177, line: 115, baseType: !217, size: 4096, offset: 227296)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, elements: !218)
!218 = !{!186, !219}
!219 = !DISubrange(count: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pos_special", scope: !176, file: !177, line: 116, baseType: !221, size: 1824, offset: 231392)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1824, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 114)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pos_align", scope: !176, file: !177, line: 117, baseType: !225, size: 256, offset: 233216)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 256, elements: !226)
!226 = !{!203}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_encoder", scope: !176, file: !177, line: 121, baseType: !228, size: 148032, offset: 233472)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_length_encoder", file: !177, line: 51, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 40, size: 148032, elements: !230)
!230 = !{!231, !232, !233, !237, !238, !242, !246, !247}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "choice", scope: !229, file: !177, line: 41, baseType: !54, size: 16)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !229, file: !177, line: 42, baseType: !54, size: 16, offset: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !229, file: !177, line: 43, baseType: !234, size: 2048, offset: 32)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, elements: !235)
!235 = !{!203, !236}
!236 = !DISubrange(count: 8)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !229, file: !177, line: 44, baseType: !234, size: 2048, offset: 2080)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !229, file: !177, line: 45, baseType: !239, size: 4096, offset: 4128)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prices", scope: !229, file: !177, line: 47, baseType: !243, size: 139264, offset: 8224)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 139264, elements: !244)
!244 = !{!203, !245}
!245 = !DISubrange(count: 272)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !229, file: !177, line: 48, baseType: !37, size: 32, offset: 147488)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !229, file: !177, line: 49, baseType: !248, size: 512, offset: 147520)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, elements: !226)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rep_len_encoder", scope: !176, file: !177, line: 122, baseType: !228, size: 148032, offset: 381504)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot_prices", scope: !176, file: !177, line: 125, baseType: !251, size: 8192, offset: 529536)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8192, elements: !218)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "distances_prices", scope: !176, file: !177, line: 126, baseType: !253, size: 16384, offset: 537728)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 16384, elements: !254)
!254 = !{!186, !255}
!255 = !DISubrange(count: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "dist_table_size", scope: !176, file: !177, line: 127, baseType: !37, size: 32, offset: 554112)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "match_price_count", scope: !176, file: !177, line: 128, baseType: !37, size: 32, offset: 554144)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "align_prices", scope: !176, file: !177, line: 130, baseType: !248, size: 512, offset: 554176)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "align_price_count", scope: !176, file: !177, line: 131, baseType: !37, size: 32, offset: 554688)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "opts_end_index", scope: !176, file: !177, line: 134, baseType: !37, size: 32, offset: 554720)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "opts_current_index", scope: !176, file: !177, line: 135, baseType: !37, size: 32, offset: 554752)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !176, file: !177, line: 136, baseType: !263, size: 1441792, offset: 554784)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 1441792, elements: !276)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_optimal", file: !177, line: 69, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 54, size: 352, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !265, file: !177, line: 55, baseType: !182, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "prev_1_is_literal", scope: !265, file: !177, line: 57, baseType: !194, size: 8, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "prev_2", scope: !265, file: !177, line: 58, baseType: !194, size: 8, offset: 40)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev_2", scope: !265, file: !177, line: 60, baseType: !37, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev_2", scope: !265, file: !177, line: 61, baseType: !37, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !265, file: !177, line: 63, baseType: !37, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev", scope: !265, file: !177, line: 64, baseType: !37, size: 32, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev", scope: !265, file: !177, line: 65, baseType: !37, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "backs", scope: !265, file: !177, line: 67, baseType: !184, size: 128, offset: 224)
!276 = !{!277}
!277 = !DISubrange(count: 4096)
!278 = !DILocalVariable(name: "position", scope: !112, file: !1, line: 328, type: !37)
!279 = !DILocalVariable(name: "len", scope: !280, file: !1, line: 369, type: !37)
!280 = distinct !DILexicalBlock(scope: !112, file: !1, line: 330, column: 15)
!281 = !DILocalVariable(name: "back", scope: !280, file: !1, line: 370, type: !37)
!282 = distinct !DIAssignID()
!283 = !DILocation(line: 0, scope: !280)
!284 = distinct !DIAssignID()
!285 = !DILocation(line: 0, scope: !112)
!286 = !DILocation(line: 324, column: 14, scope: !287)
!287 = distinct !DILexicalBlock(scope: !112, file: !1, line: 324, column: 6)
!288 = !{i8 0, i8 2}
!289 = !{}
!290 = !DILocation(line: 324, column: 29, scope: !287)
!291 = !DILocalVariable(name: "pcoder", arg: 1, scope: !292, file: !1, line: 272, type: !116)
!292 = distinct !DISubprogram(name: "encode_init", scope: !1, file: !1, line: 272, type: !293, scopeLine: 273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{!194, !116, !120}
!295 = !{!291, !296, !297}
!296 = !DILocalVariable(name: "mf", arg: 2, scope: !292, file: !1, line: 272, type: !120)
!297 = !DILocalVariable(name: "coder", scope: !292, file: !1, line: 274, type: !175)
!298 = !DILocation(line: 0, scope: !292, inlinedAt: !299)
!299 = distinct !DILocation(line: 324, column: 33, scope: !287)
!300 = !DILocation(line: 277, column: 10, scope: !301, inlinedAt: !299)
!301 = distinct !DILexicalBlock(scope: !292, file: !1, line: 277, column: 6)
!302 = !DILocation(line: 277, column: 26, scope: !301, inlinedAt: !299)
!303 = !DILocation(line: 277, column: 19, scope: !301, inlinedAt: !299)
!304 = !DILocation(line: 277, column: 6, scope: !292, inlinedAt: !299)
!305 = !DILocation(line: 278, column: 11, scope: !306, inlinedAt: !299)
!306 = distinct !DILexicalBlock(scope: !307, file: !1, line: 278, column: 7)
!307 = distinct !DILexicalBlock(scope: !301, file: !1, line: 277, column: 38)
!308 = !DILocation(line: 278, column: 18, scope: !306, inlinedAt: !299)
!309 = !DILocation(line: 278, column: 7, scope: !307, inlinedAt: !299)
!310 = !DILocalVariable(name: "mf", arg: 1, scope: !311, file: !122, line: 268, type: !120)
!311 = distinct !DISubprogram(name: "mf_skip", scope: !122, file: !122, line: 268, type: !148, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !312)
!312 = !{!310, !313}
!313 = !DILocalVariable(name: "amount", arg: 2, scope: !311, file: !122, line: 268, type: !37)
!314 = !DILocation(line: 0, scope: !311, inlinedAt: !315)
!315 = distinct !DILocation(line: 287, column: 3, scope: !316, inlinedAt: !299)
!316 = distinct !DILexicalBlock(scope: !301, file: !1, line: 284, column: 9)
!317 = !DILocation(line: 271, column: 7, scope: !318, inlinedAt: !315)
!318 = distinct !DILexicalBlock(scope: !319, file: !122, line: 270, column: 19)
!319 = distinct !DILexicalBlock(scope: !311, file: !122, line: 270, column: 6)
!320 = !DILocation(line: 271, column: 3, scope: !318, inlinedAt: !315)
!321 = !DILocation(line: 272, column: 7, scope: !318, inlinedAt: !315)
!322 = !DILocation(line: 288, column: 18, scope: !316, inlinedAt: !299)
!323 = !DILocation(line: 289, column: 30, scope: !316, inlinedAt: !299)
!324 = !DILocalVariable(name: "rc", arg: 1, scope: !325, file: !26, line: 67, type: !328)
!325 = distinct !DISubprogram(name: "rc_bit", scope: !26, file: !26, line: 67, type: !326, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !329)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328, !53, !37}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!329 = !{!324, !330, !331}
!330 = !DILocalVariable(name: "prob", arg: 2, scope: !325, file: !26, line: 67, type: !53)
!331 = !DILocalVariable(name: "bit", arg: 3, scope: !325, file: !26, line: 67, type: !37)
!332 = !DILocation(line: 0, scope: !325, inlinedAt: !333)
!333 = distinct !DILocation(line: 289, column: 3, scope: !316, inlinedAt: !299)
!334 = !DILocation(line: 69, column: 6, scope: !325, inlinedAt: !333)
!335 = !DILocation(line: 69, column: 18, scope: !325, inlinedAt: !333)
!336 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !333)
!337 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !333)
!338 = !DILocation(line: 70, column: 6, scope: !325, inlinedAt: !333)
!339 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !333)
!340 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !333)
!341 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !333)
!342 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !333)
!343 = !DILocation(line: 290, column: 33, scope: !316, inlinedAt: !299)
!344 = !DILocation(line: 290, column: 52, scope: !316, inlinedAt: !299)
!345 = !DILocation(line: 290, column: 48, scope: !316, inlinedAt: !299)
!346 = !DILocalVariable(name: "rc", arg: 1, scope: !347, file: !26, line: 76, type: !328)
!347 = distinct !DISubprogram(name: "rc_bittree", scope: !26, file: !26, line: 76, type: !348, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !328, !53, !37, !37}
!350 = !{!346, !351, !352, !353, !354, !355}
!351 = !DILocalVariable(name: "probs", arg: 2, scope: !347, file: !26, line: 76, type: !53)
!352 = !DILocalVariable(name: "bit_count", arg: 3, scope: !347, file: !26, line: 77, type: !37)
!353 = !DILocalVariable(name: "symbol", arg: 4, scope: !347, file: !26, line: 77, type: !37)
!354 = !DILocalVariable(name: "model_index", scope: !347, file: !26, line: 79, type: !37)
!355 = !DILocalVariable(name: "bit", scope: !356, file: !26, line: 82, type: !357)
!356 = distinct !DILexicalBlock(scope: !347, file: !26, line: 81, column: 5)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!358 = !DILocation(line: 0, scope: !347, inlinedAt: !359)
!359 = distinct !DILocation(line: 290, column: 3, scope: !316, inlinedAt: !299)
!360 = !DILocation(line: 82, column: 32, scope: !356, inlinedAt: !359)
!361 = !DILocation(line: 0, scope: !356, inlinedAt: !359)
!362 = !DILocation(line: 83, column: 15, scope: !356, inlinedAt: !359)
!363 = !DILocation(line: 0, scope: !325, inlinedAt: !364)
!364 = distinct !DILocation(line: 83, column: 3, scope: !356, inlinedAt: !359)
!365 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !364)
!366 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !364)
!367 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !364)
!368 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !364)
!369 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !364)
!370 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !364)
!371 = !DILocation(line: 84, column: 36, scope: !356, inlinedAt: !359)
!372 = !DILocation(line: 82, column: 48, scope: !356, inlinedAt: !359)
!373 = !DILocation(line: 84, column: 30, scope: !356, inlinedAt: !359)
!374 = !DILocation(line: 294, column: 9, scope: !292, inlinedAt: !299)
!375 = !DILocation(line: 294, column: 24, scope: !292, inlinedAt: !299)
!376 = !DILocation(line: 324, column: 6, scope: !112)
!377 = !DILocation(line: 328, column: 22, scope: !112)
!378 = !DILocalVariable(name: "mf", arg: 1, scope: !379, file: !122, line: 253, type: !382)
!379 = distinct !DISubprogram(name: "mf_position", scope: !122, file: !122, line: 253, type: !380, scopeLine: 254, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !384)
!380 = !DISubroutineType(types: !381)
!381 = !{!37, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!384 = !{!378}
!385 = !DILocation(line: 0, scope: !379, inlinedAt: !386)
!386 = distinct !DILocation(line: 328, column: 22, scope: !112)
!387 = !DILocation(line: 337, column: 7, scope: !388)
!388 = distinct !DILexicalBlock(scope: !280, file: !1, line: 337, column: 7)
!389 = !DILocation(line: 337, column: 7, scope: !280)
!390 = !DILocation(line: 255, column: 22, scope: !379, inlinedAt: !386)
!391 = !DILocation(line: 353, column: 11, scope: !392)
!392 = distinct !DILexicalBlock(scope: !280, file: !1, line: 353, column: 7)
!393 = !DILocation(line: 346, column: 5, scope: !394)
!394 = distinct !DILexicalBlock(scope: !280, file: !1, line: 345, column: 7)
!395 = !DILocation(line: 346, column: 28, scope: !394)
!396 = !DILocation(line: 346, column: 22, scope: !394)
!397 = !DILocation(line: 346, column: 39, scope: !394)
!398 = !DILocation(line: 347, column: 6, scope: !394)
!399 = !DILocation(line: 347, column: 9, scope: !394)
!400 = !DILocation(line: 347, column: 20, scope: !394)
!401 = !DILocalVariable(name: "rc", arg: 1, scope: !402, file: !26, line: 226, type: !405)
!402 = distinct !DISubprogram(name: "rc_pending", scope: !26, file: !26, line: 226, type: !403, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !407)
!403 = !DISubroutineType(types: !404)
!404 = !{!30, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!407 = !{!401}
!408 = !DILocation(line: 0, scope: !402, inlinedAt: !409)
!409 = distinct !DILocation(line: 347, column: 20, scope: !394)
!410 = !DILocation(line: 228, column: 28, scope: !402, inlinedAt: !409)
!411 = !DILocation(line: 347, column: 18, scope: !394)
!412 = !DILocation(line: 348, column: 7, scope: !394)
!413 = !DILocation(line: 345, column: 7, scope: !280)
!414 = !DILocation(line: 353, column: 27, scope: !392)
!415 = !DILocation(line: 353, column: 20, scope: !392)
!416 = !DILocation(line: 353, column: 7, scope: !280)
!417 = !DILocation(line: 354, column: 12, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !1, line: 354, column: 8)
!419 = distinct !DILexicalBlock(scope: !392, file: !1, line: 353, column: 39)
!420 = !DILocation(line: 354, column: 19, scope: !418)
!421 = !DILocation(line: 354, column: 8, scope: !419)
!422 = !DILocation(line: 357, column: 12, scope: !423)
!423 = distinct !DILexicalBlock(scope: !419, file: !1, line: 357, column: 8)
!424 = !DILocation(line: 357, column: 23, scope: !423)
!425 = !DILocation(line: 357, column: 8, scope: !419)
!426 = !DILocation(line: 369, column: 3, scope: !280)
!427 = !DILocation(line: 370, column: 3, scope: !280)
!428 = !DILocation(line: 372, column: 14, scope: !429)
!429 = distinct !DILexicalBlock(scope: !280, file: !1, line: 372, column: 7)
!430 = !DILocation(line: 372, column: 7, scope: !280)
!431 = !DILocation(line: 373, column: 4, scope: !429)
!432 = !DILocation(line: 375, column: 4, scope: !429)
!433 = !DILocation(line: 378, column: 28, scope: !280)
!434 = !DILocation(line: 378, column: 34, scope: !280)
!435 = !DILocalVariable(name: "pcoder", arg: 1, scope: !436, file: !1, line: 237, type: !116)
!436 = distinct !DISubprogram(name: "encode_symbol", scope: !1, file: !1, line: 237, type: !437, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !116, !120, !37, !37, !37}
!439 = !{!435, !440, !441, !442, !443, !444, !445}
!440 = !DILocalVariable(name: "mf", arg: 2, scope: !436, file: !1, line: 237, type: !120)
!441 = !DILocalVariable(name: "back", arg: 3, scope: !436, file: !1, line: 238, type: !37)
!442 = !DILocalVariable(name: "len", arg: 4, scope: !436, file: !1, line: 238, type: !37)
!443 = !DILocalVariable(name: "position", arg: 5, scope: !436, file: !1, line: 238, type: !37)
!444 = !DILocalVariable(name: "coder", scope: !436, file: !1, line: 240, type: !175)
!445 = !DILocalVariable(name: "pos_state", scope: !436, file: !1, line: 241, type: !357)
!446 = !DILocation(line: 0, scope: !436, inlinedAt: !447)
!447 = distinct !DILocation(line: 378, column: 3, scope: !280)
!448 = !DILocation(line: 241, column: 47, scope: !436, inlinedAt: !447)
!449 = !DILocation(line: 241, column: 38, scope: !436, inlinedAt: !447)
!450 = !DILocation(line: 243, column: 11, scope: !451, inlinedAt: !447)
!451 = distinct !DILexicalBlock(scope: !436, file: !1, line: 243, column: 6)
!452 = !DILocation(line: 0, scope: !451, inlinedAt: !447)
!453 = !DILocation(line: 0, scope: !325, inlinedAt: !454)
!454 = distinct !DILocation(line: 246, column: 3, scope: !455, inlinedAt: !447)
!455 = distinct !DILexicalBlock(scope: !451, file: !1, line: 243, column: 26)
!456 = !DILocation(line: 0, scope: !325, inlinedAt: !457)
!457 = distinct !DILocation(line: 251, column: 3, scope: !458, inlinedAt: !447)
!458 = distinct !DILexicalBlock(scope: !451, file: !1, line: 249, column: 9)
!459 = !DILocation(line: 69, column: 18, scope: !325, inlinedAt: !460)
!460 = distinct !DILocation(line: 0, scope: !451, inlinedAt: !447)
!461 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !460)
!462 = !DILocation(line: 243, column: 6, scope: !436, inlinedAt: !447)
!463 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !454)
!464 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !454)
!465 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !454)
!466 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !454)
!467 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !454)
!468 = !DILocalVariable(name: "pcoder", arg: 1, scope: !469, file: !1, line: 46, type: !116)
!469 = distinct !DISubprogram(name: "literal", scope: !1, file: !1, line: 46, type: !470, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !472)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !116, !120, !37}
!472 = !{!468, !473, !474, !475, !476, !478, !479}
!473 = !DILocalVariable(name: "mf", arg: 2, scope: !469, file: !1, line: 46, type: !120)
!474 = !DILocalVariable(name: "position", arg: 3, scope: !469, file: !1, line: 46, type: !37)
!475 = !DILocalVariable(name: "coder", scope: !469, file: !1, line: 48, type: !175)
!476 = !DILocalVariable(name: "cur_byte", scope: !469, file: !1, line: 50, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!478 = !DILocalVariable(name: "subcoder", scope: !469, file: !1, line: 52, type: !53)
!479 = !DILocalVariable(name: "match_byte", scope: !480, file: !1, line: 64, type: !477)
!480 = distinct !DILexicalBlock(scope: !481, file: !1, line: 60, column: 9)
!481 = distinct !DILexicalBlock(scope: !469, file: !1, line: 56, column: 6)
!482 = !DILocation(line: 0, scope: !469, inlinedAt: !483)
!483 = distinct !DILocation(line: 248, column: 3, scope: !455, inlinedAt: !447)
!484 = !DILocation(line: 50, column: 31, scope: !469, inlinedAt: !483)
!485 = !DILocation(line: 51, column: 8, scope: !469, inlinedAt: !483)
!486 = !DILocation(line: 51, column: 23, scope: !469, inlinedAt: !483)
!487 = !DILocation(line: 51, column: 17, scope: !469, inlinedAt: !483)
!488 = !DILocation(line: 50, column: 27, scope: !469, inlinedAt: !483)
!489 = !DILocation(line: 52, column: 26, scope: !469, inlinedAt: !483)
!490 = !DILocation(line: 56, column: 6, scope: !481, inlinedAt: !483)
!491 = !DILocation(line: 56, column: 6, scope: !469, inlinedAt: !483)
!492 = !DILocation(line: 59, column: 39, scope: !493, inlinedAt: !483)
!493 = distinct !DILexicalBlock(scope: !481, file: !1, line: 56, column: 38)
!494 = !DILocation(line: 0, scope: !347, inlinedAt: !495)
!495 = distinct !DILocation(line: 59, column: 3, scope: !493, inlinedAt: !483)
!496 = !DILocation(line: 82, column: 32, scope: !356, inlinedAt: !495)
!497 = !DILocation(line: 0, scope: !356, inlinedAt: !495)
!498 = !DILocation(line: 83, column: 15, scope: !356, inlinedAt: !495)
!499 = !DILocation(line: 0, scope: !325, inlinedAt: !500)
!500 = distinct !DILocation(line: 83, column: 3, scope: !356, inlinedAt: !495)
!501 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !500)
!502 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !500)
!503 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !500)
!504 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !500)
!505 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !500)
!506 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !500)
!507 = !DILocation(line: 84, column: 36, scope: !356, inlinedAt: !495)
!508 = !DILocation(line: 82, column: 48, scope: !356, inlinedAt: !495)
!509 = !DILocation(line: 84, column: 30, scope: !356, inlinedAt: !495)
!510 = !DILocation(line: 70, column: 2, scope: !469, inlinedAt: !483)
!511 = !DILocation(line: 65, column: 20, scope: !480, inlinedAt: !483)
!512 = !DILocation(line: 65, column: 35, scope: !480, inlinedAt: !483)
!513 = !DILocation(line: 66, column: 5, scope: !480, inlinedAt: !483)
!514 = !DILocation(line: 64, column: 30, scope: !480, inlinedAt: !483)
!515 = !DILocation(line: 0, scope: !480, inlinedAt: !483)
!516 = !DILocation(line: 67, column: 41, scope: !480, inlinedAt: !483)
!517 = !DILocation(line: 67, column: 53, scope: !480, inlinedAt: !483)
!518 = !DILocalVariable(name: "rc", arg: 1, scope: !519, file: !1, line: 24, type: !328)
!519 = distinct !DISubprogram(name: "literal_matched", scope: !1, file: !1, line: 24, type: !348, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !520)
!520 = !{!518, !521, !522, !523, !524, !525, !527, !528}
!521 = !DILocalVariable(name: "subcoder", arg: 2, scope: !519, file: !1, line: 24, type: !53)
!522 = !DILocalVariable(name: "match_byte", arg: 3, scope: !519, file: !1, line: 25, type: !37)
!523 = !DILocalVariable(name: "symbol", arg: 4, scope: !519, file: !1, line: 25, type: !37)
!524 = !DILocalVariable(name: "offset", scope: !519, file: !1, line: 27, type: !37)
!525 = !DILocalVariable(name: "match_bit", scope: !526, file: !1, line: 32, type: !357)
!526 = distinct !DILexicalBlock(scope: !519, file: !1, line: 30, column: 5)
!527 = !DILocalVariable(name: "subcoder_index", scope: !526, file: !1, line: 33, type: !357)
!528 = !DILocalVariable(name: "bit", scope: !526, file: !1, line: 35, type: !357)
!529 = !DILocation(line: 0, scope: !519, inlinedAt: !530)
!530 = distinct !DILocation(line: 67, column: 3, scope: !480, inlinedAt: !483)
!531 = !DILocation(line: 28, column: 9, scope: !519, inlinedAt: !530)
!532 = !DILocation(line: 30, column: 2, scope: !519, inlinedAt: !530)
!533 = !DILocation(line: 69, column: 18, scope: !325, inlinedAt: !534)
!534 = distinct !DILocation(line: 36, column: 3, scope: !526, inlinedAt: !530)
!535 = !DILocation(line: 31, column: 14, scope: !526, inlinedAt: !530)
!536 = !DILocation(line: 32, column: 41, scope: !526, inlinedAt: !530)
!537 = !DILocation(line: 0, scope: !526, inlinedAt: !530)
!538 = !DILocation(line: 34, column: 36, scope: !526, inlinedAt: !530)
!539 = !DILocation(line: 34, column: 14, scope: !526, inlinedAt: !530)
!540 = !DILocation(line: 34, column: 26, scope: !526, inlinedAt: !530)
!541 = !DILocation(line: 35, column: 32, scope: !526, inlinedAt: !530)
!542 = !DILocation(line: 35, column: 38, scope: !526, inlinedAt: !530)
!543 = !DILocation(line: 36, column: 15, scope: !526, inlinedAt: !530)
!544 = !DILocation(line: 0, scope: !325, inlinedAt: !534)
!545 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !534)
!546 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !534)
!547 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !534)
!548 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !534)
!549 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !534)
!550 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !534)
!551 = !DILocation(line: 38, column: 10, scope: !526, inlinedAt: !530)
!552 = !DILocation(line: 39, column: 13, scope: !526, inlinedAt: !530)
!553 = !DILocation(line: 39, column: 10, scope: !526, inlinedAt: !530)
!554 = !DILocation(line: 41, column: 18, scope: !519, inlinedAt: !530)
!555 = !DILocation(line: 41, column: 2, scope: !526, inlinedAt: !530)
!556 = distinct !{!556, !532, !557}
!557 = !DILocation(line: 41, column: 39, scope: !519, inlinedAt: !530)
!558 = !DILocation(line: 380, column: 15, scope: !280)
!559 = !DILocation(line: 249, column: 2, scope: !455, inlinedAt: !447)
!560 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !457)
!561 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !457)
!562 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !457)
!563 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !457)
!564 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !457)
!565 = !DILocation(line: 254, column: 12, scope: !566, inlinedAt: !447)
!566 = distinct !DILexicalBlock(scope: !458, file: !1, line: 254, column: 7)
!567 = !DILocation(line: 0, scope: !566, inlinedAt: !447)
!568 = !DILocation(line: 0, scope: !325, inlinedAt: !569)
!569 = distinct !DILocation(line: 257, column: 4, scope: !570, inlinedAt: !447)
!570 = distinct !DILexicalBlock(scope: !566, file: !1, line: 254, column: 29)
!571 = !DILocation(line: 0, scope: !325, inlinedAt: !572)
!572 = distinct !DILocation(line: 261, column: 4, scope: !573, inlinedAt: !447)
!573 = distinct !DILexicalBlock(scope: !566, file: !1, line: 259, column: 10)
!574 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !575)
!575 = distinct !DILocation(line: 0, scope: !566, inlinedAt: !447)
!576 = !DILocation(line: 254, column: 7, scope: !458, inlinedAt: !447)
!577 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !569)
!578 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !569)
!579 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !569)
!580 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !569)
!581 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !569)
!582 = !DILocalVariable(name: "pcoder", arg: 1, scope: !583, file: !1, line: 192, type: !116)
!583 = distinct !DISubprogram(name: "rep_match", scope: !1, file: !1, line: 192, type: !584, scopeLine: 194, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !116, !357, !357, !357}
!586 = !{!582, !587, !588, !589, !590, !591}
!587 = !DILocalVariable(name: "pos_state", arg: 2, scope: !583, file: !1, line: 192, type: !357)
!588 = !DILocalVariable(name: "rep", arg: 3, scope: !583, file: !1, line: 193, type: !357)
!589 = !DILocalVariable(name: "len", arg: 4, scope: !583, file: !1, line: 193, type: !357)
!590 = !DILocalVariable(name: "coder", scope: !583, file: !1, line: 195, type: !175)
!591 = !DILocalVariable(name: "distance", scope: !592, file: !1, line: 202, type: !357)
!592 = distinct !DILexicalBlock(scope: !593, file: !1, line: 201, column: 9)
!593 = distinct !DILexicalBlock(scope: !583, file: !1, line: 196, column: 6)
!594 = !DILocation(line: 0, scope: !583, inlinedAt: !595)
!595 = distinct !DILocation(line: 258, column: 4, scope: !570, inlinedAt: !447)
!596 = !DILocation(line: 196, column: 10, scope: !593, inlinedAt: !595)
!597 = !DILocation(line: 196, column: 6, scope: !583, inlinedAt: !595)
!598 = !DILocation(line: 197, column: 45, scope: !599, inlinedAt: !595)
!599 = distinct !DILexicalBlock(scope: !593, file: !1, line: 196, column: 16)
!600 = !DILocation(line: 197, column: 23, scope: !599, inlinedAt: !595)
!601 = !DILocation(line: 0, scope: !325, inlinedAt: !602)
!602 = distinct !DILocation(line: 197, column: 3, scope: !599, inlinedAt: !595)
!603 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !602)
!604 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !602)
!605 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !602)
!606 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !602)
!607 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !602)
!608 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !602)
!609 = !DILocation(line: 199, column: 33, scope: !599, inlinedAt: !595)
!610 = !DILocation(line: 199, column: 6, scope: !599, inlinedAt: !595)
!611 = !DILocation(line: 200, column: 9, scope: !599, inlinedAt: !595)
!612 = !DILocation(line: 0, scope: !325, inlinedAt: !613)
!613 = distinct !DILocation(line: 198, column: 3, scope: !599, inlinedAt: !595)
!614 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !613)
!615 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !613)
!616 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !613)
!617 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !613)
!618 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !613)
!619 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !613)
!620 = !DILocation(line: 201, column: 2, scope: !599, inlinedAt: !595)
!621 = !DILocation(line: 202, column: 29, scope: !592, inlinedAt: !595)
!622 = !DILocation(line: 0, scope: !592, inlinedAt: !595)
!623 = !DILocation(line: 203, column: 45, scope: !592, inlinedAt: !595)
!624 = !DILocation(line: 203, column: 23, scope: !592, inlinedAt: !595)
!625 = !DILocation(line: 0, scope: !325, inlinedAt: !626)
!626 = distinct !DILocation(line: 203, column: 3, scope: !592, inlinedAt: !595)
!627 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !626)
!628 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !626)
!629 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !626)
!630 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !626)
!631 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !626)
!632 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !626)
!633 = !DILocation(line: 205, column: 11, scope: !634, inlinedAt: !595)
!634 = distinct !DILexicalBlock(scope: !592, file: !1, line: 205, column: 7)
!635 = !DILocation(line: 0, scope: !634, inlinedAt: !595)
!636 = !DILocation(line: 0, scope: !325, inlinedAt: !637)
!637 = distinct !DILocation(line: 206, column: 4, scope: !638, inlinedAt: !595)
!638 = distinct !DILexicalBlock(scope: !634, file: !1, line: 205, column: 17)
!639 = !DILocation(line: 0, scope: !325, inlinedAt: !640)
!640 = distinct !DILocation(line: 208, column: 4, scope: !641, inlinedAt: !595)
!641 = distinct !DILexicalBlock(scope: !634, file: !1, line: 207, column: 10)
!642 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !643)
!643 = distinct !DILocation(line: 0, scope: !634, inlinedAt: !595)
!644 = !DILocation(line: 205, column: 7, scope: !592, inlinedAt: !595)
!645 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !637)
!646 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !637)
!647 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !637)
!648 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !637)
!649 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !637)
!650 = !DILocation(line: 207, column: 3, scope: !638, inlinedAt: !595)
!651 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !640)
!652 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !640)
!653 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !640)
!654 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !640)
!655 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !640)
!656 = !DILocation(line: 209, column: 46, scope: !641, inlinedAt: !595)
!657 = !DILocation(line: 209, column: 24, scope: !641, inlinedAt: !595)
!658 = !DILocation(line: 210, column: 10, scope: !641, inlinedAt: !595)
!659 = !DILocation(line: 0, scope: !325, inlinedAt: !660)
!660 = distinct !DILocation(line: 209, column: 4, scope: !641, inlinedAt: !595)
!661 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !660)
!662 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !660)
!663 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !660)
!664 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !660)
!665 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !660)
!666 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !660)
!667 = !DILocation(line: 212, column: 12, scope: !668, inlinedAt: !595)
!668 = distinct !DILexicalBlock(scope: !641, file: !1, line: 212, column: 8)
!669 = !DILocation(line: 212, column: 8, scope: !641, inlinedAt: !595)
!670 = !DILocation(line: 213, column: 22, scope: !668, inlinedAt: !595)
!671 = !DILocation(line: 213, column: 20, scope: !668, inlinedAt: !595)
!672 = !DILocation(line: 213, column: 5, scope: !668, inlinedAt: !595)
!673 = !DILocation(line: 215, column: 21, scope: !641, inlinedAt: !595)
!674 = !DILocation(line: 215, column: 19, scope: !641, inlinedAt: !595)
!675 = !DILocation(line: 218, column: 20, scope: !592, inlinedAt: !595)
!676 = !DILocation(line: 218, column: 18, scope: !592, inlinedAt: !595)
!677 = !DILocation(line: 219, column: 18, scope: !592, inlinedAt: !595)
!678 = !DILocation(line: 222, column: 10, scope: !679, inlinedAt: !595)
!679 = distinct !DILexicalBlock(scope: !583, file: !1, line: 222, column: 6)
!680 = !DILocation(line: 222, column: 6, scope: !583, inlinedAt: !595)
!681 = !DILocation(line: 226, column: 12, scope: !682, inlinedAt: !595)
!682 = distinct !DILexicalBlock(scope: !679, file: !1, line: 224, column: 9)
!683 = !DILocation(line: 225, column: 3, scope: !682, inlinedAt: !595)
!684 = !DILocation(line: 0, scope: !679, inlinedAt: !595)
!685 = !DILocation(line: 259, column: 3, scope: !570, inlinedAt: !447)
!686 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !572)
!687 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !572)
!688 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !572)
!689 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !572)
!690 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !572)
!691 = !DILocation(line: 262, column: 33, scope: !573, inlinedAt: !447)
!692 = !DILocation(line: 262, column: 4, scope: !573, inlinedAt: !447)
!693 = !DILocation(line: 267, column: 17, scope: !436, inlinedAt: !447)
!694 = !DILocation(line: 380, column: 12, scope: !280)
!695 = !DILocation(line: 381, column: 2, scope: !112)
!696 = distinct !{!696, !697, !695}
!697 = !DILocation(line: 330, column: 2, scope: !112)
!698 = !DILocation(line: 383, column: 14, scope: !699)
!699 = distinct !DILexicalBlock(scope: !112, file: !1, line: 383, column: 6)
!700 = !DILocation(line: 383, column: 6, scope: !112)
!701 = !DILocation(line: 384, column: 21, scope: !702)
!702 = distinct !DILexicalBlock(scope: !699, file: !1, line: 383, column: 26)
!703 = !DILocation(line: 388, column: 7, scope: !702)
!704 = !DILocalVariable(name: "pcoder", arg: 1, scope: !705, file: !1, line: 301, type: !116)
!705 = distinct !DISubprogram(name: "encode_eopm", scope: !1, file: !1, line: 301, type: !706, scopeLine: 302, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !708)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !116, !37}
!708 = !{!704, !709, !710, !711}
!709 = !DILocalVariable(name: "position", arg: 2, scope: !705, file: !1, line: 301, type: !37)
!710 = !DILocalVariable(name: "coder", scope: !705, file: !1, line: 303, type: !175)
!711 = !DILocalVariable(name: "pos_state", scope: !705, file: !1, line: 304, type: !357)
!712 = !DILocation(line: 0, scope: !705, inlinedAt: !713)
!713 = distinct !DILocation(line: 389, column: 4, scope: !714)
!714 = distinct !DILexicalBlock(scope: !702, file: !1, line: 388, column: 7)
!715 = !DILocation(line: 304, column: 47, scope: !705, inlinedAt: !713)
!716 = !DILocation(line: 304, column: 38, scope: !705, inlinedAt: !713)
!717 = !DILocation(line: 305, column: 45, scope: !705, inlinedAt: !713)
!718 = !DILocation(line: 305, column: 22, scope: !705, inlinedAt: !713)
!719 = !DILocation(line: 0, scope: !325, inlinedAt: !720)
!720 = distinct !DILocation(line: 305, column: 2, scope: !705, inlinedAt: !713)
!721 = !DILocation(line: 69, column: 18, scope: !325, inlinedAt: !720)
!722 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !720)
!723 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !720)
!724 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !720)
!725 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !720)
!726 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !720)
!727 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !720)
!728 = !DILocation(line: 306, column: 43, scope: !705, inlinedAt: !713)
!729 = !DILocation(line: 306, column: 22, scope: !705, inlinedAt: !713)
!730 = !DILocation(line: 0, scope: !325, inlinedAt: !731)
!731 = distinct !DILocation(line: 306, column: 2, scope: !705, inlinedAt: !713)
!732 = !DILocation(line: 69, column: 2, scope: !325, inlinedAt: !731)
!733 = !DILocation(line: 69, column: 25, scope: !325, inlinedAt: !731)
!734 = !DILocation(line: 70, column: 16, scope: !325, inlinedAt: !731)
!735 = !DILocation(line: 70, column: 2, scope: !325, inlinedAt: !731)
!736 = !DILocation(line: 70, column: 23, scope: !325, inlinedAt: !731)
!737 = !DILocation(line: 71, column: 2, scope: !325, inlinedAt: !731)
!738 = !DILocation(line: 307, column: 2, scope: !705, inlinedAt: !713)
!739 = !DILocation(line: 389, column: 4, scope: !714)
!740 = !DILocalVariable(name: "rc", arg: 1, scope: !741, file: !26, line: 116, type: !328)
!741 = distinct !DISubprogram(name: "rc_flush", scope: !26, file: !26, line: 116, type: !742, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !328}
!744 = !{!740, !745}
!745 = !DILocalVariable(name: "i", scope: !746, file: !26, line: 118, type: !44)
!746 = distinct !DILexicalBlock(scope: !741, file: !26, line: 118, column: 2)
!747 = !DILocation(line: 0, scope: !741, inlinedAt: !748)
!748 = distinct !DILocation(line: 392, column: 3, scope: !702)
!749 = !DILocation(line: 0, scope: !746, inlinedAt: !748)
!750 = !DILocation(line: 119, column: 24, scope: !751, inlinedAt: !748)
!751 = distinct !DILexicalBlock(scope: !746, file: !26, line: 118, column: 2)
!752 = !DILocation(line: 119, column: 3, scope: !751, inlinedAt: !748)
!753 = !DILocation(line: 119, column: 28, scope: !751, inlinedAt: !748)
!754 = !DILocation(line: 398, column: 7, scope: !755)
!755 = distinct !DILexicalBlock(scope: !702, file: !1, line: 398, column: 7)
!756 = !DILocation(line: 398, column: 7, scope: !702)
!757 = !DILocation(line: 405, column: 20, scope: !112)
!758 = !DILocation(line: 407, column: 2, scope: !112)
!759 = !DILocation(line: 408, column: 1, scope: !112)
!760 = distinct !DISubprogram(name: "rc_encode", scope: !26, file: !26, line: 150, type: !761, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{!194, !328, !126, !165, !44}
!763 = !{!764, !765, !766, !767, !768, !772, !774}
!764 = !DILocalVariable(name: "rc", arg: 1, scope: !760, file: !26, line: 150, type: !328)
!765 = !DILocalVariable(name: "out", arg: 2, scope: !760, file: !26, line: 151, type: !126)
!766 = !DILocalVariable(name: "out_pos", arg: 3, scope: !760, file: !26, line: 151, type: !165)
!767 = !DILocalVariable(name: "out_size", arg: 4, scope: !760, file: !26, line: 151, type: !44)
!768 = !DILocalVariable(name: "prob", scope: !769, file: !26, line: 167, type: !54)
!769 = distinct !DILexicalBlock(scope: !770, file: !26, line: 166, column: 18)
!770 = distinct !DILexicalBlock(scope: !771, file: !26, line: 165, column: 33)
!771 = distinct !DILexicalBlock(scope: !760, file: !26, line: 155, column: 30)
!772 = !DILocalVariable(name: "prob", scope: !773, file: !26, line: 176, type: !54)
!773 = distinct !DILexicalBlock(scope: !770, file: !26, line: 175, column: 18)
!774 = !DILocalVariable(name: "bound", scope: !773, file: !26, line: 177, type: !357)
!775 = !DILocation(line: 0, scope: !760)
!776 = !DILocation(line: 155, column: 13, scope: !760)
!777 = !DILocation(line: 155, column: 23, scope: !760)
!778 = !DILocation(line: 155, column: 17, scope: !760)
!779 = !DILocation(line: 155, column: 2, scope: !760)
!780 = !DILocation(line: 157, column: 11, scope: !781)
!781 = distinct !DILexicalBlock(scope: !771, file: !26, line: 157, column: 7)
!782 = !DILocation(line: 157, column: 17, scope: !781)
!783 = !DILocation(line: 157, column: 7, scope: !771)
!784 = !DILocalVariable(name: "rc", arg: 1, scope: !785, file: !26, line: 124, type: !328)
!785 = distinct !DISubprogram(name: "rc_shift_low", scope: !26, file: !26, line: 124, type: !761, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !786)
!786 = !{!784, !787, !788, !789}
!787 = !DILocalVariable(name: "out", arg: 2, scope: !785, file: !26, line: 125, type: !126)
!788 = !DILocalVariable(name: "out_pos", arg: 3, scope: !785, file: !26, line: 125, type: !165)
!789 = !DILocalVariable(name: "out_size", arg: 4, scope: !785, file: !26, line: 125, type: !44)
!790 = !DILocation(line: 0, scope: !785, inlinedAt: !791)
!791 = distinct !DILocation(line: 158, column: 8, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !26, line: 158, column: 8)
!793 = distinct !DILexicalBlock(scope: !781, file: !26, line: 157, column: 33)
!794 = !DILocation(line: 127, column: 21, scope: !795, inlinedAt: !791)
!795 = distinct !DILexicalBlock(scope: !785, file: !26, line: 127, column: 6)
!796 = !DILocation(line: 128, column: 4, scope: !795, inlinedAt: !791)
!797 = !DILocation(line: 142, column: 2, scope: !785, inlinedAt: !791)
!798 = !DILocation(line: 130, column: 8, scope: !799, inlinedAt: !791)
!799 = distinct !DILexicalBlock(scope: !800, file: !26, line: 130, column: 8)
!800 = distinct !DILexicalBlock(scope: !801, file: !26, line: 129, column: 6)
!801 = distinct !DILexicalBlock(scope: !795, file: !26, line: 128, column: 39)
!802 = !DILocation(line: 130, column: 17, scope: !799, inlinedAt: !791)
!803 = !DILocation(line: 130, column: 8, scope: !800, inlinedAt: !791)
!804 = !DILocation(line: 133, column: 24, scope: !800, inlinedAt: !791)
!805 = !DILocation(line: 133, column: 46, scope: !800, inlinedAt: !791)
!806 = !DILocation(line: 133, column: 50, scope: !800, inlinedAt: !791)
!807 = !DILocation(line: 133, column: 32, scope: !800, inlinedAt: !791)
!808 = !DILocation(line: 133, column: 30, scope: !800, inlinedAt: !791)
!809 = !DILocation(line: 133, column: 4, scope: !800, inlinedAt: !791)
!810 = !DILocation(line: 133, column: 18, scope: !800, inlinedAt: !791)
!811 = !DILocation(line: 134, column: 4, scope: !800, inlinedAt: !791)
!812 = !DILocation(line: 135, column: 14, scope: !800, inlinedAt: !791)
!813 = !DILocation(line: 137, column: 12, scope: !801, inlinedAt: !791)
!814 = !DILocation(line: 137, column: 29, scope: !801, inlinedAt: !791)
!815 = !DILocation(line: 137, column: 3, scope: !800, inlinedAt: !791)
!816 = distinct !{!816, !817, !818}
!817 = !DILocation(line: 129, column: 3, scope: !801, inlinedAt: !791)
!818 = !DILocation(line: 137, column: 33, scope: !801, inlinedAt: !791)
!819 = !DILocation(line: 139, column: 20, scope: !801, inlinedAt: !791)
!820 = !DILocation(line: 139, column: 24, scope: !801, inlinedAt: !791)
!821 = !DILocation(line: 139, column: 15, scope: !801, inlinedAt: !791)
!822 = !DILocation(line: 139, column: 13, scope: !801, inlinedAt: !791)
!823 = !DILocation(line: 161, column: 14, scope: !793)
!824 = !DILocation(line: 165, column: 27, scope: !771)
!825 = !DILocation(line: 140, column: 2, scope: !801, inlinedAt: !791)
!826 = !DILocation(line: 143, column: 17, scope: !785, inlinedAt: !791)
!827 = !DILocation(line: 143, column: 35, scope: !785, inlinedAt: !791)
!828 = !DILocation(line: 143, column: 10, scope: !785, inlinedAt: !791)
!829 = !DILocation(line: 162, column: 3, scope: !793)
!830 = !DILocation(line: 165, column: 11, scope: !771)
!831 = !DILocation(line: 165, column: 3, scope: !771)
!832 = !DILocation(line: 167, column: 24, scope: !769)
!833 = !DILocation(line: 167, column: 23, scope: !769)
!834 = !DILocation(line: 0, scope: !769)
!835 = !DILocation(line: 168, column: 27, scope: !769)
!836 = !DILocation(line: 169, column: 8, scope: !769)
!837 = !DILocation(line: 169, column: 6, scope: !769)
!838 = !DILocation(line: 168, column: 14, scope: !769)
!839 = !DILocation(line: 170, column: 32, scope: !769)
!840 = !DILocation(line: 170, column: 40, scope: !769)
!841 = !DILocation(line: 170, column: 9, scope: !769)
!842 = !DILocation(line: 171, column: 5, scope: !769)
!843 = !DILocation(line: 171, column: 24, scope: !769)
!844 = !DILocation(line: 176, column: 24, scope: !773)
!845 = !DILocation(line: 176, column: 23, scope: !773)
!846 = !DILocation(line: 0, scope: !773)
!847 = !DILocation(line: 177, column: 27, scope: !773)
!848 = !DILocation(line: 178, column: 6, scope: !773)
!849 = !DILocation(line: 177, column: 32, scope: !773)
!850 = !DILocation(line: 179, column: 15, scope: !773)
!851 = !DILocation(line: 179, column: 12, scope: !773)
!852 = !DILocation(line: 180, column: 14, scope: !773)
!853 = !DILocation(line: 181, column: 17, scope: !773)
!854 = !DILocation(line: 181, column: 9, scope: !773)
!855 = !DILocation(line: 182, column: 5, scope: !773)
!856 = !DILocation(line: 182, column: 24, scope: !773)
!857 = !DILocation(line: 187, column: 14, scope: !770)
!858 = !DILocation(line: 188, column: 4, scope: !770)
!859 = !DILocation(line: 191, column: 14, scope: !770)
!860 = !DILocation(line: 192, column: 15, scope: !770)
!861 = !DILocation(line: 192, column: 12, scope: !770)
!862 = !DILocation(line: 193, column: 4, scope: !770)
!863 = !DILocation(line: 197, column: 14, scope: !770)
!864 = !DILocation(line: 127, column: 21, scope: !795, inlinedAt: !865)
!865 = distinct !DILocation(line: 201, column: 9, scope: !866)
!866 = distinct !DILexicalBlock(scope: !867, file: !26, line: 201, column: 9)
!867 = distinct !DILexicalBlock(scope: !770, file: !26, line: 200, column: 7)
!868 = !DILocation(line: 200, column: 4, scope: !770)
!869 = !DILocation(line: 0, scope: !785, inlinedAt: !865)
!870 = !DILocation(line: 128, column: 4, scope: !795, inlinedAt: !865)
!871 = !DILocation(line: 142, column: 2, scope: !785, inlinedAt: !865)
!872 = !DILocation(line: 130, column: 8, scope: !799, inlinedAt: !865)
!873 = !DILocation(line: 130, column: 17, scope: !799, inlinedAt: !865)
!874 = !DILocation(line: 130, column: 8, scope: !800, inlinedAt: !865)
!875 = !DILocation(line: 133, column: 24, scope: !800, inlinedAt: !865)
!876 = !DILocation(line: 133, column: 46, scope: !800, inlinedAt: !865)
!877 = !DILocation(line: 133, column: 50, scope: !800, inlinedAt: !865)
!878 = !DILocation(line: 133, column: 32, scope: !800, inlinedAt: !865)
!879 = !DILocation(line: 133, column: 30, scope: !800, inlinedAt: !865)
!880 = !DILocation(line: 133, column: 4, scope: !800, inlinedAt: !865)
!881 = !DILocation(line: 133, column: 18, scope: !800, inlinedAt: !865)
!882 = !DILocation(line: 134, column: 4, scope: !800, inlinedAt: !865)
!883 = !DILocation(line: 135, column: 14, scope: !800, inlinedAt: !865)
!884 = !DILocation(line: 137, column: 12, scope: !801, inlinedAt: !865)
!885 = !DILocation(line: 137, column: 29, scope: !801, inlinedAt: !865)
!886 = !DILocation(line: 137, column: 3, scope: !800, inlinedAt: !865)
!887 = distinct !{!887, !888, !889}
!888 = !DILocation(line: 129, column: 3, scope: !801, inlinedAt: !865)
!889 = !DILocation(line: 137, column: 33, scope: !801, inlinedAt: !865)
!890 = !DILocation(line: 139, column: 20, scope: !801, inlinedAt: !865)
!891 = !DILocation(line: 139, column: 24, scope: !801, inlinedAt: !865)
!892 = !DILocation(line: 139, column: 15, scope: !801, inlinedAt: !865)
!893 = !DILocation(line: 139, column: 13, scope: !801, inlinedAt: !865)
!894 = !DILocation(line: 203, column: 13, scope: !770)
!895 = !DILocation(line: 140, column: 2, scope: !801, inlinedAt: !865)
!896 = !DILocation(line: 143, column: 17, scope: !785, inlinedAt: !865)
!897 = !DILocation(line: 143, column: 35, scope: !785, inlinedAt: !865)
!898 = !DILocation(line: 143, column: 10, scope: !785, inlinedAt: !865)
!899 = !DILocation(line: 203, column: 29, scope: !770)
!900 = !DILocation(line: 203, column: 23, scope: !770)
!901 = !DILocation(line: 203, column: 4, scope: !867)
!902 = distinct !{!902, !868, !903}
!903 = !DILocation(line: 203, column: 34, scope: !770)
!904 = !DILocalVariable(name: "rc", arg: 1, scope: !905, file: !26, line: 55, type: !328)
!905 = distinct !DISubprogram(name: "rc_reset", scope: !26, file: !26, line: 55, type: !742, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !906)
!906 = !{!904}
!907 = !DILocation(line: 0, scope: !905, inlinedAt: !908)
!908 = distinct !DILocation(line: 207, column: 4, scope: !770)
!909 = !DILocation(line: 57, column: 10, scope: !905, inlinedAt: !908)
!910 = !DILocation(line: 58, column: 17, scope: !905, inlinedAt: !908)
!911 = !DILocation(line: 59, column: 12, scope: !905, inlinedAt: !908)
!912 = !DILocation(line: 60, column: 12, scope: !905, inlinedAt: !908)
!913 = !DILocation(line: 61, column: 12, scope: !905, inlinedAt: !908)
!914 = !DILocation(line: 208, column: 4, scope: !770)
!915 = !DILocation(line: 215, column: 3, scope: !771)
!916 = distinct !{!916, !779, !917}
!917 = !DILocation(line: 216, column: 2, scope: !760)
!918 = !DILocation(line: 219, column: 10, scope: !760)
!919 = !DILocation(line: 221, column: 2, scope: !760)
!920 = !DILocation(line: 222, column: 1, scope: !760)
!921 = !DISubprogram(name: "lzma_lzma_optimum_fast", scope: !177, file: !177, line: 140, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !924, !119, !925, !925}
!924 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !116)
!925 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!926 = !DISubprogram(name: "lzma_lzma_optimum_normal", scope: !177, file: !177, line: 144, type: !927, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !924, !119, !925, !925, !37}
!929 = distinct !DISubprogram(name: "lzma_lzma_encoder_reset", scope: !1, file: !1, line: 484, type: !930, scopeLine: 485, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !965)
!930 = !DISubroutineType(types: !931)
!931 = !{!115, !116, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !81, line: 399, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 185, size: 896, elements: !936)
!936 = !{!937, !938, !940, !941, !942, !943, !944, !946, !947, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !960, !961, !962, !963, !964}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !935, file: !81, line: 217, baseType: !37, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !935, file: !81, line: 240, baseType: !939, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !935, file: !81, line: 254, baseType: !37, size: 32, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !935, file: !81, line: 281, baseType: !37, size: 32, offset: 160)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !935, file: !81, line: 293, baseType: !37, size: 32, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !935, file: !81, line: 316, baseType: !37, size: 32, offset: 224)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !935, file: !81, line: 322, baseType: !945, size: 32, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !81, line: 155, baseType: !80)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !935, file: !81, line: 342, baseType: !37, size: 32, offset: 288)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !935, file: !81, line: 345, baseType: !948, size: 32, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !81, line: 111, baseType: !85)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !935, file: !81, line: 375, baseType: !37, size: 32, offset: 352)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !935, file: !81, line: 384, baseType: !37, size: 32, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !935, file: !81, line: 385, baseType: !37, size: 32, offset: 416)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !935, file: !81, line: 386, baseType: !37, size: 32, offset: 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !935, file: !81, line: 387, baseType: !37, size: 32, offset: 480)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !935, file: !81, line: 388, baseType: !37, size: 32, offset: 512)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !935, file: !81, line: 389, baseType: !37, size: 32, offset: 544)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !935, file: !81, line: 390, baseType: !37, size: 32, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !935, file: !81, line: 391, baseType: !37, size: 32, offset: 608)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !935, file: !81, line: 392, baseType: !959, size: 32, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !92)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !935, file: !81, line: 393, baseType: !959, size: 32, offset: 672)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !935, file: !81, line: 394, baseType: !959, size: 32, offset: 704)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !935, file: !81, line: 395, baseType: !959, size: 32, offset: 736)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !935, file: !81, line: 396, baseType: !103, size: 64, offset: 768)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !935, file: !81, line: 397, baseType: !103, size: 64, offset: 832)
!965 = !{!966, !967, !968, !969, !971, !973, !977, !979, !981, !984}
!966 = !DILocalVariable(name: "pcoder", arg: 1, scope: !929, file: !1, line: 484, type: !116)
!967 = !DILocalVariable(name: "options", arg: 2, scope: !929, file: !1, line: 484, type: !932)
!968 = !DILocalVariable(name: "coder", scope: !929, file: !1, line: 486, type: !175)
!969 = !DILocalVariable(name: "i", scope: !970, file: !1, line: 499, type: !44)
!970 = distinct !DILexicalBlock(scope: !929, file: !1, line: 499, column: 2)
!971 = !DILocalVariable(name: "i", scope: !972, file: !1, line: 505, type: !44)
!972 = distinct !DILexicalBlock(scope: !929, file: !1, line: 505, column: 2)
!973 = !DILocalVariable(name: "j", scope: !974, file: !1, line: 506, type: !44)
!974 = distinct !DILexicalBlock(scope: !975, file: !1, line: 506, column: 3)
!975 = distinct !DILexicalBlock(scope: !976, file: !1, line: 505, column: 38)
!976 = distinct !DILexicalBlock(scope: !972, file: !1, line: 505, column: 2)
!977 = !DILocalVariable(name: "i", scope: !978, file: !1, line: 517, type: !44)
!978 = distinct !DILexicalBlock(scope: !929, file: !1, line: 517, column: 2)
!979 = !DILocalVariable(name: "i", scope: !980, file: !1, line: 521, type: !44)
!980 = distinct !DILexicalBlock(scope: !929, file: !1, line: 521, column: 2)
!981 = !DILocalVariable(name: "bt_i", scope: !982, file: !1, line: 522, type: !37)
!982 = distinct !DILexicalBlock(scope: !983, file: !1, line: 522, column: 3)
!983 = distinct !DILexicalBlock(scope: !980, file: !1, line: 521, column: 2)
!984 = !DILocalVariable(name: "bt_i", scope: !985, file: !1, line: 524, type: !37)
!985 = distinct !DILexicalBlock(scope: !929, file: !1, line: 524, column: 2)
!986 = !DILocation(line: 0, scope: !929)
!987 = !DILocalVariable(name: "options", arg: 1, scope: !988, file: !1, line: 430, type: !932)
!988 = distinct !DISubprogram(name: "is_options_valid", scope: !1, file: !1, line: 430, type: !989, scopeLine: 431, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !991)
!989 = !DISubroutineType(types: !990)
!990 = !{!194, !932}
!991 = !{!987}
!992 = !DILocation(line: 0, scope: !988, inlinedAt: !993)
!993 = distinct !DILocation(line: 487, column: 7, scope: !994)
!994 = distinct !DILexicalBlock(scope: !929, file: !1, line: 487, column: 6)
!995 = !DILocalVariable(name: "options", arg: 1, scope: !996, file: !66, line: 33, type: !932)
!996 = distinct !DISubprogram(name: "is_lclppb_valid", scope: !66, file: !66, line: 33, type: !989, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !997)
!997 = !{!995}
!998 = !DILocation(line: 0, scope: !996, inlinedAt: !999)
!999 = distinct !DILocation(line: 434, column: 9, scope: !988, inlinedAt: !993)
!1000 = !DILocation(line: 35, column: 18, scope: !996, inlinedAt: !999)
!1001 = !DILocation(line: 35, column: 21, scope: !996, inlinedAt: !999)
!1002 = !DILocation(line: 35, column: 38, scope: !996, inlinedAt: !999)
!1003 = !DILocation(line: 35, column: 50, scope: !996, inlinedAt: !999)
!1004 = !DILocation(line: 35, column: 53, scope: !996, inlinedAt: !999)
!1005 = !DILocation(line: 36, column: 4, scope: !996, inlinedAt: !999)
!1006 = !DILocation(line: 37, column: 16, scope: !996, inlinedAt: !999)
!1007 = !DILocation(line: 37, column: 19, scope: !996, inlinedAt: !999)
!1008 = !DILocation(line: 435, column: 4, scope: !988, inlinedAt: !993)
!1009 = !DILocation(line: 435, column: 16, scope: !988, inlinedAt: !993)
!1010 = !DILocation(line: 436, column: 4, scope: !988, inlinedAt: !993)
!1011 = !DILocation(line: 437, column: 17, scope: !988, inlinedAt: !993)
!1012 = !DILocation(line: 438, column: 5, scope: !988, inlinedAt: !993)
!1013 = !DILocation(line: 487, column: 6, scope: !929)
!1014 = !DILocation(line: 490, column: 40, scope: !929)
!1015 = !DILocation(line: 490, column: 9, scope: !929)
!1016 = !DILocation(line: 490, column: 18, scope: !929)
!1017 = !DILocation(line: 491, column: 41, scope: !929)
!1018 = !DILocation(line: 491, column: 9, scope: !929)
!1019 = !DILocation(line: 491, column: 30, scope: !929)
!1020 = !DILocation(line: 492, column: 44, scope: !929)
!1021 = !DILocation(line: 492, column: 48, scope: !929)
!1022 = !DILocation(line: 492, column: 9, scope: !929)
!1023 = !DILocation(line: 492, column: 26, scope: !929)
!1024 = !DILocation(line: 0, scope: !905, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 495, column: 2, scope: !929)
!1026 = !DILocation(line: 57, column: 10, scope: !905, inlinedAt: !1025)
!1027 = !DILocation(line: 58, column: 6, scope: !905, inlinedAt: !1025)
!1028 = !DILocation(line: 58, column: 17, scope: !905, inlinedAt: !1025)
!1029 = !DILocation(line: 59, column: 6, scope: !905, inlinedAt: !1025)
!1030 = !DILocation(line: 59, column: 12, scope: !905, inlinedAt: !1025)
!1031 = !DILocation(line: 60, column: 6, scope: !905, inlinedAt: !1025)
!1032 = !DILocation(line: 60, column: 12, scope: !905, inlinedAt: !1025)
!1033 = !DILocation(line: 61, column: 6, scope: !905, inlinedAt: !1025)
!1034 = !DILocation(line: 61, column: 12, scope: !905, inlinedAt: !1025)
!1035 = !DILocation(line: 498, column: 9, scope: !929)
!1036 = !DILocation(line: 0, scope: !970)
!1037 = !DILocation(line: 502, column: 22, scope: !929)
!1038 = !DILocation(line: 498, column: 15, scope: !929)
!1039 = !DILocation(line: 502, column: 40, scope: !929)
!1040 = !DILocation(line: 502, column: 53, scope: !929)
!1041 = !DILocalVariable(name: "probs", arg: 1, scope: !1042, file: !66, line: 129, type: !1045)
!1042 = distinct !DISubprogram(name: "literal_init", scope: !66, file: !66, line: 129, type: !1043, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1048)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{null, !1045, !37, !37}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 12288, elements: !1047)
!1047 = !{!204}
!1048 = !{!1041, !1049, !1050, !1051, !1052, !1054}
!1049 = !DILocalVariable(name: "lc", arg: 2, scope: !1042, file: !66, line: 130, type: !37)
!1050 = !DILocalVariable(name: "lp", arg: 3, scope: !1042, file: !66, line: 130, type: !37)
!1051 = !DILocalVariable(name: "coders", scope: !1042, file: !66, line: 134, type: !357)
!1052 = !DILocalVariable(name: "i", scope: !1053, file: !66, line: 136, type: !37)
!1053 = distinct !DILexicalBlock(scope: !1042, file: !66, line: 136, column: 2)
!1054 = !DILocalVariable(name: "j", scope: !1055, file: !66, line: 137, type: !37)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !66, line: 137, column: 3)
!1056 = distinct !DILexicalBlock(scope: !1053, file: !66, line: 136, column: 2)
!1057 = !DILocation(line: 0, scope: !1042, inlinedAt: !1058)
!1058 = distinct !DILocation(line: 502, column: 2, scope: !929)
!1059 = !DILocation(line: 134, column: 36, scope: !1042, inlinedAt: !1058)
!1060 = !DILocation(line: 0, scope: !1053, inlinedAt: !1058)
!1061 = !DILocation(line: 136, column: 2, scope: !1053, inlinedAt: !1058)
!1062 = !DILocation(line: 0, scope: !1055, inlinedAt: !1058)
!1063 = !DILocation(line: 138, column: 4, scope: !1064, inlinedAt: !1058)
!1064 = distinct !DILexicalBlock(scope: !1055, file: !66, line: 137, column: 3)
!1065 = !DILocation(line: 136, column: 35, scope: !1056, inlinedAt: !1058)
!1066 = !DILocation(line: 136, column: 25, scope: !1056, inlinedAt: !1058)
!1067 = distinct !{!1067, !1061, !1068}
!1068 = !DILocation(line: 138, column: 4, scope: !1053, inlinedAt: !1058)
!1069 = !DILocation(line: 0, scope: !972)
!1070 = !DILocation(line: 0, scope: !974)
!1071 = !DILocation(line: 506, column: 3, scope: !974)
!1072 = !DILocation(line: 506, column: 44, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !974, file: !1, line: 506, column: 3)
!1074 = !DILocation(line: 507, column: 4, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1073, file: !1, line: 506, column: 49)
!1076 = !DILocation(line: 508, column: 4, scope: !1075)
!1077 = distinct !{!1077, !1071, !1078, !1079, !1080}
!1078 = !DILocation(line: 509, column: 3, scope: !974)
!1079 = !{!"llvm.loop.isvectorized", i32 1}
!1080 = !{!"llvm.loop.unroll.runtime.disable"}
!1081 = !DILocation(line: 511, column: 3, scope: !975)
!1082 = !DILocation(line: 512, column: 3, scope: !975)
!1083 = !DILocation(line: 513, column: 3, scope: !975)
!1084 = !DILocation(line: 514, column: 3, scope: !975)
!1085 = distinct !{!1085, !1071, !1078, !1079, !1080}
!1086 = !DILocation(line: 506, column: 24, scope: !1073)
!1087 = distinct !{!1087, !1071, !1078, !1080, !1079}
!1088 = distinct !{!1088, !1071, !1078, !1079, !1080}
!1089 = distinct !{!1089, !1071, !1078, !1080, !1079}
!1090 = distinct !{!1090, !1071, !1078, !1079, !1080}
!1091 = distinct !{!1091, !1071, !1078, !1080, !1079}
!1092 = distinct !{!1092, !1071, !1078, !1079, !1080}
!1093 = distinct !{!1093, !1071, !1078, !1080, !1079}
!1094 = distinct !{!1094, !1071, !1078, !1079, !1080}
!1095 = distinct !{!1095, !1071, !1078, !1080, !1079}
!1096 = distinct !{!1096, !1071, !1078, !1079, !1080}
!1097 = distinct !{!1097, !1071, !1078, !1080, !1079}
!1098 = distinct !{!1098, !1071, !1078, !1079, !1080}
!1099 = distinct !{!1099, !1071, !1078, !1080, !1079}
!1100 = distinct !{!1100, !1071, !1078, !1079, !1080}
!1101 = distinct !{!1101, !1071, !1078, !1080, !1079}
!1102 = distinct !{!1102, !1071, !1078, !1079, !1080}
!1103 = distinct !{!1103, !1071, !1078, !1080, !1079}
!1104 = distinct !{!1104, !1071, !1078, !1079, !1080}
!1105 = distinct !{!1105, !1071, !1078, !1080, !1079}
!1106 = distinct !{!1106, !1071, !1078, !1079, !1080}
!1107 = distinct !{!1107, !1071, !1078, !1080, !1079}
!1108 = !DILocation(line: 0, scope: !978)
!1109 = !DILocation(line: 518, column: 3, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !978, file: !1, line: 517, column: 2)
!1111 = !DILocation(line: 0, scope: !980)
!1112 = !DILocation(line: 522, column: 3, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !982, file: !1, line: 522, column: 3)
!1114 = !DILocation(line: 0, scope: !985)
!1115 = !DILocation(line: 524, column: 2, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !985, file: !1, line: 524, column: 2)
!1117 = !DILocation(line: 527, column: 31, scope: !929)
!1118 = !DILocation(line: 528, column: 19, scope: !929)
!1119 = !DILocation(line: 528, column: 7, scope: !929)
!1120 = !DILocation(line: 528, column: 30, scope: !929)
!1121 = !DILocalVariable(name: "lencoder", arg: 1, scope: !1122, file: !1, line: 461, type: !1125)
!1122 = distinct !DISubprogram(name: "length_encoder_reset", scope: !1, file: !1, line: 461, type: !1123, scopeLine: 463, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1127)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null, !1125, !357, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!1127 = !{!1121, !1128, !1129, !1130, !1132, !1136, !1138, !1140}
!1128 = !DILocalVariable(name: "num_pos_states", arg: 2, scope: !1122, file: !1, line: 462, type: !357)
!1129 = !DILocalVariable(name: "fast_mode", arg: 3, scope: !1122, file: !1, line: 462, type: !1126)
!1130 = !DILocalVariable(name: "pos_state", scope: !1131, file: !1, line: 467, type: !44)
!1131 = distinct !DILexicalBlock(scope: !1122, file: !1, line: 467, column: 2)
!1132 = !DILocalVariable(name: "bt_i", scope: !1133, file: !1, line: 468, type: !37)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !1, line: 468, column: 3)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !1, line: 467, column: 70)
!1135 = distinct !DILexicalBlock(scope: !1131, file: !1, line: 467, column: 2)
!1136 = !DILocalVariable(name: "bt_i", scope: !1137, file: !1, line: 469, type: !37)
!1137 = distinct !DILexicalBlock(scope: !1134, file: !1, line: 469, column: 3)
!1138 = !DILocalVariable(name: "bt_i", scope: !1139, file: !1, line: 472, type: !37)
!1139 = distinct !DILexicalBlock(scope: !1122, file: !1, line: 472, column: 2)
!1140 = !DILocalVariable(name: "pos_state", scope: !1141, file: !1, line: 475, type: !44)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !1, line: 475, column: 3)
!1142 = distinct !DILexicalBlock(scope: !1122, file: !1, line: 474, column: 6)
!1143 = !DILocation(line: 0, scope: !1122, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 527, column: 2, scope: !929)
!1145 = !DILocation(line: 464, column: 2, scope: !1122, inlinedAt: !1144)
!1146 = !DILocation(line: 465, column: 2, scope: !1122, inlinedAt: !1144)
!1147 = !DILocation(line: 0, scope: !1131, inlinedAt: !1144)
!1148 = !DILocation(line: 467, column: 2, scope: !1131, inlinedAt: !1144)
!1149 = distinct !{!1149, !1071, !1078, !1080, !1079}
!1150 = !DILocation(line: 467, column: 57, scope: !1135, inlinedAt: !1144)
!1151 = !DILocation(line: 468, column: 3, scope: !1152, inlinedAt: !1144)
!1152 = distinct !DILexicalBlock(scope: !1133, file: !1, line: 468, column: 3)
!1153 = !DILocation(line: 469, column: 3, scope: !1154, inlinedAt: !1144)
!1154 = distinct !DILexicalBlock(scope: !1137, file: !1, line: 469, column: 3)
!1155 = distinct !{!1155, !1148, !1156, !1079, !1080}
!1156 = !DILocation(line: 470, column: 2, scope: !1131, inlinedAt: !1144)
!1157 = !DILocation(line: 0, scope: !1133, inlinedAt: !1144)
!1158 = !DILocation(line: 0, scope: !1137, inlinedAt: !1144)
!1159 = distinct !{!1159, !1148, !1156, !1079}
!1160 = !DILocation(line: 0, scope: !1139, inlinedAt: !1144)
!1161 = !DILocation(line: 472, column: 2, scope: !1162, inlinedAt: !1144)
!1162 = distinct !DILexicalBlock(scope: !1139, file: !1, line: 472, column: 2)
!1163 = !DILocation(line: 0, scope: !1141, inlinedAt: !1144)
!1164 = !DILocation(line: 474, column: 6, scope: !1122, inlinedAt: !1144)
!1165 = !DILocation(line: 477, column: 35, scope: !1166, inlinedAt: !1144)
!1166 = distinct !DILexicalBlock(scope: !1141, file: !1, line: 475, column: 3)
!1167 = !DILocation(line: 477, column: 4, scope: !1166, inlinedAt: !1144)
!1168 = !DILocation(line: 476, column: 5, scope: !1166, inlinedAt: !1144)
!1169 = !DILocation(line: 475, column: 40, scope: !1166, inlinedAt: !1144)
!1170 = !DILocation(line: 475, column: 3, scope: !1141, inlinedAt: !1144)
!1171 = distinct !{!1171, !1170, !1172}
!1172 = !DILocation(line: 477, column: 44, scope: !1141, inlinedAt: !1144)
!1173 = !DILocation(line: 531, column: 30, scope: !929)
!1174 = !DILocation(line: 530, column: 31, scope: !929)
!1175 = !DILocation(line: 531, column: 19, scope: !929)
!1176 = !DILocation(line: 531, column: 7, scope: !929)
!1177 = !DILocation(line: 0, scope: !1122, inlinedAt: !1178)
!1178 = distinct !DILocation(line: 530, column: 2, scope: !929)
!1179 = !DILocation(line: 464, column: 2, scope: !1122, inlinedAt: !1178)
!1180 = !DILocation(line: 465, column: 2, scope: !1122, inlinedAt: !1178)
!1181 = !DILocation(line: 0, scope: !1131, inlinedAt: !1178)
!1182 = !DILocation(line: 467, column: 2, scope: !1131, inlinedAt: !1178)
!1183 = !DILocation(line: 467, column: 57, scope: !1135, inlinedAt: !1178)
!1184 = !DILocation(line: 468, column: 3, scope: !1152, inlinedAt: !1178)
!1185 = !DILocation(line: 469, column: 3, scope: !1154, inlinedAt: !1178)
!1186 = distinct !{!1186, !1182, !1187, !1079, !1080}
!1187 = !DILocation(line: 470, column: 2, scope: !1131, inlinedAt: !1178)
!1188 = !DILocation(line: 0, scope: !1133, inlinedAt: !1178)
!1189 = !DILocation(line: 0, scope: !1137, inlinedAt: !1178)
!1190 = distinct !{!1190, !1182, !1187, !1079}
!1191 = !DILocation(line: 0, scope: !1139, inlinedAt: !1178)
!1192 = !DILocation(line: 472, column: 2, scope: !1162, inlinedAt: !1178)
!1193 = !DILocation(line: 0, scope: !1141, inlinedAt: !1178)
!1194 = !DILocation(line: 474, column: 6, scope: !1122, inlinedAt: !1178)
!1195 = !DILocation(line: 477, column: 35, scope: !1166, inlinedAt: !1178)
!1196 = !DILocation(line: 477, column: 4, scope: !1166, inlinedAt: !1178)
!1197 = !DILocation(line: 476, column: 5, scope: !1166, inlinedAt: !1178)
!1198 = !DILocation(line: 475, column: 40, scope: !1166, inlinedAt: !1178)
!1199 = !DILocation(line: 475, column: 3, scope: !1141, inlinedAt: !1178)
!1200 = distinct !{!1200, !1199, !1201}
!1201 = !DILocation(line: 477, column: 44, scope: !1141, inlinedAt: !1178)
!1202 = !DILocation(line: 546, column: 9, scope: !929)
!1203 = !DILocation(line: 546, column: 27, scope: !929)
!1204 = !DILocation(line: 547, column: 9, scope: !929)
!1205 = !DILocation(line: 547, column: 27, scope: !929)
!1206 = !DILocation(line: 549, column: 9, scope: !929)
!1207 = !DILocation(line: 549, column: 24, scope: !929)
!1208 = !DILocation(line: 550, column: 9, scope: !929)
!1209 = !DILocation(line: 550, column: 28, scope: !929)
!1210 = !DILocation(line: 552, column: 2, scope: !929)
!1211 = !DILocation(line: 553, column: 1, scope: !929)
!1212 = distinct !DISubprogram(name: "lzma_lzma_encoder_create", scope: !1, file: !1, line: 557, type: !1213, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1242)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!115, !1215, !1216, !932, !1229}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !1219)
!1219 = !{!1220, !1224, !1228}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1218, file: !4, line: 376, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!103, !103, !44, !44}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1218, file: !4, line: 390, baseType: !1225, size: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{null, !103, !103}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1218, file: !4, line: 401, baseType: !103, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !122, line: 161, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 129, size: 512, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !1231, file: !122, line: 132, baseType: !44, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !1231, file: !122, line: 135, baseType: !44, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !1231, file: !122, line: 139, baseType: !44, size: 64, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !1231, file: !122, line: 144, baseType: !44, size: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !1231, file: !122, line: 148, baseType: !44, size: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !1231, file: !122, line: 151, baseType: !948, size: 32, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1231, file: !122, line: 154, baseType: !37, size: 32, offset: 352)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !1231, file: !122, line: 157, baseType: !939, size: 64, offset: 384)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !1231, file: !122, line: 159, baseType: !37, size: 32, offset: 448)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248}
!1243 = !DILocalVariable(name: "coder_ptr", arg: 1, scope: !1212, file: !1, line: 557, type: !1215)
!1244 = !DILocalVariable(name: "allocator", arg: 2, scope: !1212, file: !1, line: 557, type: !1216)
!1245 = !DILocalVariable(name: "options", arg: 3, scope: !1212, file: !1, line: 558, type: !932)
!1246 = !DILocalVariable(name: "lz_options", arg: 4, scope: !1212, file: !1, line: 558, type: !1229)
!1247 = !DILocalVariable(name: "coder", scope: !1212, file: !1, line: 567, type: !175)
!1248 = !DILocalVariable(name: "log_size", scope: !1249, file: !1, line: 583, type: !37)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !1, line: 578, column: 26)
!1250 = distinct !DILexicalBlock(scope: !1212, file: !1, line: 573, column: 25)
!1251 = !DILocation(line: 0, scope: !1212)
!1252 = !DILocation(line: 561, column: 6, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1212, file: !1, line: 561, column: 6)
!1254 = !DILocation(line: 561, column: 17, scope: !1253)
!1255 = !DILocation(line: 561, column: 6, scope: !1212)
!1256 = !DILocation(line: 562, column: 16, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1253, file: !1, line: 561, column: 26)
!1258 = !DILocation(line: 562, column: 14, scope: !1257)
!1259 = !DILocation(line: 563, column: 18, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1257, file: !1, line: 563, column: 7)
!1261 = !DILocation(line: 563, column: 7, scope: !1257)
