; ModuleID = 'liblzma/lzma/lzma_encoder_optimum_fast.c'
source_filename = "liblzma/lzma/lzma_encoder_optimum_fast.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_match = type { i32, i32 }

; Function Attrs: nounwind uwtable
define dso_local void @lzma_lzma_optimum_fast(ptr noundef %pcoder, ptr noalias noundef %mf, ptr noalias nocapture noundef writeonly %back_res, ptr noalias nocapture noundef writeonly %len_res) local_unnamed_addr #0 !dbg !74 {
entry:
  %matches_count = alloca i32, align 4, !DIAssignID !263
    #dbg_assign(i1 undef, !238, !DIExpression(), !263, ptr %matches_count, !DIExpression(), !264)
    #dbg_value(ptr %pcoder, !126, !DIExpression(), !264)
    #dbg_value(ptr %mf, !127, !DIExpression(), !264)
    #dbg_value(ptr %back_res, !128, !DIExpression(), !264)
    #dbg_value(ptr %len_res, !129, !DIExpression(), !264)
    #dbg_value(ptr %pcoder, !130, !DIExpression(), !264)
  %nice_len1 = getelementptr inbounds i8, ptr %mf, i64 96, !dbg !265
  %0 = load i32, ptr %nice_len1, align 8, !dbg !265
    #dbg_value(i32 %0, !235, !DIExpression(), !264)
  %.fr = freeze i32 %0
  call void @llvm.lifetime.start.p0(i64 4, ptr nonnull %matches_count) #4, !dbg !266
  %read_ahead = getelementptr inbounds i8, ptr %mf, i64 28, !dbg !267
  %1 = load i32, ptr %read_ahead, align 4, !dbg !267
  %cmp = icmp eq i32 %1, 0, !dbg !269

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lzma/lzma_encoder_optimum_fast.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "2f7decb644128e554449599785f4e3e7")
!2 = !{!3, !11, !51}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!8 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!9 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!10 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !13, file: !12, line: 40, baseType: !5, size: 32, elements: !45)
!12 = !DIFile(filename: "liblzma/rangecoder/range_encoder.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e02ad9079871d268a82b8ebf2e7d385d")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 27, size: 5888, elements: !14)
!14 = !{!15, !21, !22, !25, !29, !32, !33, !37}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !13, file: !12, line: 28, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 27, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !19, line: 45, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!20 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !13, file: !12, line: 29, baseType: !16, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !12, line: 30, baseType: !23, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 26, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 42, baseType: !5)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !13, file: !12, line: 31, baseType: !26, size: 8, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 24, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !19, line: 38, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !13, file: !12, line: 34, baseType: !30, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 18, baseType: !20)
!31 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !13, file: !12, line: 37, baseType: !30, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !13, file: !12, line: 46, baseType: !34, size: 1856, offset: 320)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1856, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 58)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !13, file: !12, line: 49, baseType: !38, size: 3712, offset: 2176)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 3712, elements: !35)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "probability", file: !41, line: 71, baseType: !42)
!41 = !DIFile(filename: "liblzma/rangecoder/range_common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "7d3e93a1bf35640522f499de026cfdad")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 25, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !19, line: 40, baseType: !44)
!44 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIEnumerator(name: "RC_BIT_0", value: 0)
!47 = !DIEnumerator(name: "RC_BIT_1", value: 1)
!48 = !DIEnumerator(name: "RC_DIRECT_0", value: 2)
!49 = !DIEnumerator(name: "RC_DIRECT_1", value: 3)
!50 = !DIEnumerator(name: "RC_FLUSH", value: 4)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 56, baseType: !5, size: 32, elements: !53)
!52 = !DIFile(filename: "liblzma/lzma/lzma_common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "ce364754aa91e57f603599f25328df33")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!54 = !DIEnumerator(name: "STATE_LIT_LIT", value: 0)
!55 = !DIEnumerator(name: "STATE_MATCH_LIT_LIT", value: 1)
!56 = !DIEnumerator(name: "STATE_REP_LIT_LIT", value: 2)
!57 = !DIEnumerator(name: "STATE_SHORTREP_LIT_LIT", value: 3)
!58 = !DIEnumerator(name: "STATE_MATCH_LIT", value: 4)
!59 = !DIEnumerator(name: "STATE_REP_LIT", value: 5)
!60 = !DIEnumerator(name: "STATE_SHORTREP_LIT", value: 6)
!61 = !DIEnumerator(name: "STATE_LIT_MATCH", value: 7)
!62 = !DIEnumerator(name: "STATE_LIT_LONGREP", value: 8)
!63 = !DIEnumerator(name: "STATE_LIT_SHORTREP", value: 9)
!64 = !DIEnumerator(name: "STATE_NONLIT_MATCH", value: 10)
!65 = !DIEnumerator(name: "STATE_NONLIT_REP", value: 11)
!66 = !{i32 7, !"Dwarf Version", i32 5}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{i32 8, !"PIC Level", i32 2}
!70 = !{i32 7, !"PIE Level", i32 2}
!71 = !{i32 7, !"uwtable", i32 2}
!72 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!73 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!74 = distinct !DISubprogram(name: "lzma_lzma_optimum_fast", scope: !1, file: !1, line: 20, type: !75, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !125)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !80, !124, !124}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !79, line: 78, baseType: null)
!79 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !83, line: 28, baseType: !84)
!83 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "780f78e6e21a3ca52f57df68bfdc6f53")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !83, line: 29, size: 960, elements: !85)
!85 = !{!86, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !107, !111, !113, !114, !115, !116, !117, !118, !119, !120, !122, !123}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !84, file: !83, line: 35, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !83, line: 39, baseType: !23, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !84, file: !83, line: 45, baseType: !23, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !84, file: !83, line: 51, baseType: !23, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !84, file: !83, line: 58, baseType: !23, size: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !84, file: !83, line: 63, baseType: !23, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !84, file: !83, line: 67, baseType: !23, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !84, file: !83, line: 75, baseType: !23, size: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !84, file: !83, line: 80, baseType: !23, size: 32, offset: 288)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !84, file: !83, line: 84, baseType: !23, size: 32, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !84, file: !83, line: 92, baseType: !98, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!23, !81, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !83, line: 25, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 22, size: 64, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !103, file: !83, line: 23, baseType: !23, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !103, file: !83, line: 24, baseType: !23, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !84, file: !83, line: 97, baseType: !108, size: 64, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !81, !23}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !84, file: !83, line: 99, baseType: !112, size: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !84, file: !83, line: 100, baseType: !112, size: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !84, file: !83, line: 101, baseType: !23, size: 32, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !84, file: !83, line: 102, baseType: !23, size: 32, offset: 672)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !84, file: !83, line: 103, baseType: !23, size: 32, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !84, file: !83, line: 106, baseType: !23, size: 32, offset: 736)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !84, file: !83, line: 109, baseType: !23, size: 32, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !84, file: !83, line: 114, baseType: !23, size: 32, offset: 800)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !84, file: !83, line: 119, baseType: !121, size: 32, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !84, file: !83, line: 122, baseType: !23, size: 32, offset: 864)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !84, file: !83, line: 125, baseType: !23, size: 32, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !112)
!125 = !{!126, !127, !128, !129, !130, !235, !237, !238, !239, !242, !243, !244, !245, !247, !251, !252, !253, !256, !257, !259, !262}
!126 = !DILocalVariable(name: "pcoder", arg: 1, scope: !74, file: !1, line: 20, type: !77)
!127 = !DILocalVariable(name: "mf", arg: 2, scope: !74, file: !1, line: 20, type: !80)
!128 = !DILocalVariable(name: "back_res", arg: 3, scope: !74, file: !1, line: 21, type: !124)
!129 = !DILocalVariable(name: "len_res", arg: 4, scope: !74, file: !1, line: 21, type: !124)
!130 = !DILocalVariable(name: "coder", scope: !74, file: !1, line: 23, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !134, line: 72, size: 1996608, elements: !135)
!134 = !DIFile(filename: "liblzma/lzma/lzma_encoder_private.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "0c1b7b41ddfbed104b8c32f19cfcc2b2")
!135 = !{!136, !138, !140, !144, !148, !149, !150, !152, !153, !154, !155, !156, !157, !162, !166, !169, !170, !171, !172, !173, !177, !181, !184, !206, !207, !209, !213, !214, !215, !216, !217, !218, !219}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !133, file: !134, line: 74, baseType: !137, size: 5888)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_range_encoder", file: !12, line: 51, baseType: !13)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !133, file: !134, line: 77, baseType: !139, size: 32, offset: 5888)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lzma_state", file: !52, line: 69, baseType: !51)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reps", scope: !133, file: !134, line: 80, baseType: !141, size: 128, offset: 5920)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 4)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !133, file: !134, line: 83, baseType: !145, size: 17536, offset: 6048)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 17536, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 274)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "matches_count", scope: !133, file: !134, line: 86, baseType: !23, size: 32, offset: 23584)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "longest_match_length", scope: !133, file: !134, line: 90, baseType: !23, size: 32, offset: 23616)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fast_mode", scope: !133, file: !134, line: 93, baseType: !151, size: 8, offset: 23648)
!151 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !133, file: !134, line: 97, baseType: !151, size: 8, offset: 23656)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "is_flushed", scope: !133, file: !134, line: 101, baseType: !151, size: 8, offset: 23664)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pos_mask", scope: !133, file: !134, line: 103, baseType: !23, size: 32, offset: 23680)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "literal_context_bits", scope: !133, file: !134, line: 104, baseType: !23, size: 32, offset: 23712)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "literal_pos_mask", scope: !133, file: !134, line: 105, baseType: !23, size: 32, offset: 23744)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "literal", scope: !133, file: !134, line: 108, baseType: !158, size: 196608, offset: 23776)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 196608, elements: !159)
!159 = !{!160, !161}
!160 = !DISubrange(count: 16)
!161 = !DISubrange(count: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "is_match", scope: !133, file: !134, line: 109, baseType: !163, size: 3072, offset: 220384)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 3072, elements: !164)
!164 = !{!165, !160}
!165 = !DISubrange(count: 12)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep", scope: !133, file: !134, line: 110, baseType: !167, size: 192, offset: 223456)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !168)
!168 = !{!165}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0", scope: !133, file: !134, line: 111, baseType: !167, size: 192, offset: 223648)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep1", scope: !133, file: !134, line: 112, baseType: !167, size: 192, offset: 223840)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep2", scope: !133, file: !134, line: 113, baseType: !167, size: 192, offset: 224032)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0_long", scope: !133, file: !134, line: 114, baseType: !163, size: 3072, offset: 224224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot", scope: !133, file: !134, line: 115, baseType: !174, size: 4096, offset: 227296)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !175)
!175 = !{!143, !176}
!176 = !DISubrange(count: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pos_special", scope: !133, file: !134, line: 116, baseType: !178, size: 1824, offset: 231392)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1824, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 114)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pos_align", scope: !133, file: !134, line: 117, baseType: !182, size: 256, offset: 233216)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !183)
!183 = !{!160}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_encoder", scope: !133, file: !134, line: 121, baseType: !185, size: 148032, offset: 233472)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_length_encoder", file: !134, line: 51, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 40, size: 148032, elements: !187)
!187 = !{!188, !189, !190, !194, !195, !199, !203, !204}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "choice", scope: !186, file: !134, line: 41, baseType: !40, size: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !186, file: !134, line: 42, baseType: !40, size: 16, offset: 16)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !186, file: !134, line: 43, baseType: !191, size: 2048, offset: 32)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !192)
!192 = !{!160, !193}
!193 = !DISubrange(count: 8)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !186, file: !134, line: 44, baseType: !191, size: 2048, offset: 2080)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !186, file: !134, line: 45, baseType: !196, size: 4096, offset: 4128)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prices", scope: !186, file: !134, line: 47, baseType: !200, size: 139264, offset: 8224)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 139264, elements: !201)
!201 = !{!160, !202}
!202 = !DISubrange(count: 272)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !186, file: !134, line: 48, baseType: !23, size: 32, offset: 147488)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !186, file: !134, line: 49, baseType: !205, size: 512, offset: 147520)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !183)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rep_len_encoder", scope: !133, file: !134, line: 122, baseType: !185, size: 148032, offset: 381504)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot_prices", scope: !133, file: !134, line: 125, baseType: !208, size: 8192, offset: 529536)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !175)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "distances_prices", scope: !133, file: !134, line: 126, baseType: !210, size: 16384, offset: 537728)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, elements: !211)
!211 = !{!143, !212}
!212 = !DISubrange(count: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dist_table_size", scope: !133, file: !134, line: 127, baseType: !23, size: 32, offset: 554112)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "match_price_count", scope: !133, file: !134, line: 128, baseType: !23, size: 32, offset: 554144)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "align_prices", scope: !133, file: !134, line: 130, baseType: !205, size: 512, offset: 554176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "align_price_count", scope: !133, file: !134, line: 131, baseType: !23, size: 32, offset: 554688)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "opts_end_index", scope: !133, file: !134, line: 134, baseType: !23, size: 32, offset: 554720)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "opts_current_index", scope: !133, file: !134, line: 135, baseType: !23, size: 32, offset: 554752)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !133, file: !134, line: 136, baseType: !220, size: 1441792, offset: 554784)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 1441792, elements: !233)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_optimal", file: !134, line: 69, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 54, size: 352, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !222, file: !134, line: 55, baseType: !139, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prev_1_is_literal", scope: !222, file: !134, line: 57, baseType: !151, size: 8, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prev_2", scope: !222, file: !134, line: 58, baseType: !151, size: 8, offset: 40)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev_2", scope: !222, file: !134, line: 60, baseType: !23, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev_2", scope: !222, file: !134, line: 61, baseType: !23, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !222, file: !134, line: 63, baseType: !23, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev", scope: !222, file: !134, line: 64, baseType: !23, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev", scope: !222, file: !134, line: 65, baseType: !23, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "backs", scope: !222, file: !134, line: 67, baseType: !141, size: 128, offset: 224)
!233 = !{!234}
!234 = !DISubrange(count: 4096)
!235 = !DILocalVariable(name: "nice_len", scope: !74, file: !1, line: 24, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!237 = !DILocalVariable(name: "len_main", scope: !74, file: !1, line: 26, type: !23)
!238 = !DILocalVariable(name: "matches_count", scope: !74, file: !1, line: 27, type: !23)
!239 = !DILocalVariable(name: "buf", scope: !74, file: !1, line: 36, type: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!242 = !DILocalVariable(name: "buf_avail", scope: !74, file: !1, line: 37, type: !236)
!243 = !DILocalVariable(name: "rep_len", scope: !74, file: !1, line: 47, type: !23)
!244 = !DILocalVariable(name: "rep_index", scope: !74, file: !1, line: 48, type: !23)
!245 = !DILocalVariable(name: "i", scope: !246, file: !1, line: 50, type: !23)
!246 = distinct !DILexicalBlock(scope: !74, file: !1, line: 50, column: 2)
!247 = !DILocalVariable(name: "buf_back", scope: !248, file: !1, line: 52, type: !250)
!248 = distinct !DILexicalBlock(scope: !249, file: !1, line: 50, column: 47)
!249 = distinct !DILexicalBlock(scope: !246, file: !1, line: 50, column: 2)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!251 = !DILocalVariable(name: "len", scope: !248, file: !1, line: 61, type: !23)
!252 = !DILocalVariable(name: "back_main", scope: !74, file: !1, line: 90, type: !23)
!253 = !DILocalVariable(name: "new_dist", scope: !254, file: !1, line: 135, type: !236)
!254 = distinct !DILexicalBlock(scope: !255, file: !1, line: 134, column: 40)
!255 = distinct !DILexicalBlock(scope: !74, file: !1, line: 134, column: 6)
!256 = !DILocalVariable(name: "limit", scope: !74, file: !1, line: 157, type: !236)
!257 = !DILocalVariable(name: "i", scope: !258, file: !1, line: 159, type: !23)
!258 = distinct !DILexicalBlock(scope: !74, file: !1, line: 159, column: 2)
!259 = !DILocalVariable(name: "buf_back", scope: !260, file: !1, line: 160, type: !250)
!260 = distinct !DILexicalBlock(scope: !261, file: !1, line: 159, column: 47)
!261 = distinct !DILexicalBlock(scope: !258, file: !1, line: 159, column: 2)
!262 = !DILocalVariable(name: "len", scope: !260, file: !1, line: 165, type: !23)
!263 = distinct !DIAssignID()
!264 = !DILocation(line: 0, scope: !74)
!265 = !DILocation(line: 24, column: 32, scope: !74)
!266 = !DILocation(line: 27, column: 2, scope: !74)
!267 = !DILocation(line: 28, column: 10, scope: !268)
!268 = distinct !DILexicalBlock(scope: !74, file: !1, line: 28, column: 6)
!269 = !DILocation(line: 28, column: 21, scope: !268)
!270 = !DILocation(line: 28, column: 6, scope: !74)
!271 = !DILocation(line: 29, column: 49, scope: !272)
!272 = distinct !DILexicalBlock(scope: !268, file: !1, line: 28, column: 27)
!273 = !DILocation(line: 29, column: 14, scope: !272)
!274 = !DILocation(line: 30, column: 2, scope: !272)
!275 = !DILocation(line: 32, column: 21, scope: !276)
!276 = distinct !DILexicalBlock(scope: !268, file: !1, line: 30, column: 9)
!277 = !DILocation(line: 33, column: 26, scope: !276)
!278 = !DILocation(line: 33, column: 17, scope: !276)
!279 = distinct !DIAssignID()
!280 = !DILocation(line: 0, scope: !268)
!281 = !DILocation(line: 36, column: 23, scope: !74)
!282 = !DILocalVariable(name: "mf", arg: 1, scope: !283, file: !83, line: 222, type: !286)
!283 = distinct !DISubprogram(name: "mf_ptr", scope: !83, file: !83, line: 222, type: !284, scopeLine: 223, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !288)
!284 = !DISubroutineType(types: !285)
!285 = !{!240, !286}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!288 = !{!282}
