; ModuleID = 'liblzma/lzma/lzma2_decoder.c'
source_filename = "liblzma/lzma/lzma2_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_lzma2_decoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters) local_unnamed_addr #0 !dbg !181 {
entry:
    #dbg_value(ptr %next, !237, !DIExpression(), !240)
    #dbg_value(ptr %allocator, !238, !DIExpression(), !240)
    #dbg_value(ptr %filters, !239, !DIExpression(), !240)
  %call = tail call i32 @lzma_lz_decoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters, ptr noundef nonnull @lzma2_decoder_init) #4, !dbg !241
  ret i32 %call, !dbg !242
}

declare !dbg !243 i32 @lzma_lz_decoder_init(ptr noundef, ptr noundef, ptr noundef, ptr noundef) local_unnamed_addr #1

; Function Attrs: nounwind uwtable
define internal i32 @lzma2_decoder_init(ptr nocapture noundef %lz, ptr noundef %allocator, ptr noundef %opt, ptr noundef %lz_options) #0 !dbg !257 {
entry:
    #dbg_value(ptr %lz, !259, !DIExpression(), !266)
    #dbg_value(ptr %allocator, !260, !DIExpression(), !266)
    #dbg_value(ptr %opt, !261, !DIExpression(), !266)
    #dbg_value(ptr %lz_options, !262, !DIExpression(), !266)
  %0 = load ptr, ptr %lz, align 8, !dbg !267
  %cmp = icmp eq ptr %0, null, !dbg !269
  br i1 %cmp, label %if.then, label %if.end9, !dbg !270


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !57, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lzma/lzma2_decoder.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "9cda6399cf9c2869972035c0d84226da")
!2 = !{!3, !19, !25, !32, !37, !44, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 138, baseType: !5, size: 32, elements: !34)
!33 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "c59c540efa0aff44f03d71331089fff8")
!34 = !{!35, !36}
!35 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!36 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 58, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!40 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!41 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!42 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!43 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !45)
!45 = !{!46}
!46 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sequence", file: !1, line: 20, baseType: !5, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56}
!49 = !DIEnumerator(name: "SEQ_CONTROL", value: 0)
!50 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_1", value: 1)
!51 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_2", value: 2)
!52 = !DIEnumerator(name: "SEQ_COMPRESSED_0", value: 3)
!53 = !DIEnumerator(name: "SEQ_COMPRESSED_1", value: 4)
!54 = !DIEnumerator(name: "SEQ_PROPERTIES", value: 5)
!55 = !DIEnumerator(name: "SEQ_LZMA", value: 6)
!56 = !DIEnumerator(name: "SEQ_COPY", value: 7)
!57 = !{!58, !59, !145}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 19, size: 1472, elements: !61)
!61 = !{!62, !63, !64, !136, !137, !138, !139, !140}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !60, file: !1, line: 29, baseType: !47, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next_sequence", scope: !60, file: !1, line: 32, baseType: !47, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "lzma", scope: !60, file: !1, line: 35, baseType: !65, size: 320, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_decoder", file: !66, line: 72, baseType: !67)
!66 = !DIFile(filename: "liblzma/lz/lz_decoder.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "27344aa2da5754ad4a118fbd9137003b")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 54, size: 320, elements: !68)
!68 = !{!69, !73, !105, !111, !119}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !67, file: !66, line: 56, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !72, line: 78, baseType: null)
!72 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !67, file: !66, line: 59, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !78, !79, !100, !103, !92}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!78 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!79 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_dict", file: !66, line: 44, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 20, size: 384, elements: !83)
!83 = !{!84, !91, !95, !96, !97, !98}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !82, file: !66, line: 24, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !87, line: 24, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !89, line: 38, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!90 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !82, file: !66, line: 28, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 18, baseType: !94)
!93 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!94 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !82, file: !66, line: 33, baseType: !92, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !82, file: !66, line: 36, baseType: !92, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !82, file: !66, line: 39, baseType: !92, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "need_reset", scope: !82, file: !66, line: 42, baseType: !99, size: 8, offset: 320)
!99 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!100 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!103 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !67, file: !66, line: 63, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !70, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "set_uncompressed", scope: !67, file: !66, line: 66, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !70, !115}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !116, line: 63, baseType: !117)
!116 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !87, line: 27, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !89, line: 45, baseType: !94)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !67, file: !66, line: 70, baseType: !120, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !70, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !126)
!126 = !{!127, !131, !135}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !125, file: !4, line: 376, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!58, !58, !92, !92}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !125, file: !4, line: 390, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !58, !58}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !125, file: !4, line: 401, baseType: !58, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !60, file: !1, line: 38, baseType: !92, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !60, file: !1, line: 42, baseType: !92, size: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "need_properties", scope: !60, file: !1, line: 46, baseType: !99, size: 8, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "need_dictionary_reset", scope: !60, file: !1, line: 50, baseType: !99, size: 8, offset: 520)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !60, file: !1, line: 52, baseType: !141, size: 896, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !33, line: 399, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 185, size: 896, elements: !143)
!143 = !{!144, !147, !148, !149, !150, !151, !152, !154, !155, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !168, !169, !170, !171, !172}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !142, file: !33, line: 217, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !87, line: 26, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !89, line: 42, baseType: !5)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !142, file: !33, line: 240, baseType: !101, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !142, file: !33, line: 254, baseType: !145, size: 32, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !142, file: !33, line: 281, baseType: !145, size: 32, offset: 160)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !142, file: !33, line: 293, baseType: !145, size: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !142, file: !33, line: 316, baseType: !145, size: 32, offset: 224)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !142, file: !33, line: 322, baseType: !153, size: 32, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !33, line: 155, baseType: !32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !142, file: !33, line: 342, baseType: !145, size: 32, offset: 288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !142, file: !33, line: 345, baseType: !156, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !33, line: 111, baseType: !37)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !142, file: !33, line: 375, baseType: !145, size: 32, offset: 352)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !142, file: !33, line: 384, baseType: !145, size: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !142, file: !33, line: 385, baseType: !145, size: 32, offset: 416)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !142, file: !33, line: 386, baseType: !145, size: 32, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !142, file: !33, line: 387, baseType: !145, size: 32, offset: 480)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !142, file: !33, line: 388, baseType: !145, size: 32, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !142, file: !33, line: 389, baseType: !145, size: 32, offset: 544)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !142, file: !33, line: 390, baseType: !145, size: 32, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !142, file: !33, line: 391, baseType: !145, size: 32, offset: 608)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !142, file: !33, line: 392, baseType: !167, size: 32, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !44)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !142, file: !33, line: 393, baseType: !167, size: 32, offset: 672)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !142, file: !33, line: 394, baseType: !167, size: 32, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !142, file: !33, line: 395, baseType: !167, size: 32, offset: 736)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !142, file: !33, line: 396, baseType: !58, size: 64, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !142, file: !33, line: 397, baseType: !58, size: 64, offset: 832)
!173 = !{i32 7, !"Dwarf Version", i32 5}
!174 = !{i32 2, !"Debug Info Version", i32 3}
!175 = !{i32 1, !"wchar_size", i32 4}
!176 = !{i32 8, !"PIC Level", i32 2}
!177 = !{i32 7, !"PIE Level", i32 2}
!178 = !{i32 7, !"uwtable", i32 2}
!179 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!180 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!181 = distinct !DISubprogram(name: "lzma_lzma2_decoder_init", scope: !1, file: !1, line: 253, type: !182, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !236)
!182 = !DISubroutineType(types: !183)
!183 = !{!77, !184, !123, !226}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !72, line: 80, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !72, line: 124, size: 512, elements: !187)
!187 = !{!188, !189, !190, !193, !200, !202, !209, !214}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !186, file: !72, line: 126, baseType: !70, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !72, line: 130, baseType: !115, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !72, line: 136, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !192, line: 90, baseType: !94)
!192 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!193 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !186, file: !72, line: 139, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !72, line: 94, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!77, !70, !123, !100, !103, !92, !198, !103, !92, !199}
!198 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !186, file: !72, line: 144, baseType: !201, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !72, line: 102, baseType: !120)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !186, file: !72, line: 148, baseType: !203, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !186, file: !72, line: 152, baseType: !210, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!77, !70, !213, !213, !117}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !186, file: !72, line: 157, baseType: !215, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!77, !70, !123, !218, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !221, line: 65, baseType: !222)
!221 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 43, size: 128, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !222, file: !221, line: 54, baseType: !115, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !222, file: !221, line: 63, baseType: !58, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !72, line: 82, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !72, line: 109, size: 192, elements: !230)
!230 = !{!231, !232, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !229, file: !72, line: 112, baseType: !115, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !229, file: !72, line: 116, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !72, line: 86, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !229, file: !72, line: 119, baseType: !58, size: 64, offset: 128)
!236 = !{!237, !238, !239}
!237 = !DILocalVariable(name: "next", arg: 1, scope: !181, file: !1, line: 253, type: !184)
!238 = !DILocalVariable(name: "allocator", arg: 2, scope: !181, file: !1, line: 253, type: !123)
!239 = !DILocalVariable(name: "filters", arg: 3, scope: !181, file: !1, line: 254, type: !226)
!240 = !DILocation(line: 0, scope: !181)
!241 = !DILocation(line: 260, column: 9, scope: !181)
!242 = !DILocation(line: 260, column: 2, scope: !181)
!243 = !DISubprogram(name: "lzma_lz_decoder_init", scope: !66, file: !66, line: 85, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!244 = !DISubroutineType(types: !245)
!245 = !{!77, !184, !123, !226, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!77, !249, !123, !109, !250}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !66, line: 51, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 47, size: 192, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !252, file: !66, line: 48, baseType: !92, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !252, file: !66, line: 49, baseType: !101, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !252, file: !66, line: 50, baseType: !92, size: 64, offset: 128)
!257 = distinct !DISubprogram(name: "lzma2_decoder_init", scope: !1, file: !1, line: 226, type: !247, scopeLine: 228, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !258)
!258 = !{!259, !260, !261, !262, !263}
!259 = !DILocalVariable(name: "lz", arg: 1, scope: !257, file: !1, line: 226, type: !249)
!260 = !DILocalVariable(name: "allocator", arg: 2, scope: !257, file: !1, line: 226, type: !123)
!261 = !DILocalVariable(name: "opt", arg: 3, scope: !257, file: !1, line: 227, type: !109)
!262 = !DILocalVariable(name: "lz_options", arg: 4, scope: !257, file: !1, line: 227, type: !250)
!263 = !DILocalVariable(name: "options", scope: !257, file: !1, line: 240, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!266 = !DILocation(line: 0, scope: !257)
!267 = !DILocation(line: 229, column: 10, scope: !268)
!268 = distinct !DILexicalBlock(scope: !257, file: !1, line: 229, column: 6)
!269 = !DILocation(line: 229, column: 16, scope: !268)
!270 = !DILocation(line: 229, column: 6, scope: !257)
!271 = !DILocation(line: 230, column: 15, scope: !272)
!272 = distinct !DILexicalBlock(scope: !268, file: !1, line: 229, column: 25)
!273 = !DILocation(line: 230, column: 13, scope: !272)
!274 = !DILocation(line: 231, column: 17, scope: !275)
!275 = distinct !DILexicalBlock(scope: !272, file: !1, line: 231, column: 7)
!276 = !DILocation(line: 231, column: 7, scope: !272)
!277 = !DILocation(line: 234, column: 7, scope: !272)
!278 = !DILocation(line: 234, column: 12, scope: !272)
!279 = !DILocation(line: 235, column: 7, scope: !272)
!280 = !DILocation(line: 235, column: 11, scope: !272)
!281 = !DILocation(line: 237, column: 38, scope: !272)
!282 = !DILocation(line: 237, column: 45, scope: !272)
!283 = !DILocation(line: 242, column: 29, scope: !257)
!284 = !DILocation(line: 238, column: 2, scope: !272)
!285 = !DILocation(line: 242, column: 46, scope: !257)
!286 = !DILocation(line: 243, column: 29, scope: !257)
!287 = !DILocation(line: 243, column: 37, scope: !257)
!288 = !DILocation(line: 243, column: 53, scope: !257)
!289 = !DILocation(line: 244, column: 70, scope: !257)
!290 = !DILocation(line: 244, column: 82, scope: !257)
!291 = !DILocation(line: 245, column: 4, scope: !257)
!292 = !DILocation(line: 245, column: 16, scope: !257)
!293 = !DILocation(line: 245, column: 33, scope: !257)
!294 = !DILocation(line: 244, column: 59, scope: !257)
!295 = !DILocation(line: 244, column: 29, scope: !257)
!296 = !DILocation(line: 244, column: 37, scope: !257)
!297 = !DILocation(line: 247, column: 62, scope: !257)
!298 = !DILocation(line: 247, column: 70, scope: !257)
!299 = !DILocation(line: 247, column: 9, scope: !257)
!300 = !DILocation(line: 249, column: 1, scope: !257)
!301 = distinct !DISubprogram(name: "lzma_lzma2_decoder_memusage", scope: !1, file: !1, line: 266, type: !302, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{!117, !109}
!304 = !{!305}
!305 = !DILocalVariable(name: "options", arg: 1, scope: !301, file: !1, line: 266, type: !109)
!306 = !DILocation(line: 0, scope: !301)
!307 = !DILocation(line: 269, column: 6, scope: !301)
!308 = !DILocation(line: 269, column: 4, scope: !301)
!309 = !DILocation(line: 268, column: 2, scope: !301)
!310 = !DISubprogram(name: "lzma_lzma_decoder_memusage_nocheck", scope: !311, file: !311, line: 48, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!311 = !DIFile(filename: "liblzma/lzma/lzma_decoder.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "0caa14a517fbe6eb5d1a0f4dac3f4c24")
