; ModuleID = 'liblzma/simple/ia64.c'
source_filename = "liblzma/simple/ia64.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_simple_ia64_encoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters) local_unnamed_addr #0 !dbg !99 {
entry:
    #dbg_value(ptr %next, !183, !DIExpression(), !186)
    #dbg_value(ptr %allocator, !184, !DIExpression(), !186)
    #dbg_value(ptr %filters, !185, !DIExpression(), !186)
    #dbg_value(ptr %next, !187, !DIExpression(), !195)
    #dbg_value(ptr %allocator, !192, !DIExpression(), !195)
    #dbg_value(ptr %filters, !193, !DIExpression(), !195)
    #dbg_value(i1 true, !194, !DIExpression(DW_OP_LLVM_convert, 1, DW_ATE_unsigned, DW_OP_LLVM_convert, 8, DW_ATE_unsigned, DW_OP_stack_value), !195)
  %call.i = tail call i32 @lzma_simple_coder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters, ptr noundef nonnull @ia64_code, i64 noundef 0, i64 noundef 16, i32 noundef 16, i1 noundef zeroext true) #3, !dbg !197
  ret i32 %call.i, !dbg !198
}

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_simple_ia64_decoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters) local_unnamed_addr #0 !dbg !199 {
entry:
    #dbg_value(ptr %next, !201, !DIExpression(), !204)
    #dbg_value(ptr %allocator, !202, !DIExpression(), !204)

!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !34, line: 24, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !36, line: 38, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !{!44}
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "BRANCH_TABLE", scope: !46, file: !1, line: 22, type: !88, isLocal: true, isDefinition: true)
!46 = distinct !DISubprogram(name: "ia64_code", scope: !1, file: !1, line: 18, type: !47, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !57)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !51, !38, !55, !56, !49}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 18, baseType: !37)
!50 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_simple", file: !53, line: 19, baseType: !54)
!53 = !DIFile(filename: "liblzma/simple/simple_private.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "2921a659cca72849047c4661dc5d5b7e")
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_simple_s", file: !53, line: 19, flags: DIFlagFwdDecl)
!55 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !69, !70, !71, !73, !77, !78, !79, !81, !82, !85, !86}
!58 = !DILocalVariable(name: "simple", arg: 1, scope: !46, file: !1, line: 18, type: !51)
!59 = !DILocalVariable(name: "now_pos", arg: 2, scope: !46, file: !1, line: 19, type: !38)
!60 = !DILocalVariable(name: "is_encoder", arg: 3, scope: !46, file: !1, line: 19, type: !55)
!61 = !DILocalVariable(name: "buffer", arg: 4, scope: !46, file: !1, line: 20, type: !56)
!62 = !DILocalVariable(name: "size", arg: 5, scope: !46, file: !1, line: 20, type: !49)
!63 = !DILocalVariable(name: "i", scope: !46, file: !1, line: 29, type: !49)
!64 = !DILocalVariable(name: "instr_template", scope: !65, file: !1, line: 31, type: !68)
!65 = distinct !DILexicalBlock(scope: !66, file: !1, line: 30, column: 39)
!66 = distinct !DILexicalBlock(scope: !67, file: !1, line: 30, column: 2)
!67 = distinct !DILexicalBlock(scope: !46, file: !1, line: 30, column: 2)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!69 = !DILocalVariable(name: "mask", scope: !65, file: !1, line: 32, type: !68)
!70 = !DILocalVariable(name: "bit_pos", scope: !65, file: !1, line: 33, type: !38)
!71 = !DILocalVariable(name: "slot", scope: !72, file: !1, line: 35, type: !49)
!72 = distinct !DILexicalBlock(scope: !65, file: !1, line: 35, column: 3)
!73 = !DILocalVariable(name: "byte_pos", scope: !74, file: !1, line: 39, type: !76)
!74 = distinct !DILexicalBlock(scope: !75, file: !1, line: 35, column: 58)
!75 = distinct !DILexicalBlock(scope: !72, file: !1, line: 35, column: 3)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!77 = !DILocalVariable(name: "bit_res", scope: !74, file: !1, line: 40, type: !68)
!78 = !DILocalVariable(name: "instruction", scope: !74, file: !1, line: 41, type: !33)
!79 = !DILocalVariable(name: "j", scope: !80, file: !1, line: 43, type: !49)
!80 = distinct !DILexicalBlock(scope: !74, file: !1, line: 43, column: 4)
!81 = !DILocalVariable(name: "inst_norm", scope: !74, file: !1, line: 48, type: !33)
!82 = !DILocalVariable(name: "src", scope: !83, file: !1, line: 54, type: !38)
!83 = distinct !DILexicalBlock(scope: !84, file: !1, line: 53, column: 8)
!84 = distinct !DILexicalBlock(scope: !74, file: !1, line: 50, column: 8)
!85 = !DILocalVariable(name: "dest", scope: !83, file: !1, line: 60, type: !38)
!86 = !DILocalVariable(name: "j", scope: !87, file: !1, line: 76, type: !49)
!87 = distinct !DILexicalBlock(scope: !83, file: !1, line: 76, column: 5)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 1024, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 32)
!91 = !{i32 7, !"Dwarf Version", i32 5}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{i32 1, !"wchar_size", i32 4}
!94 = !{i32 8, !"PIC Level", i32 2}
!95 = !{i32 7, !"PIE Level", i32 2}
!96 = !{i32 7, !"uwtable", i32 2}
!97 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!98 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!99 = distinct !DISubprogram(name: "lzma_simple_ia64_encoder_init", scope: !1, file: !1, line: 98, type: !100, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !182)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !103, !122, !172}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !105, line: 80, baseType: !106)
!105 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !105, line: 124, size: 512, elements: !107)
!107 = !{!108, !111, !114, !117, !143, !148, !155, !160}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !106, file: !105, line: 126, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !105, line: 78, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !106, file: !105, line: 130, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !113, line: 63, baseType: !33)
!113 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!114 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !106, file: !105, line: 136, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !116, line: 90, baseType: !37)
!116 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!117 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !106, file: !105, line: 139, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !105, line: 94, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!102, !109, !122, !136, !139, !49, !141, !139, !49, !142}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !125)
!125 = !{!126, !131, !135}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !124, file: !4, line: 376, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !130, !49, !49}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !124, file: !4, line: 390, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !130, !130}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !124, file: !4, line: 401, baseType: !130, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!139 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !106, file: !105, line: 144, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !105, line: 102, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !109, !122}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !106, file: !105, line: 148, baseType: !149, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !106, file: !105, line: 152, baseType: !156, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!102, !109, !159, !159, !33}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !106, file: !105, line: 157, baseType: !161, size: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!102, !109, !122, !164, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !167, line: 65, baseType: !168)
!167 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 43, size: 128, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !167, line: 54, baseType: !112, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !168, file: !167, line: 63, baseType: !130, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !105, line: 82, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !105, line: 109, size: 192, elements: !176)
!176 = !{!177, !178, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !175, file: !105, line: 112, baseType: !112, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !105, line: 116, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !105, line: 86, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !175, file: !105, line: 119, baseType: !130, size: 64, offset: 128)
!182 = !{!183, !184, !185}
!183 = !DILocalVariable(name: "next", arg: 1, scope: !99, file: !1, line: 98, type: !103)
!184 = !DILocalVariable(name: "allocator", arg: 2, scope: !99, file: !1, line: 99, type: !122)
!185 = !DILocalVariable(name: "filters", arg: 3, scope: !99, file: !1, line: 99, type: !172)
!186 = !DILocation(line: 0, scope: !99)
!187 = !DILocalVariable(name: "next", arg: 1, scope: !188, file: !1, line: 89, type: !103)
!188 = distinct !DISubprogram(name: "ia64_coder_init", scope: !1, file: !1, line: 89, type: !189, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{!102, !103, !122, !172, !55}
!191 = !{!187, !192, !193, !194}
!192 = !DILocalVariable(name: "allocator", arg: 2, scope: !188, file: !1, line: 89, type: !122)
!193 = !DILocalVariable(name: "filters", arg: 3, scope: !188, file: !1, line: 90, type: !172)
!194 = !DILocalVariable(name: "is_encoder", arg: 4, scope: !188, file: !1, line: 90, type: !55)
!195 = !DILocation(line: 0, scope: !188, inlinedAt: !196)
!196 = distinct !DILocation(line: 101, column: 9, scope: !99)
!197 = !DILocation(line: 92, column: 9, scope: !188, inlinedAt: !196)
!198 = !DILocation(line: 101, column: 2, scope: !99)
!199 = distinct !DISubprogram(name: "lzma_simple_ia64_decoder_init", scope: !1, file: !1, line: 106, type: !100, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !200)
!200 = !{!201, !202, !203}
!201 = !DILocalVariable(name: "next", arg: 1, scope: !199, file: !1, line: 106, type: !103)
!202 = !DILocalVariable(name: "allocator", arg: 2, scope: !199, file: !1, line: 107, type: !122)
!203 = !DILocalVariable(name: "filters", arg: 3, scope: !199, file: !1, line: 107, type: !172)
!204 = !DILocation(line: 0, scope: !199)
!205 = !DILocation(line: 0, scope: !188, inlinedAt: !206)
!206 = distinct !DILocation(line: 109, column: 9, scope: !199)
!207 = !DILocation(line: 92, column: 9, scope: !188, inlinedAt: !206)
!208 = !DILocation(line: 109, column: 2, scope: !199)
!209 = !DISubprogram(name: "lzma_simple_coder_init", scope: !53, file: !53, line: 68, type: !210, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{!102, !103, !122, !172, !212, !49, !49, !38, !55}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!213 = !DILocation(line: 0, scope: !46)
!214 = !DILocation(line: 30, column: 21, scope: !66)
!215 = !DILocation(line: 30, column: 2, scope: !67)
!216 = !DILocation(line: 31, column: 35, scope: !65)
!217 = !DILocation(line: 31, column: 45, scope: !65)
!218 = !DILocation(line: 32, column: 25, scope: !65)
!219 = !DILocation(line: 0, scope: !65)
!220 = !DILocation(line: 0, scope: !72)
!221 = !DILocation(line: 36, column: 29, scope: !222)
!222 = distinct !DILexicalBlock(scope: !74, file: !1, line: 36, column: 8)
!223 = !DILocation(line: 36, column: 8, scope: !74)
!224 = !DILocation(line: 0, scope: !74)
!225 = !DILocation(line: 0, scope: !80)
!226 = !DILocation(line: 44, column: 20, scope: !227)
!227 = distinct !DILexicalBlock(scope: !80, file: !1, line: 43, column: 4)
!228 = !DILocation(line: 45, column: 16, scope: !227)
!229 = !DILocation(line: 45, column: 7, scope: !227)
!230 = !DILocation(line: 46, column: 7, scope: !227)
!231 = !DILocation(line: 44, column: 17, scope: !227)
!232 = !DILocation(line: 51, column: 6, scope: !84)
!233 = !DILocation(line: 55, column: 18, scope: !83)
!234 = !DILocation(line: 54, column: 20, scope: !83)
!235 = !DILocation(line: 0, scope: !83)
!236 = !DILocation(line: 56, column: 36, scope: !83)
!237 = !DILocation(line: 56, column: 9, scope: !83)
!238 = !DILocation(line: 66, column: 10, scope: !83)
