; ModuleID = 'liblzma/lz/lz_decoder.c'
source_filename = "liblzma/lz/lz_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_lz_options = type { i64, ptr, i64 }

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_lz_decoder_init(ptr nocapture noundef %next, ptr noundef %allocator, ptr noundef %filters, ptr nocapture noundef readonly %lz_init) local_unnamed_addr #0 !dbg !171 {
entry:
  %lz_options = alloca %struct.lzma_lz_options, align 8, !DIAssignID !212
    #dbg_assign(i1 undef, !203, !DIExpression(), !212, ptr %lz_options, !DIExpression(), !213)
    #dbg_value(ptr %next, !199, !DIExpression(), !213)
    #dbg_value(ptr %allocator, !200, !DIExpression(), !213)
    #dbg_value(ptr %filters, !201, !DIExpression(), !213)
    #dbg_value(ptr %lz_init, !202, !DIExpression(), !213)
  %0 = load ptr, ptr %next, align 8, !dbg !214
  %cmp = icmp eq ptr %0, null, !dbg !216
  br i1 %cmp, label %if.then, label %if.end18, !dbg !217

if.then:                                          ; preds = %entry
  %call = tail call ptr @lzma_alloc(i64 noundef 4272, ptr noundef %allocator) #8, !dbg !218
  store ptr %call, ptr %next, align 8, !dbg !220
  %cmp3 = icmp eq ptr %call, null, !dbg !221
  br i1 %cmp3, label %return, label %if.end, !dbg !223

if.end:                                           ; preds = %if.then

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !32, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lz/lz_decoder.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "ed19f3c26d5c9c90f2e6eec526321cb7")
!2 = !{!3, !19, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!32 = !{!33, !34, !50, !91}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 23, size: 34176, elements: !36)
!36 = !{!37, !58, !110, !152, !153, !154}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !35, file: !1, line: 25, baseType: !38, size: 384)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_dict", file: !39, line: 44, baseType: !40)
!39 = !DIFile(filename: "liblzma/lz/lz_decoder.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "27344aa2da5754ad4a118fbd9137003b")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 20, size: 384, elements: !41)
!41 = !{!42, !49, !53, !54, !55, !56}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !40, file: !39, line: 24, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 24, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !47, line: 38, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !40, file: !39, line: 28, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 18, baseType: !52)
!51 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!52 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !40, file: !39, line: 33, baseType: !50, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !40, file: !39, line: 36, baseType: !50, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !40, file: !39, line: 39, baseType: !50, size: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "need_reset", scope: !40, file: !39, line: 42, baseType: !57, size: 8, offset: 320)
!57 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "lz", scope: !35, file: !1, line: 28, baseType: !59, size: 320, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_decoder", file: !39, line: 72, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 54, size: 320, elements: !61)
!61 = !{!62, !66, !79, !85, !93}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !60, file: !39, line: 56, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !65, line: 78, baseType: null)
!65 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !60, file: !39, line: 59, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !71, !72, !74, !77, !50}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!71 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!72 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!77 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !60, file: !39, line: 63, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !63, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "set_uncompressed", scope: !60, file: !39, line: 66, baseType: !86, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !63, !89}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !90, line: 63, baseType: !91)
!90 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !45, line: 27, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !47, line: 45, baseType: !52)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !60, file: !39, line: 70, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !63, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !100)
!100 = !{!101, !105, !109}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !99, file: !4, line: 376, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!33, !33, !50, !50}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !99, file: !4, line: 390, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !33, !33}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !99, file: !4, line: 401, baseType: !33, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !35, file: !1, line: 33, baseType: !111, size: 512, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !65, line: 80, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !65, line: 124, size: 512, elements: !113)
!113 = !{!114, !115, !116, !119, !126, !128, !135, !140}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !112, file: !65, line: 126, baseType: !63, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !65, line: 130, baseType: !89, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !112, file: !65, line: 136, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !118, line: 90, baseType: !52)
!118 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !112, file: !65, line: 139, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !65, line: 94, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!70, !63, !97, !74, !77, !50, !124, !77, !50, !125}
!124 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !112, file: !65, line: 144, baseType: !127, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !65, line: 102, baseType: !94)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !112, file: !65, line: 148, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !112, file: !65, line: 152, baseType: !136, size: 64, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!70, !63, !139, !139, !91}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !112, file: !65, line: 157, baseType: !141, size: 64, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!70, !63, !97, !144, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !147, line: 65, baseType: !148)
!147 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 43, size: 128, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !148, file: !147, line: 54, baseType: !89, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !148, file: !147, line: 63, baseType: !33, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next_finished", scope: !35, file: !1, line: 36, baseType: !57, size: 8, offset: 1216)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "this_finished", scope: !35, file: !1, line: 40, baseType: !57, size: 8, offset: 1224)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !35, file: !1, line: 50, baseType: !155, size: 32896, offset: 1280)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !35, file: !1, line: 46, size: 32896, elements: !156)
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !155, file: !1, line: 47, baseType: !50, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !155, file: !1, line: 48, baseType: !50, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !155, file: !1, line: 49, baseType: !160, size: 32768, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32768, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 4096)
!163 = !{i32 7, !"Dwarf Version", i32 5}
!164 = !{i32 2, !"Debug Info Version", i32 3}
!165 = !{i32 1, !"wchar_size", i32 4}
!166 = !{i32 8, !"PIC Level", i32 2}
!167 = !{i32 7, !"PIE Level", i32 2}
!168 = !{i32 7, !"uwtable", i32 2}
!169 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!170 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!171 = distinct !DISubprogram(name: "lzma_lz_decoder_init", scope: !1, file: !1, line: 207, type: !172, scopeLine: 212, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !198)
!172 = !DISubroutineType(types: !173)
!173 = !{!70, !174, !97, !175, !187}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !65, line: 82, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !65, line: 109, size: 192, elements: !179)
!179 = !{!180, !181, !186}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !178, file: !65, line: 112, baseType: !89, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !178, file: !65, line: 116, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !65, line: 86, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!70, !174, !97, !175}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !178, file: !65, line: 119, baseType: !33, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!70, !190, !97, !83, !191}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !39, line: 51, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 47, size: 192, elements: !194)
!194 = !{!195, !196, !197}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !193, file: !39, line: 48, baseType: !50, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !193, file: !39, line: 49, baseType: !75, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !193, file: !39, line: 50, baseType: !50, size: 64, offset: 128)
!198 = !{!199, !200, !201, !202, !203, !204, !207, !211}
!199 = !DILocalVariable(name: "next", arg: 1, scope: !171, file: !1, line: 207, type: !174)
!200 = !DILocalVariable(name: "allocator", arg: 2, scope: !171, file: !1, line: 207, type: !97)
!201 = !DILocalVariable(name: "filters", arg: 3, scope: !171, file: !1, line: 208, type: !175)
!202 = !DILocalVariable(name: "lz_init", arg: 4, scope: !171, file: !1, line: 209, type: !187)
!203 = !DILocalVariable(name: "lz_options", scope: !171, file: !1, line: 230, type: !192)
!204 = !DILocalVariable(name: "ret_", scope: !205, file: !1, line: 231, type: !206)
!205 = distinct !DILexicalBlock(scope: !171, file: !1, line: 231, column: 2)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!207 = !DILocalVariable(name: "copy_size", scope: !208, file: !1, line: 272, type: !210)
!208 = distinct !DILexicalBlock(scope: !209, file: !1, line: 269, column: 40)
!209 = distinct !DILexicalBlock(scope: !171, file: !1, line: 268, column: 6)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!211 = !DILocalVariable(name: "offset", scope: !208, file: !1, line: 274, type: !210)
!212 = distinct !DIAssignID()
!213 = !DILocation(line: 0, scope: !171)
!214 = !DILocation(line: 214, column: 12, scope: !215)
!215 = distinct !DILexicalBlock(scope: !171, file: !1, line: 214, column: 6)
!216 = !DILocation(line: 214, column: 18, scope: !215)
!217 = !DILocation(line: 214, column: 6, scope: !171)
!218 = !DILocation(line: 215, column: 17, scope: !219)
!219 = distinct !DILexicalBlock(scope: !215, file: !1, line: 214, column: 27)
!220 = !DILocation(line: 215, column: 15, scope: !219)
!221 = !DILocation(line: 216, column: 19, scope: !222)
!222 = distinct !DILexicalBlock(scope: !219, file: !1, line: 216, column: 7)
!223 = !DILocation(line: 216, column: 7, scope: !219)
!224 = !DILocation(line: 219, column: 9, scope: !219)
!225 = !DILocation(line: 219, column: 14, scope: !219)
!226 = !DILocation(line: 220, column: 9, scope: !219)
!227 = !DILocation(line: 220, column: 13, scope: !219)
!228 = !DILocation(line: 222, column: 49, scope: !219)
!229 = !DILocation(line: 223, column: 32, scope: !219)
!230 = !DILocation(line: 223, column: 45, scope: !219)
!231 = !DILocation(line: 223, column: 50, scope: !219)
!232 = !DILocation(line: 224, column: 32, scope: !219)
!233 = !DILocation(line: 224, column: 40, scope: !219)
!234 = !DILocation(line: 224, column: 45, scope: !219)
!235 = !DILocation(line: 225, column: 32, scope: !219)
!236 = !DILocation(line: 225, column: 40, scope: !219)
!237 = !DILocation(line: 225, column: 47, scope: !219)
!238 = !DILocation(line: 231, column: 2, scope: !205)
!239 = !DILocation(line: 226, column: 2, scope: !219)
!240 = !DILocation(line: 230, column: 2, scope: !171)
!241 = !DILocation(line: 0, scope: !205)
!242 = !DILocation(line: 231, column: 2, scope: !243)
!243 = distinct !DILexicalBlock(scope: !205, file: !1, line: 231, column: 2)
!244 = !DILocation(line: 239, column: 17, scope: !245)
!245 = distinct !DILexicalBlock(scope: !171, file: !1, line: 239, column: 6)
!246 = !DILocation(line: 239, column: 27, scope: !245)
!247 = !DILocation(line: 239, column: 6, scope: !171)
!248 = !DILocation(line: 249, column: 27, scope: !249)
!249 = distinct !DILexicalBlock(scope: !171, file: !1, line: 249, column: 6)
!250 = !DILocation(line: 249, column: 6, scope: !171)
!251 = !DILocation(line: 252, column: 47, scope: !171)
!252 = !DILocation(line: 252, column: 53, scope: !171)
!253 = !DILocation(line: 252, column: 23, scope: !171)
!254 = distinct !DIAssignID()
!255 = !DILocation(line: 255, column: 35, scope: !256)
!256 = distinct !DILexicalBlock(scope: !171, file: !1, line: 255, column: 6)
!257 = !DILocation(line: 255, column: 48, scope: !256)
!258 = !DILocation(line: 255, column: 53, scope: !256)
!259 = !DILocation(line: 255, column: 6, scope: !171)
