; ModuleID = 'liblzma/lz/lz_encoder_mf.c'
source_filename = "liblzma/lz/lz_encoder_mf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_match = type { i32, i32 }

@lzma_crc32_table = external local_unnamed_addr constant [8 x [256 x i32]], align 16

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_mf_find(ptr noundef %mf, ptr nocapture noundef writeonly %count_ptr, ptr noundef %matches) local_unnamed_addr #0 !dbg !24 {
entry:
    #dbg_value(ptr %mf, !74, !DIExpression(), !89)
    #dbg_value(ptr %count_ptr, !75, !DIExpression(), !89)
    #dbg_value(ptr %matches, !76, !DIExpression(), !89)
  %find = getelementptr inbounds i8, ptr %mf, i64 48, !dbg !90
  %0 = load ptr, ptr %find, align 8, !dbg !90
  %call = tail call i32 %0(ptr noundef %mf, ptr noundef %matches) #3, !dbg !91
    #dbg_value(i32 %call, !77, !DIExpression(), !89)
    #dbg_value(i32 0, !79, !DIExpression(), !89)
  %cmp.not = icmp eq i32 %call, 0, !dbg !92
  br i1 %cmp.not, label %if.end22, label %if.then, !dbg !93

if.then:                                          ; preds = %entry
  %sub = add i32 %call, -1, !dbg !94
  %idxprom = zext i32 %sub to i64, !dbg !95
  %arrayidx = getelementptr inbounds %struct.lzma_match, ptr %matches, i64 %idxprom, !dbg !95
  %1 = load i32, ptr %arrayidx, align 4, !dbg !96
    #dbg_value(i32 %1, !79, !DIExpression(), !89)

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lz/lz_encoder_mf.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5d460b327ab3f2eae21e0870eafddd6d")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!8 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!9 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!10 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 42, baseType: !5)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!16 = !{i32 7, !"Dwarf Version", i32 5}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{i32 8, !"PIC Level", i32 2}
!20 = !{i32 7, !"PIE Level", i32 2}
!21 = !{i32 7, !"uwtable", i32 2}
!22 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!23 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!24 = distinct !DISubprogram(name: "lzma_mf_find", scope: !1, file: !1, line: 22, type: !25, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !73)
!25 = !DISubroutineType(types: !26)
!26 = !{!12, !27, !61, !50}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !29, line: 28, baseType: !30)
!29 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "780f78e6e21a3ca52f57df68bfdc6f53")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !29, line: 29, size: 960, elements: !31)
!31 = !{!32, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !56, !60, !62, !63, !64, !65, !66, !67, !68, !69, !71, !72}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !30, file: !29, line: 35, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 38, baseType: !36)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 39, baseType: !12, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !30, file: !29, line: 45, baseType: !12, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !30, file: !29, line: 51, baseType: !12, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !30, file: !29, line: 58, baseType: !12, size: 32, offset: 160)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !30, file: !29, line: 63, baseType: !12, size: 32, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !30, file: !29, line: 67, baseType: !12, size: 32, offset: 224)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !30, file: !29, line: 75, baseType: !12, size: 32, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !30, file: !29, line: 80, baseType: !12, size: 32, offset: 288)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !30, file: !29, line: 84, baseType: !12, size: 32, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !30, file: !29, line: 92, baseType: !47, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!12, !27, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !29, line: 25, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 22, size: 64, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !52, file: !29, line: 23, baseType: !12, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !52, file: !29, line: 24, baseType: !12, size: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !30, file: !29, line: 97, baseType: !57, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !27, !12}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !30, file: !29, line: 99, baseType: !61, size: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !30, file: !29, line: 100, baseType: !61, size: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !30, file: !29, line: 101, baseType: !12, size: 32, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !30, file: !29, line: 102, baseType: !12, size: 32, offset: 672)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !30, file: !29, line: 103, baseType: !12, size: 32, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !30, file: !29, line: 106, baseType: !12, size: 32, offset: 736)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !30, file: !29, line: 109, baseType: !12, size: 32, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !30, file: !29, line: 114, baseType: !12, size: 32, offset: 800)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !30, file: !29, line: 119, baseType: !70, size: 32, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !3)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !30, file: !29, line: 122, baseType: !12, size: 32, offset: 864)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !30, file: !29, line: 125, baseType: !12, size: 32, offset: 896)
!73 = !{!74, !75, !76, !77, !79, !80, !85, !88}
!74 = !DILocalVariable(name: "mf", arg: 1, scope: !24, file: !1, line: 22, type: !27)
!75 = !DILocalVariable(name: "count_ptr", arg: 2, scope: !24, file: !1, line: 22, type: !61)
!76 = !DILocalVariable(name: "matches", arg: 3, scope: !24, file: !1, line: 22, type: !50)
!77 = !DILocalVariable(name: "count", scope: !24, file: !1, line: 27, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!79 = !DILocalVariable(name: "len_best", scope: !24, file: !1, line: 31, type: !12)
!80 = !DILocalVariable(name: "limit", scope: !81, file: !1, line: 56, type: !12)
!81 = distinct !DILexicalBlock(scope: !82, file: !1, line: 51, column: 33)
!82 = distinct !DILexicalBlock(scope: !83, file: !1, line: 51, column: 7)
!83 = distinct !DILexicalBlock(scope: !84, file: !1, line: 33, column: 17)
!84 = distinct !DILexicalBlock(scope: !24, file: !1, line: 33, column: 6)
!85 = !DILocalVariable(name: "p1", scope: !81, file: !1, line: 62, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!88 = !DILocalVariable(name: "p2", scope: !81, file: !1, line: 66, type: !86)
!89 = !DILocation(line: 0, scope: !24)
!90 = !DILocation(line: 27, column: 29, scope: !24)
!91 = !DILocation(line: 27, column: 25, scope: !24)
!92 = !DILocation(line: 33, column: 12, scope: !84)
!93 = !DILocation(line: 33, column: 6, scope: !24)
!94 = !DILocation(line: 47, column: 28, scope: !83)
!95 = !DILocation(line: 47, column: 14, scope: !83)
!96 = !DILocation(line: 47, column: 33, scope: !83)
!97 = !DILocation(line: 51, column: 23, scope: !82)
!98 = !DILocation(line: 51, column: 16, scope: !82)
!99 = !DILocation(line: 51, column: 7, scope: !83)
!100 = !DILocation(line: 56, column: 21, scope: !81)
!101 = !DILocation(line: 56, column: 34, scope: !81)
!102 = !DILocation(line: 0, scope: !81)
!103 = !DILocation(line: 57, column: 20, scope: !104)
!104 = distinct !DILexicalBlock(scope: !81, file: !1, line: 57, column: 8)
!105 = !DILocation(line: 57, column: 8, scope: !81)
!106 = !DILocation(line: 62, column: 24, scope: !81)
!107 = !DILocalVariable(name: "mf", arg: 1, scope: !108, file: !29, line: 222, type: !111)
!108 = distinct !DISubprogram(name: "mf_ptr", scope: !29, file: !29, line: 222, type: !109, scopeLine: 223, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !113)
!109 = !DISubroutineType(types: !110)
!110 = !{!86, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!113 = !{!107}
!114 = !DILocation(line: 0, scope: !108, inlinedAt: !115)
!115 = distinct !DILocation(line: 62, column: 24, scope: !81)
!116 = !DILocation(line: 224, column: 20, scope: !108, inlinedAt: !115)
!117 = !DILocation(line: 62, column: 35, scope: !81)
!118 = !DILocation(line: 66, column: 48, scope: !81)
!119 = !DILocation(line: 66, column: 27, scope: !81)
!120 = !DILocation(line: 66, column: 53, scope: !81)
!121 = !DILocation(line: 68, column: 20, scope: !81)
!122 = !DILocation(line: 69, column: 6, scope: !81)
!123 = !DILocation(line: 68, column: 4, scope: !81)
!124 = !DILocation(line: 69, column: 9, scope: !81)
!125 = !DILocation(line: 69, column: 25, scope: !81)
!126 = !DILocation(line: 69, column: 22, scope: !81)
!127 = !DILocation(line: 70, column: 5, scope: !81)
!128 = distinct !{!128, !123, !129}
!129 = !DILocation(line: 70, column: 7, scope: !81)
!130 = !DILocation(line: 74, column: 13, scope: !24)
!131 = !DILocation(line: 78, column: 8, scope: !24)
!132 = !DILocation(line: 78, column: 2, scope: !24)
!133 = !DILocation(line: 80, column: 2, scope: !24)
