; ModuleID = 'liblzma/lz/lz_encoder.c'
source_filename = "liblzma/lz/lz_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_mf_s = type { ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_lz_options = type { i64, i64, i64, i64, i64, i32, i32, ptr, i32 }

; Function Attrs: nounwind uwtable
define dso_local range(i64 -1, 21474836692) i64 @lzma_lz_encoder_memusage(ptr nocapture noundef readonly %lz_options) local_unnamed_addr #0 !dbg !193 {
entry:
  %mf = alloca %struct.lzma_mf_s, align 8, !DIAssignID !214
    #dbg_assign(i1 undef, !213, !DIExpression(), !214, ptr %mf, !DIExpression(), !215)
    #dbg_value(ptr %lz_options, !212, !DIExpression(), !215)
  call void @llvm.lifetime.start.p0(i64 120, ptr nonnull %mf) #7, !dbg !216
  call void @llvm.memset.p0.i64(ptr noundef nonnull align 8 dereferenceable(120) %mf, i8 0, i64 120, i1 false), !dbg !217, !DIAssignID !218
    #dbg_assign(i8 0, !213, !DIExpression(), !218, ptr %mf, !DIExpression(), !215)
  %call = call fastcc zeroext i1 @lz_encoder_prepare(ptr noundef nonnull %mf, ptr noundef null, ptr noundef %lz_options), !dbg !219
  br i1 %call, label %cleanup, label %if.end, !dbg !221

if.end:                                           ; preds = %entry
  %hash_size_sum = getelementptr inbounds i8, ptr %mf, i64 108, !dbg !222

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !40, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lz/lz_encoder.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "65da03540b3892812a4487523e184b85")
!2 = !{!3, !12, !19, !33}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "c59c540efa0aff44f03d71331089fff8")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!8 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!9 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!10 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!11 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 250, baseType: !5, size: 32, elements: !14)
!13 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!16 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!17 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!18 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 57, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!21 = !DIEnumerator(name: "LZMA_OK", value: 0)
!22 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!23 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!24 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!25 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!26 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!27 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!28 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!29 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!30 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!31 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!32 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 27, baseType: !5, size: 32, elements: !35)
!34 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!37 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!38 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!39 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!40 = !{!41, !42, !47, !116}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !43, line: 27, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !45, line: 45, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!46 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 24, size: 1728, elements: !49)
!49 = !{!50, !149, !150}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "lz", scope: !48, file: !1, line: 26, baseType: !51, size: 256)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_encoder", file: !52, line: 208, baseType: !53)
!52 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "780f78e6e21a3ca52f57df68bfdc6f53")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 192, size: 256, elements: !54)
!54 = !{!55, !59, !118, !135}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !53, file: !52, line: 194, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !58, line: 78, baseType: null)
!58 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!59 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !53, file: !52, line: 197, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64, !65, !113, !114, !116}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !13, line: 237, baseType: !19)
!64 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!65 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !52, line: 28, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !52, line: 29, size: 960, elements: !69)
!69 = !{!70, !75, !78, !79, !80, !81, !82, !83, !84, !85, !86, !96, !100, !102, !103, !104, !105, !106, !107, !108, !109, !111, !112}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !68, file: !52, line: 35, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !43, line: 24, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !45, line: 38, baseType: !74)
!74 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !68, file: !52, line: 39, baseType: !76, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 26, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !45, line: 42, baseType: !5)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !68, file: !52, line: 45, baseType: !76, size: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !68, file: !52, line: 51, baseType: !76, size: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !68, file: !52, line: 58, baseType: !76, size: 32, offset: 160)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !68, file: !52, line: 63, baseType: !76, size: 32, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !68, file: !52, line: 67, baseType: !76, size: 32, offset: 224)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !68, file: !52, line: 75, baseType: !76, size: 32, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !68, file: !52, line: 80, baseType: !76, size: 32, offset: 288)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !68, file: !52, line: 84, baseType: !76, size: 32, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !68, file: !52, line: 92, baseType: !87, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!76, !66, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !52, line: 25, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 22, size: 64, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !92, file: !52, line: 23, baseType: !76, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !92, file: !52, line: 24, baseType: !76, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !68, file: !52, line: 97, baseType: !97, size: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !66, !76}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !68, file: !52, line: 99, baseType: !101, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !68, file: !52, line: 100, baseType: !101, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !68, file: !52, line: 101, baseType: !76, size: 32, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !68, file: !52, line: 102, baseType: !76, size: 32, offset: 672)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !68, file: !52, line: 103, baseType: !76, size: 32, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !68, file: !52, line: 106, baseType: !76, size: 32, offset: 736)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !68, file: !52, line: 109, baseType: !76, size: 32, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !68, file: !52, line: 114, baseType: !76, size: 32, offset: 800)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !68, file: !52, line: 119, baseType: !110, size: 32, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !13, line: 322, baseType: !12)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !68, file: !52, line: 122, baseType: !76, size: 32, offset: 864)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !68, file: !52, line: 125, baseType: !76, size: 32, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !71)
!114 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !117, line: 18, baseType: !46)
!117 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!118 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !53, file: !52, line: 202, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !56, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !13, line: 403, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 341, size: 192, elements: !125)
!125 = !{!126, !130, !134}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !124, file: !13, line: 376, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!41, !41, !116, !116}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !124, file: !13, line: 390, baseType: !131, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !41, !41}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !124, file: !13, line: 401, baseType: !41, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "options_update", scope: !53, file: !52, line: 205, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!63, !56, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !142, line: 65, baseType: !143)
!142 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 43, size: 128, elements: !144)
!144 = !{!145, !148}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !143, file: !142, line: 54, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !147, line: 63, baseType: !42)
!147 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !143, file: !142, line: 63, baseType: !41, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !48, file: !1, line: 29, baseType: !67, size: 960, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !1, line: 32, baseType: !151, size: 512, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !58, line: 80, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !58, line: 124, size: 512, elements: !153)
!153 = !{!154, !155, !156, !159, !167, !169, !176, !181}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !152, file: !58, line: 126, baseType: !56, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !58, line: 130, baseType: !146, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !152, file: !58, line: 136, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !158, line: 90, baseType: !46)
!158 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !152, file: !58, line: 139, baseType: !160, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !58, line: 94, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!63, !56, !122, !164, !114, !116, !113, !114, !116, !110}
!164 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !152, file: !58, line: 144, baseType: !168, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !58, line: 102, baseType: !119)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !152, file: !58, line: 148, baseType: !170, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !34, line: 55, baseType: !33)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !152, file: !58, line: 152, baseType: !177, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!63, !56, !180, !180, !42}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !152, file: !58, line: 157, baseType: !182, size: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!63, !56, !122, !139, !139}
!185 = !{i32 7, !"Dwarf Version", i32 5}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{i32 1, !"wchar_size", i32 4}
!188 = !{i32 8, !"PIC Level", i32 2}
!189 = !{i32 7, !"PIE Level", i32 2}
!190 = !{i32 7, !"uwtable", i32 2}
!191 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!192 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!193 = distinct !DISubprogram(name: "lzma_lz_encoder_memusage", scope: !1, file: !1, line: 444, type: !194, scopeLine: 445, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !211)
!194 = !DISubroutineType(types: !195)
!195 = !{!42, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !52, line: 161, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 129, size: 512, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !208, !209, !210}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !199, file: !52, line: 132, baseType: !116, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !199, file: !52, line: 135, baseType: !116, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !199, file: !52, line: 139, baseType: !116, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !199, file: !52, line: 144, baseType: !116, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !199, file: !52, line: 148, baseType: !116, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !199, file: !52, line: 151, baseType: !207, size: 32, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !4, line: 111, baseType: !3)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !199, file: !52, line: 154, baseType: !76, size: 32, offset: 352)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !199, file: !52, line: 157, baseType: !165, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !199, file: !52, line: 159, baseType: !76, size: 32, offset: 448)
!211 = !{!212, !213}
!212 = !DILocalVariable(name: "lz_options", arg: 1, scope: !193, file: !1, line: 444, type: !196)
!213 = !DILocalVariable(name: "mf", scope: !193, file: !1, line: 447, type: !67)
!214 = distinct !DIAssignID()
!215 = !DILocation(line: 0, scope: !193)
!216 = !DILocation(line: 447, column: 2, scope: !193)
!217 = !DILocation(line: 447, column: 10, scope: !193)
!218 = distinct !DIAssignID()
!219 = !DILocation(line: 455, column: 6, scope: !220)
!220 = distinct !DILexicalBlock(scope: !193, file: !1, line: 455, column: 6)
!221 = !DILocation(line: 455, column: 6, scope: !193)
!222 = !DILocation(line: 459, column: 23, scope: !193)
!223 = !DILocation(line: 459, column: 42, scope: !193)
!224 = !DILocation(line: 459, column: 37, scope: !193)
!225 = !DILocation(line: 459, column: 9, scope: !193)
!226 = !DILocation(line: 460, column: 5, scope: !193)
!227 = !DILocation(line: 461, column: 41, scope: !193)
!228 = !DILocation(line: 461, column: 27, scope: !193)
!229 = !DILocation(line: 461, column: 25, scope: !193)
!230 = !DILocation(line: 461, column: 47, scope: !193)
!231 = !DILocation(line: 459, column: 2, scope: !193)
!232 = !DILocation(line: 462, column: 1, scope: !193)
!233 = distinct !DISubprogram(name: "lz_encoder_prepare", scope: !1, file: !1, line: 184, type: !234, scopeLine: 186, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !237)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !66, !122, !196}
!236 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!237 = !{!238, !239, !240, !241, !242, !244, !245, !247, !248, !249}
!238 = !DILocalVariable(name: "mf", arg: 1, scope: !233, file: !1, line: 184, type: !66)
!239 = !DILocalVariable(name: "allocator", arg: 2, scope: !233, file: !1, line: 184, type: !122)
!240 = !DILocalVariable(name: "lz_options", arg: 3, scope: !233, file: !1, line: 185, type: !196)
!241 = !DILocalVariable(name: "reserve", scope: !233, file: !1, line: 212, type: !76)
!242 = !DILocalVariable(name: "old_size", scope: !233, file: !1, line: 219, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!244 = !DILocalVariable(name: "hash_bytes", scope: !233, file: !1, line: 289, type: !243)
!245 = !DILocalVariable(name: "is_bt", scope: !233, file: !1, line: 293, type: !246)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!247 = !DILocalVariable(name: "hs", scope: !233, file: !1, line: 294, type: !76)
!248 = !DILocalVariable(name: "old_count", scope: !233, file: !1, line: 336, type: !243)
!249 = !DILocalVariable(name: "new_count", scope: !233, file: !1, line: 342, type: !243)
!250 = !DILocation(line: 0, scope: !233)
!251 = !DILocation(line: 190, column: 18, scope: !252)
!252 = distinct !DILexicalBlock(scope: !233, file: !1, line: 190, column: 6)
!253 = !DILocation(line: 191, column: 4, scope: !252)
!254 = !DILocation(line: 193, column: 19, scope: !252)
!255 = !DILocation(line: 193, column: 42, scope: !252)
!256 = !DILocation(line: 193, column: 28, scope: !252)
!257 = !DILocation(line: 190, column: 6, scope: !233)
!258 = !DILocation(line: 196, column: 37, scope: !233)
!259 = !DILocation(line: 196, column: 49, scope: !233)
!260 = !DILocation(line: 196, column: 25, scope: !233)
!261 = !DILocation(line: 196, column: 6, scope: !233)
!262 = !DILocation(line: 196, column: 23, scope: !233)
!263 = !DILocation(line: 198, column: 36, scope: !233)
!264 = !DILocation(line: 199, column: 18, scope: !233)
!265 = !DILocation(line: 199, column: 4, scope: !233)
!266 = !DILocation(line: 198, column: 24, scope: !233)
!267 = !DILocation(line: 198, column: 6, scope: !233)
!268 = !DILocation(line: 198, column: 22, scope: !233)
!269 = !DILocation(line: 212, column: 33, scope: !233)
!270 = !DILocation(line: 212, column: 43, scope: !233)
!271 = !DILocation(line: 212, column: 21, scope: !233)
!272 = !DILocation(line: 213, column: 14, scope: !273)
!273 = distinct !DILexicalBlock(scope: !233, file: !1, line: 213, column: 6)
!274 = !DILocation(line: 213, column: 6, scope: !233)
!275 = !DILocation(line: 216, column: 26, scope: !233)
!276 = !DILocation(line: 216, column: 52, scope: !233)
!277 = !DILocation(line: 216, column: 38, scope: !233)
!278 = !DILocation(line: 217, column: 18, scope: !233)
!279 = !DILocation(line: 217, column: 4, scope: !233)
!280 = !DILocation(line: 217, column: 30, scope: !233)
!281 = !DILocation(line: 216, column: 10, scope: !233)
!282 = !DILocation(line: 219, column: 32, scope: !233)
!283 = !DILocation(line: 220, column: 34, scope: !233)
!284 = !DILocation(line: 220, column: 44, scope: !233)
!285 = !DILocation(line: 220, column: 11, scope: !233)
!286 = !DILocation(line: 224, column: 10, scope: !287)
!287 = distinct !DILexicalBlock(scope: !233, file: !1, line: 224, column: 6)
!288 = !DILocation(line: 224, column: 17, scope: !287)
!289 = !DILocation(line: 224, column: 25, scope: !287)
!290 = !DILocation(line: 225, column: 3, scope: !291)
!291 = distinct !DILexicalBlock(scope: !287, file: !1, line: 224, column: 50)
!292 = !DILocation(line: 226, column: 14, scope: !291)
!293 = !DILocation(line: 227, column: 2, scope: !291)
!294 = !DILocation(line: 230, column: 34, scope: !233)
!295 = !DILocation(line: 230, column: 22, scope: !233)
!296 = !DILocation(line: 230, column: 6, scope: !233)
!297 = !DILocation(line: 230, column: 20, scope: !233)
!298 = !DILocation(line: 231, column: 29, scope: !233)
!299 = !DILocation(line: 231, column: 17, scope: !233)
!300 = !DILocation(line: 231, column: 6, scope: !233)
!301 = !DILocation(line: 231, column: 15, scope: !233)
!302 = !DILocation(line: 248, column: 32, scope: !233)
!303 = !DILocation(line: 248, column: 20, scope: !233)
!304 = !DILocation(line: 248, column: 6, scope: !233)
!305 = !DILocation(line: 248, column: 18, scope: !233)
!306 = !DILocation(line: 251, column: 22, scope: !233)
!307 = !DILocation(line: 251, column: 2, scope: !233)
!308 = !DILocation(line: 262, column: 3, scope: !309)
!309 = distinct !DILexicalBlock(scope: !233, file: !1, line: 251, column: 36)
!310 = !DILocation(line: 268, column: 3, scope: !309)
!311 = !DILocation(line: 274, column: 3, scope: !309)
!312 = !DILocation(line: 280, column: 3, scope: !309)
!313 = !DILocation(line: 0, scope: !309)
!314 = !DILocation(line: 289, column: 42, scope: !233)
!315 = !DILocation(line: 289, column: 55, scope: !233)
!316 = !DILocation(line: 290, column: 17, scope: !317)
!317 = distinct !DILexicalBlock(scope: !233, file: !1, line: 290, column: 6)
!318 = !DILocation(line: 290, column: 6, scope: !233)
!319 = !DILocation(line: 293, column: 47, scope: !233)
!320 = !DILocation(line: 293, column: 55, scope: !233)
!321 = !DILocation(line: 296, column: 17, scope: !322)
!322 = distinct !DILexicalBlock(scope: !233, file: !1, line: 296, column: 6)
!323 = !DILocation(line: 296, column: 6, scope: !233)
!324 = !DILocation(line: 301, column: 20, scope: !325)
!325 = distinct !DILexicalBlock(scope: !322, file: !1, line: 298, column: 9)
!326 = !DILocation(line: 301, column: 8, scope: !325)
!327 = !DILocation(line: 302, column: 12, scope: !325)
!328 = !DILocation(line: 302, column: 6, scope: !325)
!329 = !DILocation(line: 303, column: 12, scope: !325)
!330 = !DILocation(line: 303, column: 6, scope: !325)
!331 = !DILocation(line: 304, column: 12, scope: !325)
!332 = !DILocation(line: 304, column: 6, scope: !325)
!333 = !DILocation(line: 306, column: 6, scope: !325)
!334 = !DILocation(line: 307, column: 6, scope: !325)
!335 = !DILocation(line: 309, column: 10, scope: !336)
!336 = distinct !DILexicalBlock(scope: !325, file: !1, line: 309, column: 7)
!337 = !DILocation(line: 309, column: 7, scope: !325)
!338 = !DILocation(line: 310, column: 19, scope: !339)
!339 = distinct !DILexicalBlock(scope: !340, file: !1, line: 310, column: 8)
!340 = distinct !DILexicalBlock(scope: !336, file: !1, line: 309, column: 33)
!341 = !DILocation(line: 310, column: 8, scope: !340)
!342 = !DILocation(line: 0, scope: !322)
!343 = !DILocation(line: 317, column: 6, scope: !233)
!344 = !DILocation(line: 317, column: 16, scope: !233)
!345 = !DILocation(line: 320, column: 17, scope: !346)
!346 = distinct !DILexicalBlock(scope: !233, file: !1, line: 320, column: 6)
!347 = !DILocation(line: 320, column: 6, scope: !233)
!348 = !DILocation(line: 322, column: 17, scope: !349)
!349 = distinct !DILexicalBlock(scope: !233, file: !1, line: 322, column: 6)
!350 = !DILocation(line: 322, column: 6, scope: !233)
!351 = !DILocation(line: 336, column: 33, scope: !233)
!352 = !DILocation(line: 336, column: 53, scope: !233)
!353 = !DILocation(line: 336, column: 47, scope: !233)
!354 = !DILocation(line: 337, column: 20, scope: !233)
!355 = !DILocation(line: 339, column: 6, scope: !233)
!356 = !DILocation(line: 342, column: 47, scope: !233)
!357 = !DILocation(line: 346, column: 16, scope: !358)
!358 = distinct !DILexicalBlock(scope: !233, file: !1, line: 346, column: 6)
!359 = !DILocation(line: 346, column: 6, scope: !233)
!360 = !DILocation(line: 347, column: 17, scope: !361)
!361 = distinct !DILexicalBlock(scope: !358, file: !1, line: 346, column: 30)
!362 = !DILocation(line: 347, column: 3, scope: !361)
!363 = !DILocation(line: 348, column: 12, scope: !361)
!364 = !DILocation(line: 349, column: 2, scope: !361)
!365 = !DILocation(line: 352, column: 26, scope: !233)
!366 = !DILocation(line: 352, column: 6, scope: !233)
!367 = !DILocation(line: 352, column: 12, scope: !233)
!368 = !DILocation(line: 353, column: 16, scope: !369)
!369 = distinct !DILexicalBlock(scope: !233, file: !1, line: 353, column: 6)
!370 = !DILocation(line: 353, column: 6, scope: !233)
!371 = !DILocation(line: 0, scope: !372)
!372 = distinct !DILexicalBlock(scope: !373, file: !1, line: 354, column: 7)
!373 = distinct !DILexicalBlock(scope: !369, file: !1, line: 353, column: 22)
!374 = !DILocation(line: 361, column: 1, scope: !233)
!375 = distinct !DISubprogram(name: "lzma_lz_encoder_init", scope: !1, file: !1, line: 502, type: !376, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !398)
!376 = !DISubroutineType(types: !377)
!377 = !{!63, !378, !122, !379, !391}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !58, line: 82, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !58, line: 109, size: 192, elements: !383)
!383 = !{!384, !385, !390}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !382, file: !58, line: 112, baseType: !146, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !382, file: !58, line: 116, baseType: !386, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !58, line: 86, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!63, !378, !122, !379}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !382, file: !58, line: 119, baseType: !41, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!63, !394, !122, !395, !397}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!398 = !{!399, !400, !401, !402, !403, !404}
!399 = !DILocalVariable(name: "next", arg: 1, scope: !375, file: !1, line: 502, type: !378)
!400 = !DILocalVariable(name: "allocator", arg: 2, scope: !375, file: !1, line: 502, type: !122)
!401 = !DILocalVariable(name: "filters", arg: 3, scope: !375, file: !1, line: 503, type: !379)
!402 = !DILocalVariable(name: "lz_init", arg: 4, scope: !375, file: !1, line: 504, type: !391)
!403 = !DILocalVariable(name: "lz_options", scope: !375, file: !1, line: 536, type: !198)
!404 = !DILocalVariable(name: "ret_", scope: !405, file: !1, line: 537, type: !406)
!405 = distinct !DILexicalBlock(scope: !375, file: !1, line: 537, column: 2)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!407 = distinct !DIAssignID()
!408 = !DILocation(line: 0, scope: !375)
!409 = !DILocation(line: 514, column: 12, scope: !410)
!410 = distinct !DILexicalBlock(scope: !375, file: !1, line: 514, column: 6)
!411 = !DILocation(line: 514, column: 18, scope: !410)
!412 = !DILocation(line: 514, column: 6, scope: !375)
!413 = !DILocation(line: 515, column: 17, scope: !414)
!414 = distinct !DILexicalBlock(scope: !410, file: !1, line: 514, column: 27)
!415 = !DILocation(line: 515, column: 15, scope: !414)
!416 = !DILocation(line: 516, column: 19, scope: !417)
!417 = distinct !DILexicalBlock(scope: !414, file: !1, line: 516, column: 7)
!418 = !DILocation(line: 516, column: 7, scope: !414)
!419 = !DILocation(line: 519, column: 9, scope: !414)
!420 = !DILocation(line: 519, column: 14, scope: !414)
!421 = !DILocation(line: 520, column: 9, scope: !414)
!422 = !DILocation(line: 520, column: 13, scope: !414)
!423 = !DILocation(line: 521, column: 9, scope: !414)
!424 = !DILocation(line: 521, column: 16, scope: !414)
!425 = !DILocation(line: 523, column: 49, scope: !414)
!426 = !DILocation(line: 524, column: 32, scope: !414)
!427 = !DILocation(line: 524, column: 43, scope: !414)
!428 = !DILocation(line: 524, column: 48, scope: !414)
!429 = !DILocation(line: 525, column: 32, scope: !414)
!430 = !DILocation(line: 525, column: 43, scope: !414)
!431 = !DILocation(line: 525, column: 47, scope: !414)
!432 = !DILocation(line: 527, column: 32, scope: !414)
!433 = !DILocation(line: 527, column: 40, scope: !414)
!434 = !DILocation(line: 527, column: 50, scope: !414)
!435 = !DILocation(line: 528, column: 32, scope: !414)
!436 = !DILocation(line: 528, column: 43, scope: !414)
!437 = !DILocation(line: 528, column: 48, scope: !414)
!438 = !DILocation(line: 529, column: 32, scope: !414)
!439 = !DILocation(line: 529, column: 43, scope: !414)
!440 = !DILocation(line: 529, column: 57, scope: !414)
!441 = !DILocation(line: 530, column: 32, scope: !414)
!442 = !DILocation(line: 530, column: 43, scope: !414)
!443 = !DILocation(line: 530, column: 54, scope: !414)
!444 = !DILocation(line: 532, column: 32, scope: !414)
!445 = !DILocation(line: 532, column: 40, scope: !414)
!446 = !DILocation(line: 532, column: 47, scope: !414)
!447 = !DILocation(line: 537, column: 2, scope: !405)
!448 = !DILocation(line: 533, column: 2, scope: !414)
!449 = !DILocation(line: 536, column: 2, scope: !375)
!450 = !DILocation(line: 0, scope: !405)
!451 = !DILocation(line: 537, column: 2, scope: !452)
!452 = distinct !DILexicalBlock(scope: !405, file: !1, line: 537, column: 2)
!453 = !DILocation(line: 542, column: 55, scope: !454)
!454 = distinct !DILexicalBlock(scope: !375, file: !1, line: 542, column: 6)
