; ModuleID = 'liblzma/delta/delta_encoder.c'
source_filename = "liblzma/delta/delta_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind uwtable
define dso_local i32 @lzma_delta_encoder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters) local_unnamed_addr #0 !dbg !46 {
entry:
    #dbg_value(ptr %next, !140, !DIExpression(), !143)
    #dbg_value(ptr %allocator, !141, !DIExpression(), !143)
    #dbg_value(ptr %filters, !142, !DIExpression(), !143)
  %code = getelementptr inbounds i8, ptr %next, i64 24, !dbg !144
  store ptr @delta_encode, ptr %code, align 8, !dbg !145
  %update = getelementptr inbounds i8, ptr %next, i64 56, !dbg !146
  store ptr @delta_encoder_update, ptr %update, align 8, !dbg !147
  %call = tail call i32 @lzma_delta_coder_init(ptr noundef %next, ptr noundef %allocator, ptr noundef %filters) #4, !dbg !148
  ret i32 %call, !dbg !149
}

; Function Attrs: nounwind uwtable
define internal i32 @delta_encode(ptr nocapture noundef %pcoder, ptr noundef %allocator, ptr noalias noundef %in, ptr noalias noundef %in_pos, i64 noundef %in_size, ptr noalias noundef %out, ptr noalias noundef %out_pos, i64 noundef %out_size, i32 noundef %action) #0 !dbg !150 {
entry:
    #dbg_value(ptr %pcoder, !152, !DIExpression(), !182)
    #dbg_value(ptr %allocator, !153, !DIExpression(), !182)

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !36, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/delta/delta_encoder.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "71af779cb357b668e17f145629560449")
!2 = !{!3, !19, !25, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b07c3297e2bcc14bb477793d08325ee3")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 35, baseType: !5, size: 32, elements: !34)
!33 = !DIFile(filename: "liblzma/api/lzma/delta.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "397cde14a8f4a544385c9c6ecc7e0cc9")
!34 = !{!35}
!35 = !DIEnumerator(name: "LZMA_DELTA_TYPE_BYTE", value: 0)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !{i32 7, !"Dwarf Version", i32 5}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{i32 8, !"PIC Level", i32 2}
!42 = !{i32 7, !"PIE Level", i32 2}
!43 = !{i32 7, !"uwtable", i32 2}
!44 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!45 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!46 = distinct !DISubprogram(name: "lzma_delta_encoder_init", scope: !1, file: !1, line: 104, type: !47, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !139)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !50, !74, !129}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !52, line: 80, baseType: !53)
!52 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "b445e74fc76042ed64f7e1908fcc1934")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !52, line: 124, size: 512, elements: !54)
!54 = !{!55, !58, !66, !69, !100, !105, !112, !117}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !53, file: !52, line: 126, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !52, line: 78, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !53, file: !52, line: 130, baseType: !59, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !60, line: 63, baseType: !61)
!60 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !62, line: 27, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !64, line: 45, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!65 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !53, file: !52, line: 136, baseType: !67, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !68, line: 90, baseType: !65)
!68 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !53, file: !52, line: 139, baseType: !70, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !52, line: 94, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!49, !56, !74, !89, !95, !82, !97, !95, !82, !99}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !77)
!77 = !{!78, !84, !88}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !76, file: !4, line: 376, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!37, !37, !82, !82}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 18, baseType: !65)
!83 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !76, file: !4, line: 390, baseType: !85, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !37, !37}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !76, file: !4, line: 401, baseType: !37, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 24, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !64, line: 38, baseType: !94)
!94 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !53, file: !52, line: 144, baseType: !101, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !52, line: 102, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !56, !74}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !53, file: !52, line: 148, baseType: !106, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !53, file: !52, line: 152, baseType: !113, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!49, !56, !116, !116, !61}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !53, file: !52, line: 157, baseType: !118, size: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!49, !56, !74, !121, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !124, line: 65, baseType: !125)
!124 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 43, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !124, line: 54, baseType: !59, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !125, file: !124, line: 63, baseType: !37, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !52, line: 82, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !52, line: 109, size: 192, elements: !133)
!133 = !{!134, !135, !138}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !132, file: !52, line: 112, baseType: !59, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !132, file: !52, line: 116, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !52, line: 86, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !132, file: !52, line: 119, baseType: !37, size: 64, offset: 128)
!139 = !{!140, !141, !142}
!140 = !DILocalVariable(name: "next", arg: 1, scope: !46, file: !1, line: 104, type: !50)
!141 = !DILocalVariable(name: "allocator", arg: 2, scope: !46, file: !1, line: 104, type: !74)
!142 = !DILocalVariable(name: "filters", arg: 3, scope: !46, file: !1, line: 105, type: !129)
!143 = !DILocation(line: 0, scope: !46)
!144 = !DILocation(line: 107, column: 8, scope: !46)
!145 = !DILocation(line: 107, column: 13, scope: !46)
!146 = !DILocation(line: 108, column: 8, scope: !46)
!147 = !DILocation(line: 108, column: 15, scope: !46)
!148 = !DILocation(line: 109, column: 9, scope: !46)
!149 = !DILocation(line: 109, column: 2, scope: !46)
!150 = distinct !DISubprogram(name: "delta_encode", scope: !1, file: !1, line: 54, type: !72, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !151)
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !173, !174, !178, !179, !180}
!152 = !DILocalVariable(name: "pcoder", arg: 1, scope: !150, file: !1, line: 54, type: !56)
!153 = !DILocalVariable(name: "allocator", arg: 2, scope: !150, file: !1, line: 54, type: !74)
!154 = !DILocalVariable(name: "in", arg: 3, scope: !150, file: !1, line: 55, type: !89)
!155 = !DILocalVariable(name: "in_pos", arg: 4, scope: !150, file: !1, line: 55, type: !95)
!156 = !DILocalVariable(name: "in_size", arg: 5, scope: !150, file: !1, line: 56, type: !82)
!157 = !DILocalVariable(name: "out", arg: 6, scope: !150, file: !1, line: 56, type: !97)
!158 = !DILocalVariable(name: "out_pos", arg: 7, scope: !150, file: !1, line: 57, type: !95)
!159 = !DILocalVariable(name: "out_size", arg: 8, scope: !150, file: !1, line: 57, type: !82)
!160 = !DILocalVariable(name: "action", arg: 9, scope: !150, file: !1, line: 57, type: !99)
!161 = !DILocalVariable(name: "coder", scope: !150, file: !1, line: 59, type: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !164, line: 18, size: 2688, elements: !165)
!164 = !DIFile(filename: "liblzma/delta/delta_private.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "41e9aeb6bf08fbe16153633c0856b3a7")
!165 = !{!166, !167, !168, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !164, line: 20, baseType: !51, size: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !163, file: !164, line: 23, baseType: !82, size: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !163, file: !164, line: 26, baseType: !92, size: 8, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !163, file: !164, line: 29, baseType: !170, size: 2048, offset: 584)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 2048, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 256)
!173 = !DILocalVariable(name: "ret", scope: !150, file: !1, line: 60, type: !49)
!174 = !DILocalVariable(name: "in_avail", scope: !175, file: !1, line: 63, type: !177)
!175 = distinct !DILexicalBlock(scope: !176, file: !1, line: 62, column: 32)
!176 = distinct !DILexicalBlock(scope: !150, file: !1, line: 62, column: 6)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!178 = !DILocalVariable(name: "out_avail", scope: !175, file: !1, line: 64, type: !177)
!179 = !DILocalVariable(name: "size", scope: !175, file: !1, line: 65, type: !177)
!180 = !DILocalVariable(name: "out_start", scope: !181, file: !1, line: 76, type: !177)
!181 = distinct !DILexicalBlock(scope: !176, file: !1, line: 75, column: 9)
!182 = !DILocation(line: 0, scope: !150)
!183 = !DILocation(line: 62, column: 18, scope: !176)
!184 = !DILocation(line: 62, column: 23, scope: !176)
!185 = !DILocation(line: 62, column: 6, scope: !150)
!186 = !DILocation(line: 63, column: 37, scope: !175)
!187 = !DILocation(line: 63, column: 35, scope: !175)
!188 = !DILocation(line: 0, scope: !175)
!189 = !DILocation(line: 64, column: 39, scope: !175)
!190 = !DILocation(line: 64, column: 37, scope: !175)
!191 = !DILocation(line: 65, column: 23, scope: !175)
!192 = !DILocation(line: 67, column: 29, scope: !175)
!193 = !DILocation(line: 67, column: 44, scope: !175)
!194 = !{!195}
!195 = distinct !{!195, !196, !"copy_and_encode: %in"}
!196 = distinct !{!196, !"copy_and_encode"}
!197 = !DILocation(line: 67, column: 3, scope: !175)
!198 = !{!199}
!199 = distinct !{!199, !196, !"copy_and_encode: %out"}
!200 = !DILocalVariable(name: "pcoder", arg: 1, scope: !201, file: !1, line: 21, type: !56)
!201 = distinct !DISubprogram(name: "copy_and_encode", scope: !1, file: !1, line: 21, type: !202, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !204)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !56, !89, !97, !82}
!204 = !{!200, !205, !206, !207, !208, !209, !210, !212}
!205 = !DILocalVariable(name: "in", arg: 2, scope: !201, file: !1, line: 22, type: !89)
!206 = !DILocalVariable(name: "out", arg: 3, scope: !201, file: !1, line: 22, type: !97)
!207 = !DILocalVariable(name: "size", arg: 4, scope: !201, file: !1, line: 22, type: !82)
!208 = !DILocalVariable(name: "coder", scope: !201, file: !1, line: 24, type: !162)
!209 = !DILocalVariable(name: "distance", scope: !201, file: !1, line: 25, type: !177)
!210 = !DILocalVariable(name: "i", scope: !211, file: !1, line: 27, type: !82)
!211 = distinct !DILexicalBlock(scope: !201, file: !1, line: 27, column: 2)
!212 = !DILocalVariable(name: "tmp", scope: !213, file: !1, line: 28, type: !91)
!213 = distinct !DILexicalBlock(scope: !214, file: !1, line: 27, column: 36)
!214 = distinct !DILexicalBlock(scope: !211, file: !1, line: 27, column: 2)
!215 = !DILocation(line: 0, scope: !201, inlinedAt: !216)
!216 = distinct !DILocation(line: 67, column: 3, scope: !175)
!217 = !DILocation(line: 0, scope: !211, inlinedAt: !216)
!218 = !DILocation(line: 27, column: 23, scope: !214, inlinedAt: !216)
!219 = !DILocation(line: 27, column: 2, scope: !211, inlinedAt: !216)
!220 = !DILocation(line: 25, column: 33, scope: !201, inlinedAt: !216)
!221 = !{!195, !199}
!222 = !DILocation(line: 29, column: 29, scope: !213, inlinedAt: !216)
!223 = !DILocation(line: 28, column: 23, scope: !213, inlinedAt: !216)
!224 = !DILocation(line: 0, scope: !213, inlinedAt: !216)
!225 = !DILocation(line: 30, column: 41, scope: !213, inlinedAt: !216)
!226 = !DILocation(line: 30, column: 28, scope: !213, inlinedAt: !216)
!227 = !DILocation(line: 30, column: 3, scope: !213, inlinedAt: !216)
!228 = !DILocation(line: 30, column: 39, scope: !213, inlinedAt: !216)
!229 = !DILocation(line: 31, column: 18, scope: !213, inlinedAt: !216)
!230 = !DILocation(line: 31, column: 3, scope: !213, inlinedAt: !216)
!231 = !DILocation(line: 31, column: 10, scope: !213, inlinedAt: !216)
!232 = !DILocation(line: 27, column: 31, scope: !214, inlinedAt: !216)
!233 = distinct !{!233, !219, !234, !235, !236}
!234 = !DILocation(line: 32, column: 2, scope: !211, inlinedAt: !216)
!235 = !{!"llvm.loop.isvectorized", i32 1}
!236 = !{!"llvm.loop.unroll.runtime.disable"}
!237 = !DILocation(line: 29, column: 24, scope: !213, inlinedAt: !216)
!238 = distinct !{!238, !219, !234, !235}
!239 = !DILocation(line: 69, column: 11, scope: !175)
!240 = !DILocation(line: 70, column: 12, scope: !175)
!241 = !DILocation(line: 72, column: 16, scope: !175)
!242 = !DILocation(line: 72, column: 28, scope: !175)
!243 = !DILocation(line: 72, column: 39, scope: !175)
!244 = !DILocation(line: 72, column: 9, scope: !175)
!245 = !DILocation(line: 76, column: 28, scope: !181)
!246 = !DILocation(line: 0, scope: !181)
!247 = !DILocation(line: 78, column: 38, scope: !181)
!248 = !DILocation(line: 78, column: 9, scope: !181)
!249 = !DILocation(line: 82, column: 30, scope: !181)
!250 = !DILocation(line: 82, column: 43, scope: !181)
!251 = !DILocation(line: 82, column: 52, scope: !181)
!252 = !DILocalVariable(name: "pcoder", arg: 1, scope: !253, file: !1, line: 39, type: !56)
!253 = distinct !DISubprogram(name: "encode_in_place", scope: !1, file: !1, line: 39, type: !254, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !256)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !56, !98, !82}
!256 = !{!252, !257, !258, !259, !260, !261, !263}
!257 = !DILocalVariable(name: "buffer", arg: 2, scope: !253, file: !1, line: 39, type: !98)
!258 = !DILocalVariable(name: "size", arg: 3, scope: !253, file: !1, line: 39, type: !82)
!259 = !DILocalVariable(name: "coder", scope: !253, file: !1, line: 41, type: !162)
!260 = !DILocalVariable(name: "distance", scope: !253, file: !1, line: 42, type: !177)
!261 = !DILocalVariable(name: "i", scope: !262, file: !1, line: 44, type: !82)
!262 = distinct !DILexicalBlock(scope: !253, file: !1, line: 44, column: 2)
!263 = !DILocalVariable(name: "tmp", scope: !264, file: !1, line: 45, type: !91)
!264 = distinct !DILexicalBlock(scope: !265, file: !1, line: 44, column: 36)
!265 = distinct !DILexicalBlock(scope: !262, file: !1, line: 44, column: 2)
!266 = !DILocation(line: 0, scope: !253, inlinedAt: !267)
!267 = distinct !DILocation(line: 82, column: 3, scope: !181)
!268 = !DILocation(line: 0, scope: !262, inlinedAt: !267)
!269 = !DILocation(line: 44, column: 23, scope: !265, inlinedAt: !267)
!270 = !DILocation(line: 44, column: 2, scope: !262, inlinedAt: !267)
!271 = !DILocation(line: 42, column: 33, scope: !253, inlinedAt: !267)
!272 = !DILocation(line: 44, column: 31, scope: !265, inlinedAt: !267)
!273 = !DILocation(line: 46, column: 29, scope: !264, inlinedAt: !267)
!274 = !DILocation(line: 45, column: 23, scope: !264, inlinedAt: !267)
!275 = !DILocation(line: 47, column: 41, scope: !264, inlinedAt: !267)
!276 = !DILocation(line: 47, column: 3, scope: !264, inlinedAt: !267)
!277 = !DILocation(line: 47, column: 39, scope: !264, inlinedAt: !267)
!278 = !DILocation(line: 48, column: 13, scope: !264, inlinedAt: !267)
!279 = distinct !{!279, !270, !280, !235, !236}
!280 = !DILocation(line: 49, column: 2, scope: !262, inlinedAt: !267)
!281 = !DILocation(line: 46, column: 24, scope: !264, inlinedAt: !267)
!282 = !DILocation(line: 0, scope: !264, inlinedAt: !267)
!283 = !DILocation(line: 47, column: 28, scope: !264, inlinedAt: !267)
!284 = distinct !{!284, !270, !280, !235}
!285 = !DILocation(line: 85, column: 2, scope: !150)
!286 = !DILocation(line: 0, scope: !176)
!287 = distinct !DISubprogram(name: "delta_encoder_update", scope: !1, file: !1, line: 90, type: !119, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !288)
!288 = !{!289, !290, !291, !292, !293}
!289 = !DILocalVariable(name: "pcoder", arg: 1, scope: !287, file: !1, line: 90, type: !56)
!290 = !DILocalVariable(name: "allocator", arg: 2, scope: !287, file: !1, line: 90, type: !74)
!291 = !DILocalVariable(name: "filters_null", arg: 3, scope: !287, file: !1, line: 91, type: !121)
!292 = !DILocalVariable(name: "reversed_filters", arg: 4, scope: !287, file: !1, line: 92, type: !121)
!293 = !DILocalVariable(name: "coder", scope: !287, file: !1, line: 94, type: !162)
!294 = !DILocation(line: 0, scope: !287)
!295 = !DILocation(line: 99, column: 46, scope: !287)
!296 = !DILocation(line: 98, column: 9, scope: !287)
!297 = !DILocation(line: 98, column: 2, scope: !287)
!298 = !DISubprogram(name: "lzma_delta_coder_init", scope: !164, file: !164, line: 33, type: !47, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!299 = distinct !DISubprogram(name: "lzma_delta_props_encode", scope: !1, file: !1, line: 114, type: !300, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !304)
!300 = !DISubroutineType(types: !301)
!301 = !{!49, !302, !98}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!304 = !{!305, !306, !307}
!305 = !DILocalVariable(name: "options", arg: 1, scope: !299, file: !1, line: 114, type: !302)
!306 = !DILocalVariable(name: "out", arg: 2, scope: !299, file: !1, line: 114, type: !98)
!307 = !DILocalVariable(name: "opt", scope: !299, file: !1, line: 121, type: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_delta", file: !33, line: 77, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 45, size: 320, elements: !312)
!312 = !{!313, !315, !318, !319, !320, !321, !322, !323}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !33, line: 47, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_delta_type", file: !33, line: 37, baseType: !32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !311, file: !33, line: 59, baseType: !316, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 26, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 42, baseType: !5)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !311, file: !33, line: 70, baseType: !316, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !311, file: !33, line: 71, baseType: !316, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !311, file: !33, line: 72, baseType: !316, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !311, file: !33, line: 73, baseType: !316, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !311, file: !33, line: 74, baseType: !37, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !311, file: !33, line: 75, baseType: !37, size: 64, offset: 256)
!324 = !DILocation(line: 0, scope: !299)
!325 = !DILocation(line: 118, column: 6, scope: !326)
!326 = distinct !DILexicalBlock(scope: !299, file: !1, line: 118, column: 6)
!327 = !DILocation(line: 118, column: 41, scope: !326)
!328 = !DILocation(line: 118, column: 6, scope: !299)
!329 = !DILocation(line: 122, column: 16, scope: !299)
!330 = !DILocation(line: 122, column: 11, scope: !299)
!331 = !DILocation(line: 122, column: 9, scope: !299)
!332 = !DILocation(line: 125, column: 1, scope: !299)
!333 = !DISubprogram(name: "lzma_delta_coder_memusage", scope: !334, file: !334, line: 18, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DIFile(filename: "liblzma/delta/delta_common.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "3f542936998671d34c377109cc510e6f")
!335 = !DISubroutineType(types: !336)
!336 = !{!61, !302}
!337 = !DISubprogram(name: "lzma_next_filter_update", scope: !52, file: !52, line: 231, type: !338, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!338 = !DISubroutineType(types: !339)
!339 = !{!49, !50, !74, !121}
