; ModuleID = 'xz/coder.c'
source_filename = "xz/coder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_filter = type { i64, ptr }
%struct.lzma_options_lzma = type { i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%union.io_buf = type { [1024 x i64] }
%struct.lzma_stream = type { ptr, i64, i64, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i32, i32 }

@opt_mode = dso_local local_unnamed_addr global i32 0, align 4, !dbg !0
@opt_format = dso_local local_unnamed_addr global i32 0, align 4, !dbg !89
@opt_auto_adjust = dso_local local_unnamed_addr global i8 1, align 1, !dbg !91
@check = internal unnamed_addr global i32 0, align 4, !dbg !224
@check_default = internal unnamed_addr global i1 false, align 1, !dbg !293
@preset_number = internal unnamed_addr global i32 6, align 4, !dbg !229
@filters_count = internal unnamed_addr global i32 0, align 4, !dbg !231
@.str = private unnamed_addr constant [34 x i8] c"Maximum number of filters is four\00", align 1, !dbg !94
@filters = internal global [5 x %struct.lzma_filter] zeroinitializer, align 16, !dbg !193
@coder_set_compression_settings.opt_lzma = internal global %struct.lzma_options_lzma zeroinitializer, align 8, !dbg !100

!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "exit_status_type", file: !56, line: 14, baseType: !7, size: 32, elements: !57)
!56 = !DIFile(filename: "xz/main.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "f54f82fff34a105635379e91892f4bd0")
!57 = !{!58, !59, !60}
!58 = !DIEnumerator(name: "E_SUCCESS", value: 0)
!59 = !DIEnumerator(name: "E_ERROR", value: 1)
!60 = !DIEnumerator(name: "E_WARNING", value: 2)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 57, baseType: !7, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!63 = !DIEnumerator(name: "LZMA_OK", value: 0)
!64 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!65 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!66 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!67 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!68 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!69 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!70 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!71 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!72 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!73 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!74 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 250, baseType: !7, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!78 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!79 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!80 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !84, line: 27, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !86, line: 45, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!87 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!88 = !{!0, !89, !91, !94, !100, !161, !166, !171, !176, !181, !183, !188, !193, !206, !224, !227, !229, !231, !233, !238, !278, !283, !291}
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "opt_format", scope: !2, file: !3, line: 25, type: !13, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "opt_auto_adjust", scope: !2, file: !3, line: 26, type: !93, isLocal: false, isDefinition: true)
!93 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !3, line: 99, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 272, elements: !98)
!97 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!98 = !{!99}
!99 = !DISubrange(count: 34)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "opt_lzma", scope: !102, file: !3, line: 129, type: !122, isLocal: true, isDefinition: true)
!102 = distinct !DISubprogram(name: "coder_set_compression_settings", scope: !3, file: !3, line: 126, type: !103, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !105)
!103 = !DISubroutineType(types: !104)
!104 = !{null}
!105 = !{!106, !111, !113, !114, !117, !120, !159}
!106 = !DILocalVariable(name: "i", scope: !107, file: !3, line: 170, type: !109)
!107 = distinct !DILexicalBlock(scope: !108, file: !3, line: 170, column: 3)
!108 = distinct !DILexicalBlock(scope: !102, file: !3, line: 169, column: 6)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 18, baseType: !87)
!110 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!111 = !DILocalVariable(name: "memory_limit", scope: !102, file: !3, line: 181, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!113 = !DILocalVariable(name: "memory_usage", scope: !102, file: !3, line: 182, type: !83)
!114 = !DILocalVariable(name: "decmem", scope: !115, file: !3, line: 195, type: !112)
!115 = distinct !DILexicalBlock(scope: !116, file: !3, line: 194, column: 33)
!116 = distinct !DILexicalBlock(scope: !102, file: !3, line: 194, column: 6)
!117 = !DILocalVariable(name: "i", scope: !118, file: !3, line: 214, type: !109)
!118 = distinct !DILexicalBlock(scope: !119, file: !3, line: 202, column: 35)
!119 = distinct !DILexicalBlock(scope: !102, file: !3, line: 202, column: 6)
!120 = !DILocalVariable(name: "opt", scope: !118, file: !3, line: 225, type: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !27, line: 399, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 185, size: 896, elements: !124)
!124 = !{!125, !128, !134, !135, !136, !137, !138, !140, !141, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !154, !155, !156, !157, !158}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !123, file: !27, line: 217, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !84, line: 26, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !86, line: 42, baseType: !7)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !123, file: !27, line: 240, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !84, line: 24, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !86, line: 38, baseType: !133)
!133 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !123, file: !27, line: 254, baseType: !126, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !123, file: !27, line: 281, baseType: !126, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !123, file: !27, line: 293, baseType: !126, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !123, file: !27, line: 316, baseType: !126, size: 32, offset: 224)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !123, file: !27, line: 322, baseType: !139, size: 32, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !27, line: 155, baseType: !26)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !123, file: !27, line: 342, baseType: !126, size: 32, offset: 288)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !123, file: !27, line: 345, baseType: !142, size: 32, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !27, line: 111, baseType: !31)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !123, file: !27, line: 375, baseType: !126, size: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !123, file: !27, line: 384, baseType: !126, size: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !123, file: !27, line: 385, baseType: !126, size: 32, offset: 416)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !123, file: !27, line: 386, baseType: !126, size: 32, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !123, file: !27, line: 387, baseType: !126, size: 32, offset: 480)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !123, file: !27, line: 388, baseType: !126, size: 32, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !123, file: !27, line: 389, baseType: !126, size: 32, offset: 544)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !123, file: !27, line: 390, baseType: !126, size: 32, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !123, file: !27, line: 391, baseType: !126, size: 32, offset: 608)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !123, file: !27, line: 392, baseType: !153, size: 32, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !39, line: 46, baseType: !38)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !123, file: !27, line: 393, baseType: !153, size: 32, offset: 672)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !123, file: !27, line: 394, baseType: !153, size: 32, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !123, file: !27, line: 395, baseType: !153, size: 32, offset: 736)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !123, file: !27, line: 396, baseType: !82, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !123, file: !27, line: 397, baseType: !82, size: 64, offset: 832)
!159 = !DILocalVariable(name: "orig_dict_size", scope: !118, file: !3, line: 226, type: !160)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !3, line: 139, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 344, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 43)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !3, line: 141, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 552, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 69)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !3, line: 164, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 384, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 48)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !3, line: 172, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 328, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 41)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !3, line: 189, type: !163, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !3, line: 197, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 336, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 42)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !3, line: 254, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 808, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 101)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "filters", scope: !2, file: !3, line: 33, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 640, elements: !204)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !197, line: 65, baseType: !198)
!197 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 43, size: 128, elements: !199)
!199 = !{!200, !203}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !197, line: 54, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !202, line: 63, baseType: !83)
!202 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !198, file: !197, line: 63, baseType: !82, size: 64, offset: 64)
!204 = !{!205}
!205 = !DISubrange(count: 5)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "in_buf", scope: !2, file: !3, line: 36, type: !208, isLocal: true, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_buf", file: !209, line: 28, baseType: !210)
!209 = !DIFile(filename: "xz/file_io.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "4b45406630bbddcbf05b6d0a795f1a7c")
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !209, line: 24, size: 65536, elements: !211)
!211 = !{!212, !216, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !210, file: !209, line: 25, baseType: !213, size: 65536)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 65536, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 8192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !210, file: !209, line: 26, baseType: !217, size: 65536)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 65536, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 2048)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !210, file: !209, line: 27, baseType: !221, size: 65536)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 65536, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 1024)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "check", scope: !2, file: !3, line: 46, type: !226, isLocal: true, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !20, line: 55, baseType: !19)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "check_default", scope: !2, file: !3, line: 49, type: !93, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "preset_number", scope: !2, file: !3, line: 43, type: !126, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "filters_count", scope: !2, file: !3, line: 40, type: !126, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !3, line: 118, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 464, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 58)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "strm", scope: !2, file: !3, line: 30, type: !240, isLocal: true, isDefinition: true)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !39, line: 490, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 453, size: 1088, elements: !242)
!242 = !{!243, !244, !245, !246, !248, !249, !250, !264, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !241, file: !39, line: 454, baseType: !129, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !241, file: !39, line: 455, baseType: !109, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !241, file: !39, line: 456, baseType: !83, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !241, file: !39, line: 458, baseType: !247, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !241, file: !39, line: 459, baseType: !109, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !241, file: !39, line: 460, baseType: !83, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !241, file: !39, line: 468, baseType: !251, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !39, line: 403, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 341, size: 192, elements: !254)
!254 = !{!255, !259, !263}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !253, file: !39, line: 376, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!82, !82, !109, !109}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !253, file: !39, line: 390, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !82, !82}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !253, file: !39, line: 401, baseType: !82, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !241, file: !39, line: 471, baseType: !265, size: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !39, line: 411, baseType: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !39, line: 411, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !241, file: !39, line: 479, baseType: !82, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !241, file: !39, line: 480, baseType: !82, size: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !241, file: !39, line: 481, baseType: !82, size: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !241, file: !39, line: 482, baseType: !82, size: 64, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !241, file: !39, line: 483, baseType: !83, size: 64, offset: 768)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !241, file: !39, line: 484, baseType: !83, size: 64, offset: 832)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !241, file: !39, line: 485, baseType: !109, size: 64, offset: 896)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !241, file: !39, line: 486, baseType: !109, size: 64, offset: 960)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !241, file: !39, line: 487, baseType: !153, size: 32, offset: 1024)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !241, file: !39, line: 488, baseType: !153, size: 32, offset: 1056)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !3, line: 454, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 56, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 7)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "magic", scope: !285, file: !3, line: 295, type: !288, isLocal: true, isDefinition: true)
!285 = distinct !DISubprogram(name: "is_format_xz", scope: !3, file: !3, line: 292, type: !286, scopeLine: 293, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!286 = !DISubroutineType(types: !287)
!287 = !{!93}
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 48, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 6)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "out_buf", scope: !2, file: !3, line: 37, type: !208, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!294 = !{i32 7, !"Dwarf Version", i32 5}
!295 = !{i32 2, !"Debug Info Version", i32 3}
!296 = !{i32 1, !"wchar_size", i32 4}
!297 = !{i32 8, !"PIC Level", i32 2}
!298 = !{i32 7, !"PIE Level", i32 2}
!299 = !{i32 7, !"uwtable", i32 2}
!300 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!301 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!302 = distinct !DISubprogram(name: "coder_set_check", scope: !3, file: !3, line: 53, type: !303, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !305)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !226}
!305 = !{!306}
!306 = !DILocalVariable(name: "new_check", arg: 1, scope: !302, file: !3, line: 53, type: !226)
!307 = !DILocation(line: 0, scope: !302)
!308 = !DILocation(line: 55, column: 8, scope: !302)
!309 = !DILocation(line: 56, column: 16, scope: !302)
!310 = !DILocation(line: 57, column: 2, scope: !302)
!311 = distinct !DISubprogram(name: "coder_set_preset", scope: !3, file: !3, line: 77, type: !312, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !126}
!314 = !{!315}
!315 = !DILocalVariable(name: "new_preset", arg: 1, scope: !311, file: !3, line: 77, type: !126)
!316 = !DILocation(line: 0, scope: !311)
!317 = !DILocation(line: 79, column: 16, scope: !311)
!318 = !DILocation(line: 80, column: 16, scope: !311)
!319 = !DILocation(line: 66, column: 23, scope: !320, inlinedAt: !321)
!320 = distinct !DISubprogram(name: "forget_filter_chain", scope: !3, file: !3, line: 62, type: !103, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!321 = distinct !DILocation(line: 81, column: 2, scope: !311)
!322 = !DILocation(line: 66, column: 2, scope: !320, inlinedAt: !321)
!323 = !DILocation(line: 67, column: 3, scope: !324, inlinedAt: !321)
!324 = distinct !DILexicalBlock(scope: !320, file: !3, line: 66, column: 28)
!325 = !DILocation(line: 68, column: 31, scope: !324, inlinedAt: !321)
!326 = !DILocation(line: 68, column: 3, scope: !324, inlinedAt: !321)
!327 = !DILocation(line: 69, column: 34, scope: !324, inlinedAt: !321)
!328 = distinct !{!328, !322, !329}
!329 = !DILocation(line: 70, column: 2, scope: !320, inlinedAt: !321)
!330 = !DILocation(line: 82, column: 2, scope: !311)
!331 = distinct !DISubprogram(name: "coder_set_extreme", scope: !3, file: !3, line: 87, type: !103, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!332 = !DILocation(line: 89, column: 16, scope: !331)
!333 = !DILocation(line: 66, column: 23, scope: !320, inlinedAt: !334)
!334 = distinct !DILocation(line: 90, column: 2, scope: !331)
!335 = !DILocation(line: 66, column: 2, scope: !320, inlinedAt: !334)
!336 = !DILocation(line: 67, column: 3, scope: !324, inlinedAt: !334)
!337 = !DILocation(line: 68, column: 31, scope: !324, inlinedAt: !334)
!338 = !DILocation(line: 68, column: 3, scope: !324, inlinedAt: !334)
!339 = !DILocation(line: 69, column: 34, scope: !324, inlinedAt: !334)
!340 = distinct !{!340, !335, !341}
!341 = !DILocation(line: 70, column: 2, scope: !320, inlinedAt: !334)
!342 = !DILocation(line: 91, column: 2, scope: !331)
!343 = distinct !DISubprogram(name: "coder_add_filter", scope: !3, file: !3, line: 96, type: !344, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !346)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !201, !82}
!346 = !{!347, !348}
!347 = !DILocalVariable(name: "id", arg: 1, scope: !343, file: !3, line: 96, type: !201)
!348 = !DILocalVariable(name: "options", arg: 2, scope: !343, file: !3, line: 96, type: !82)
!349 = !DILocation(line: 0, scope: !343)
!350 = !DILocation(line: 98, column: 6, scope: !351)
!351 = distinct !DILexicalBlock(scope: !343, file: !3, line: 98, column: 6)
!352 = !DILocation(line: 98, column: 20, scope: !351)
!353 = !DILocation(line: 98, column: 6, scope: !343)
!354 = !DILocation(line: 99, column: 3, scope: !351)
!355 = !DILocation(line: 101, column: 10, scope: !343)
!356 = !DILocation(line: 101, column: 2, scope: !343)
!357 = !DILocation(line: 101, column: 28, scope: !343)
!358 = !DILocation(line: 102, column: 25, scope: !343)
!359 = !DILocation(line: 102, column: 33, scope: !343)
!360 = !DILocation(line: 103, column: 2, scope: !343)
!361 = !DILocation(line: 109, column: 16, scope: !343)
!362 = !DILocation(line: 111, column: 2, scope: !343)
!363 = !DISubprogram(name: "message_fatal", scope: !43, file: !43, line: 70, type: !364, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !366, null}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!368 = !DILocation(line: 131, column: 6, scope: !369)
!369 = distinct !DILexicalBlock(scope: !102, file: !3, line: 131, column: 6)
!370 = !DILocation(line: 131, column: 20, scope: !369)
!371 = !DILocation(line: 162, column: 6, scope: !372)
!372 = distinct !DILexicalBlock(scope: !102, file: !3, line: 162, column: 6)
!373 = !DILocation(line: 131, column: 6, scope: !102)
!374 = !DILocation(line: 136, column: 18, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !3, line: 136, column: 7)
!376 = distinct !DILexicalBlock(scope: !369, file: !3, line: 131, column: 26)
!377 = !DILocation(line: 136, column: 7, scope: !376)
!378 = !DILocation(line: 139, column: 4, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !3, line: 136, column: 33)
!380 = !DILocation(line: 141, column: 4, scope: !379)
!381 = !DILocation(line: 144, column: 3, scope: !379)
!382 = !DILocation(line: 147, column: 35, scope: !383)
!383 = distinct !DILexicalBlock(scope: !376, file: !3, line: 147, column: 7)
!384 = !DILocation(line: 147, column: 7, scope: !383)
!385 = !DILocation(line: 147, column: 7, scope: !376)
!386 = !DILocation(line: 148, column: 4, scope: !383)
!387 = !DILocation(line: 151, column: 19, scope: !376)
!388 = !DILocation(line: 151, column: 30, scope: !376)
!389 = !DILocation(line: 151, column: 17, scope: !376)
!390 = !DILocation(line: 153, column: 22, scope: !376)
!391 = !DILocation(line: 154, column: 17, scope: !376)
!392 = !DILocation(line: 155, column: 2, scope: !376)
!393 = !DILocation(line: 158, column: 10, scope: !102)
!394 = !DILocation(line: 158, column: 2, scope: !102)
!395 = !DILocation(line: 158, column: 28, scope: !102)
!396 = !DILocation(line: 162, column: 17, scope: !372)
!397 = !DILocation(line: 162, column: 32, scope: !372)
!398 = !DILocation(line: 162, column: 50, scope: !372)
!399 = !DILocation(line: 163, column: 4, scope: !372)
!400 = !DILocation(line: 164, column: 3, scope: !372)
!401 = !DILocation(line: 169, column: 6, scope: !108)
!402 = !DILocation(line: 169, column: 17, scope: !108)
!403 = !DILocation(line: 0, scope: !107)
!404 = !DILocation(line: 169, column: 6, scope: !102)
!405 = !DILocation(line: 171, column: 8, scope: !406)
!406 = distinct !DILexicalBlock(scope: !407, file: !3, line: 171, column: 8)
!407 = distinct !DILexicalBlock(scope: !107, file: !3, line: 170, column: 3)
!408 = !DILocation(line: 171, column: 19, scope: !406)
!409 = !DILocation(line: 171, column: 22, scope: !406)
!410 = !DILocation(line: 171, column: 8, scope: !407)
!411 = !DILocation(line: 172, column: 5, scope: !406)
!412 = !DILocation(line: 170, column: 26, scope: !407)
!413 = !DILocation(line: 170, column: 41, scope: !407)
!414 = !DILocation(line: 170, column: 24, scope: !407)
!415 = !DILocation(line: 170, column: 3, scope: !107)
!416 = distinct !{!416, !415, !417}
!417 = !DILocation(line: 173, column: 29, scope: !107)
!418 = !DILocation(line: 176, column: 2, scope: !102)
!419 = !DILocation(line: 181, column: 54, scope: !102)
!420 = !DILocation(line: 181, column: 32, scope: !102)
!421 = !DILocation(line: 0, scope: !102)
!422 = !DILocation(line: 183, column: 6, scope: !423)
!423 = distinct !DILexicalBlock(scope: !102, file: !3, line: 183, column: 6)
!424 = !DILocation(line: 183, column: 15, scope: !423)
!425 = !DILocation(line: 183, column: 6, scope: !102)
!426 = !DILocation(line: 184, column: 18, scope: !423)
!427 = !DILocation(line: 184, column: 3, scope: !423)
!428 = !DILocation(line: 186, column: 18, scope: !423)
!429 = !DILocation(line: 0, scope: !423)
!430 = !DILocation(line: 188, column: 19, scope: !431)
!431 = distinct !DILexicalBlock(scope: !102, file: !3, line: 188, column: 6)
!432 = !DILocation(line: 188, column: 6, scope: !102)
!433 = !DILocation(line: 189, column: 3, scope: !431)
!434 = !DILocation(line: 193, column: 2, scope: !102)
!435 = !DILocation(line: 194, column: 6, scope: !116)
!436 = !DILocation(line: 194, column: 15, scope: !116)
!437 = !DILocation(line: 194, column: 6, scope: !102)
!438 = !DILocation(line: 195, column: 27, scope: !115)
!439 = !DILocation(line: 0, scope: !115)
!440 = !DILocation(line: 196, column: 14, scope: !441)
!441 = distinct !DILexicalBlock(scope: !115, file: !3, line: 196, column: 7)
!442 = !DILocation(line: 196, column: 7, scope: !115)
!443 = !DILocation(line: 199, column: 7, scope: !441)
!444 = !DILocation(line: 198, column: 28, scope: !441)
!445 = !DILocation(line: 197, column: 4, scope: !441)
!446 = !DILocation(line: 202, column: 19, scope: !119)
!447 = !DILocation(line: 202, column: 6, scope: !102)
!448 = !DILocation(line: 206, column: 8, scope: !449)
!449 = distinct !DILexicalBlock(scope: !118, file: !3, line: 206, column: 7)
!450 = !{i8 0, i8 2}
!451 = !{}
!452 = !DILocation(line: 206, column: 24, scope: !449)
!453 = !DILocalVariable(name: "memory_usage", arg: 1, scope: !454, file: !3, line: 116, type: !83)
!454 = distinct !DISubprogram(name: "memlimit_too_small", scope: !3, file: !3, line: 116, type: !455, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !83}
!457 = !{!453}
!458 = !DILocation(line: 0, scope: !454, inlinedAt: !459)
!459 = distinct !DILocation(line: 207, column: 4, scope: !449)
!460 = !DILocation(line: 118, column: 2, scope: !454, inlinedAt: !459)
!461 = !DILocation(line: 120, column: 2, scope: !454, inlinedAt: !459)
!462 = !DILocation(line: 121, column: 2, scope: !454, inlinedAt: !459)
!463 = !DILocation(line: 207, column: 4, scope: !449)
!464 = !DILocation(line: 215, column: 3, scope: !118)
!465 = !DILocation(line: 0, scope: !118)
!466 = !DILocation(line: 215, column: 10, scope: !118)
!467 = !DILocation(line: 215, column: 21, scope: !118)
!468 = !DILocation(line: 216, column: 5, scope: !118)
!469 = !DILocation(line: 0, scope: !454, inlinedAt: !470)
!470 = distinct !DILocation(line: 218, column: 5, scope: !471)
!471 = distinct !DILexicalBlock(scope: !472, file: !3, line: 217, column: 8)
!472 = distinct !DILexicalBlock(scope: !118, file: !3, line: 216, column: 44)
!473 = !DILocation(line: 118, column: 2, scope: !454, inlinedAt: !470)
!474 = !DILocation(line: 120, column: 2, scope: !454, inlinedAt: !470)
!475 = !DILocation(line: 121, column: 2, scope: !454, inlinedAt: !470)
!476 = !DILocation(line: 218, column: 5, scope: !471)
!477 = !DILocation(line: 220, column: 4, scope: !472)
!478 = distinct !{!478, !464, !479}
!479 = !DILocation(line: 221, column: 3, scope: !118)
!480 = !DILocation(line: 225, column: 39, scope: !118)
!481 = !DILocation(line: 226, column: 40, scope: !118)
!482 = !DILocation(line: 227, column: 18, scope: !118)
!483 = !DILocation(line: 228, column: 3, scope: !118)
!484 = !DILocation(line: 236, column: 23, scope: !485)
!485 = distinct !DILexicalBlock(scope: !486, file: !3, line: 236, column: 8)
!486 = distinct !DILexicalBlock(scope: !118, file: !3, line: 228, column: 16)
!487 = !DILocation(line: 236, column: 8, scope: !486)
!488 = !DILocation(line: 0, scope: !454, inlinedAt: !489)
!489 = distinct !DILocation(line: 237, column: 5, scope: !485)
!490 = !DILocation(line: 118, column: 2, scope: !454, inlinedAt: !489)
!491 = !DILocation(line: 120, column: 2, scope: !454, inlinedAt: !489)
!492 = !DILocation(line: 121, column: 2, scope: !454, inlinedAt: !489)
!493 = !DILocation(line: 237, column: 5, scope: !485)
!494 = !DILocation(line: 239, column: 19, scope: !486)
!495 = !DILocation(line: 240, column: 21, scope: !496)
!496 = distinct !DILexicalBlock(scope: !486, file: !3, line: 240, column: 8)
!497 = !DILocation(line: 240, column: 8, scope: !486)
!498 = !DILocation(line: 241, column: 5, scope: !496)
!499 = !DILocation(line: 244, column: 21, scope: !500)
!500 = distinct !DILexicalBlock(scope: !486, file: !3, line: 244, column: 8)
!501 = !DILocation(line: 244, column: 8, scope: !486)
!502 = !DILocation(line: 250, column: 19, scope: !486)
!503 = distinct !{!503, !483, !504}
!504 = !DILocation(line: 251, column: 3, scope: !118)
!505 = !DILocation(line: 257, column: 16, scope: !118)
!506 = !DILocation(line: 257, column: 19, scope: !118)
!507 = !DILocation(line: 257, column: 5, scope: !118)
!508 = !DILocation(line: 259, column: 34, scope: !118)
!509 = !DILocation(line: 259, column: 19, scope: !118)
!510 = !DILocation(line: 259, column: 5, scope: !118)
!511 = !DILocation(line: 260, column: 24, scope: !118)
!512 = !DILocation(line: 260, column: 34, scope: !118)
!513 = !DILocation(line: 260, column: 19, scope: !118)
!514 = !DILocation(line: 260, column: 5, scope: !118)
!515 = !DILocation(line: 261, column: 19, scope: !118)
!516 = !DILocation(line: 261, column: 5, scope: !118)
!517 = !DILocation(line: 254, column: 3, scope: !118)
!518 = !DILocation(line: 263, column: 2, scope: !118)
!519 = !DILocation(line: 277, column: 6, scope: !520)
!520 = distinct !DILexicalBlock(scope: !102, file: !3, line: 277, column: 6)
!521 = !DILocation(line: 277, column: 6, scope: !102)
!522 = !DILocation(line: 281, column: 9, scope: !523)
!523 = distinct !DILexicalBlock(scope: !520, file: !3, line: 277, column: 21)
!524 = !DILocation(line: 282, column: 8, scope: !525)
!525 = distinct !DILexicalBlock(scope: !523, file: !3, line: 282, column: 7)
!526 = !DILocation(line: 282, column: 7, scope: !523)
!527 = !DILocation(line: 283, column: 10, scope: !525)
!528 = !DILocation(line: 283, column: 4, scope: !525)
!529 = !DILocation(line: 287, column: 1, scope: !102)
!530 = !DISubprogram(name: "message", scope: !43, file: !43, line: 47, type: !531, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !42, !366, null}
!533 = !DISubprogram(name: "lzma_lzma_preset", scope: !27, file: !27, line: 419, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!534 = !DISubroutineType(types: !535)
!535 = !{!536, !121, !126}
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !39, line: 29, baseType: !133)
!537 = !DISubprogram(name: "message_bug", scope: !43, file: !43, line: 77, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!538 = !DISubprogram(name: "message_filters_show", scope: !43, file: !43, line: 110, type: !539, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !42, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!543 = !DISubprogram(name: "hardware_memlimit_get", scope: !544, file: !544, line: 35, type: !545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!544 = !DIFile(filename: "xz/hardware.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "7ed07700a75387ea633d6b4d26a671b7")
!545 = !DISubroutineType(types: !546)
!546 = !{!83, !5}
!547 = !DISubprogram(name: "lzma_raw_encoder_memusage", scope: !197, file: !197, line: 138, type: !548, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!548 = !DISubroutineType(types: !549)
!549 = !{!83, !541}
!550 = !DISubprogram(name: "lzma_raw_decoder_memusage", scope: !197, file: !197, line: 157, type: !548, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!551 = !DISubprogram(name: "message_mem_needed", scope: !43, file: !43, line: 90, type: !552, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !42, !83}
!554 = !DISubprogram(name: "uint64_to_str", scope: !555, file: !555, line: 61, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!555 = !DIFile(filename: "xz/util.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "36136e1fc433f9fd7b2b728f8484a043")
!556 = !DISubroutineType(types: !557)
!557 = !{!366, !83, !126}
!558 = !DISubprogram(name: "round_up_to_mib", scope: !555, file: !555, line: 48, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!559 = !DISubroutineType(types: !560)
!560 = !{!83, !83}
!561 = !DISubprogram(name: "lzma_check_is_supported", scope: !20, file: !20, line: 81, type: !562, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!562 = !DISubroutineType(types: !563)
!563 = !{!536, !226}
!564 = distinct !DISubprogram(name: "coder_run", scope: !3, file: !3, line: 620, type: !565, scopeLine: 621, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !366}
!567 = !{!568, !569, !587, !588, !592}
!568 = !DILocalVariable(name: "filename", arg: 1, scope: !564, file: !3, line: 620, type: !366)
!569 = !DILocalVariable(name: "pair", scope: !564, file: !3, line: 626, type: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "file_pair", file: !209, line: 66, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 31, size: 320, elements: !573)
!573 = !{!574, !575, !577, !579, !580, !581, !582}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "src_name", scope: !572, file: !209, line: 34, baseType: !366, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dest_name", scope: !572, file: !209, line: 38, baseType: !576, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "src_fd", scope: !572, file: !209, line: 41, baseType: !578, size: 32, offset: 128)
!578 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dest_fd", scope: !572, file: !209, line: 44, baseType: !578, size: 32, offset: 160)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "src_eof", scope: !572, file: !209, line: 47, baseType: !93, size: 8, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dest_try_sparse", scope: !572, file: !209, line: 51, baseType: !93, size: 8, offset: 200)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dest_pending_sparse", scope: !572, file: !209, line: 56, baseType: !583, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !584, line: 56, baseType: !585)
!584 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !86, line: 152, baseType: !586)
!586 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!587 = !DILocalVariable(name: "success", scope: !564, file: !3, line: 631, type: !93)
!588 = !DILocalVariable(name: "init_ret", scope: !589, file: !3, line: 645, type: !591)
!589 = distinct !DILexicalBlock(scope: !590, file: !3, line: 638, column: 33)
!590 = distinct !DILexicalBlock(scope: !564, file: !3, line: 638, column: 6)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!592 = !DILocalVariable(name: "in_size", scope: !593, file: !3, line: 652, type: !112)
!593 = distinct !DILexicalBlock(scope: !594, file: !3, line: 650, column: 54)
!594 = distinct !DILexicalBlock(scope: !595, file: !3, line: 650, column: 8)
!595 = distinct !DILexicalBlock(scope: !596, file: !3, line: 647, column: 52)
!596 = distinct !DILexicalBlock(scope: !589, file: !3, line: 647, column: 7)
!597 = !DILocation(line: 0, scope: !564)
!598 = !DILocation(line: 623, column: 2, scope: !564)
!599 = !DILocation(line: 626, column: 20, scope: !564)
!600 = !DILocation(line: 627, column: 11, scope: !601)
!601 = distinct !DILexicalBlock(scope: !564, file: !3, line: 627, column: 6)
!602 = !DILocation(line: 627, column: 6, scope: !564)
!603 = !DILocation(line: 635, column: 15, scope: !564)
!604 = !DILocation(line: 636, column: 18, scope: !564)
!605 = !DILocation(line: 636, column: 16, scope: !564)
!606 = !DILocation(line: 638, column: 20, scope: !590)
!607 = !DILocation(line: 638, column: 6, scope: !564)
!608 = !DILocalVariable(name: "pair", arg: 1, scope: !609, file: !3, line: 355, type: !570)
!609 = distinct !DISubprogram(name: "coder_init", scope: !3, file: !3, line: 355, type: !610, scopeLine: 356, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!50, !570}
!612 = !{!608, !613, !615, !618}
!613 = !DILocalVariable(name: "ret", scope: !609, file: !3, line: 357, type: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !39, line: 237, baseType: !61)
!615 = !DILocalVariable(name: "flags", scope: !616, file: !3, line: 379, type: !160)
!616 = distinct !DILexicalBlock(scope: !617, file: !3, line: 378, column: 9)
!617 = distinct !DILexicalBlock(scope: !609, file: !3, line: 359, column: 6)
!618 = !DILocalVariable(name: "init_format", scope: !616, file: !3, line: 384, type: !13)
!619 = !DILocation(line: 0, scope: !609, inlinedAt: !620)
!620 = distinct !DILocation(line: 645, column: 40, scope: !589)
!621 = !DILocation(line: 359, column: 6, scope: !617, inlinedAt: !620)
!622 = !DILocation(line: 359, column: 15, scope: !617, inlinedAt: !620)
!623 = !DILocation(line: 0, scope: !617, inlinedAt: !620)
!624 = !DILocation(line: 359, column: 6, scope: !609, inlinedAt: !620)
!625 = !DILocation(line: 360, column: 3, scope: !626, inlinedAt: !620)
!626 = distinct !DILexicalBlock(scope: !617, file: !3, line: 359, column: 33)
!627 = !DILocation(line: 367, column: 46, scope: !628, inlinedAt: !620)
!628 = distinct !DILexicalBlock(scope: !626, file: !3, line: 360, column: 23)
!629 = !DILocation(line: 367, column: 10, scope: !628, inlinedAt: !620)
!630 = !DILocation(line: 368, column: 4, scope: !628, inlinedAt: !620)
!631 = !DILocation(line: 371, column: 47, scope: !628, inlinedAt: !620)
!632 = !DILocation(line: 371, column: 10, scope: !628, inlinedAt: !620)
!633 = !DILocation(line: 372, column: 4, scope: !628, inlinedAt: !620)
!634 = !DILocation(line: 375, column: 10, scope: !628, inlinedAt: !620)
