; ModuleID = 'xz/options.c'
source_filename = "xz/options.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.option_map = type { ptr, ptr, i64, i64 }
%struct.name_id_map = type { ptr, i64 }

@options_delta.opts = internal constant [2 x %struct.option_map] [%struct.option_map { ptr @.str, ptr null, i64 1, i64 256 }, %struct.option_map zeroinitializer], align 16, !dbg !0
@.str = private unnamed_addr constant [5 x i8] c"dist\00", align 1, !dbg !69
@options_bcj.opts = internal constant [2 x %struct.option_map] [%struct.option_map { ptr @.str.1, ptr null, i64 0, i64 4294967295 }, %struct.option_map zeroinitializer], align 16, !dbg !79
@.str.1 = private unnamed_addr constant [6 x i8] c"start\00", align 1, !dbg !74
@options_lzma.modes = internal constant [3 x %struct.name_id_map] [%struct.name_id_map { ptr @.str.2, i64 1 }, %struct.name_id_map { ptr @.str.3, i64 2 }, %struct.name_id_map zeroinitializer], align 16, !dbg !121
@.str.2 = private unnamed_addr constant [5 x i8] c"fast\00", align 1, !dbg !114
@.str.3 = private unnamed_addr constant [7 x i8] c"normal\00", align 1, !dbg !116

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "opts", scope: !2, file: !3, line: 167, type: !93, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "options_delta", scope: !3, file: !3, line: 165, type: !4, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !32, retainedNodes: !240)
!3 = !DIFile(filename: "xz/options.c", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "0c80b77c8e14162661050690b3287426")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !29}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_delta", file: !8, line: 77, baseType: !9)
!8 = !DIFile(filename: "liblzma/api/lzma/delta.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "397cde14a8f4a544385c9c6ecc7e0cc9")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 45, size: 320, elements: !10)
!10 = !{!11, !17, !22, !23, !24, !25, !26, !28}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !8, line: 47, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_delta_type", file: !8, line: 37, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 35, baseType: !14, size: 32, elements: !15)
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16}
!16 = !DIEnumerator(name: "LZMA_DELTA_TYPE_BYTE", value: 0)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !9, file: !8, line: 59, baseType: !18, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 26, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !21, line: 42, baseType: !14)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!22 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !9, file: !8, line: 70, baseType: !18, size: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !9, file: !8, line: 71, baseType: !18, size: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !9, file: !8, line: 72, baseType: !18, size: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !9, file: !8, line: 73, baseType: !18, size: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !9, file: !8, line: 74, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !9, file: !8, line: 75, baseType: !27, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !33, retainedTypes: !67, globals: !68, splitDebugInlining: false, nameTableKind: None)
!33 = !{!13, !34, !39, !46, !50, !53, !56}
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 138, baseType: !14, size: 32, elements: !36)
!35 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "c59c540efa0aff44f03d71331089fff8")
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!38 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 58, baseType: !14, size: 32, elements: !40)
!40 = !{!41, !42, !43, !44, !45}
!41 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!42 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!43 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!44 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!45 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 44, baseType: !14, size: 32, elements: !48)
!47 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "81a3070447cc5b61b56cfbed076853db")
!48 = !{!49}
!49 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 146, baseType: !14, size: 32, elements: !51)
!51 = !{!52}
!52 = !DIEnumerator(name: "OPT_DIST", value: 0)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 190, baseType: !14, size: 32, elements: !54)
!54 = !{!55}
!55 = !DIEnumerator(name: "OPT_START_OFFSET", value: 0)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 231, baseType: !14, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66}
!58 = !DIEnumerator(name: "OPT_PRESET", value: 0)
!59 = !DIEnumerator(name: "OPT_DICT", value: 1)
!60 = !DIEnumerator(name: "OPT_LC", value: 2)
!61 = !DIEnumerator(name: "OPT_LP", value: 3)
!62 = !DIEnumerator(name: "OPT_PB", value: 4)
!63 = !DIEnumerator(name: "OPT_MODE", value: 5)
!64 = !DIEnumerator(name: "OPT_NICE", value: 6)
!65 = !DIEnumerator(name: "OPT_MF", value: 7)
!66 = !DIEnumerator(name: "OPT_DEPTH", value: 8)
!67 = !{!27}
!68 = !{!69, !0, !74, !79, !114, !116, !121, !170, !175, !177, !179, !181, !183, !186, !188, !190, !193, !195, !197, !199, !201, !203, !205, !210, !215, !220, !225, !230, !235}
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !3, line: 168, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 40, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 5)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(scope: null, file: !3, line: 212, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 48, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 6)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "opts", scope: !81, file: !3, line: 211, type: !93, isLocal: true, isDefinition: true)
!81 = distinct !DISubprogram(name: "options_bcj", scope: !3, file: !3, line: 209, type: !82, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !32, retainedNodes: !90)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !29}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_bcj", file: !86, line: 90, baseType: !87)
!86 = !DIFile(filename: "liblzma/api/lzma/bcj.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "a1035092336f34cf9afafbb05b1edd83")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 73, size: 32, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "start_offset", scope: !87, file: !86, line: 88, baseType: !18, size: 32)
!90 = !{!91, !92}
!91 = !DILocalVariable(name: "str", arg: 1, scope: !81, file: !3, line: 209, type: !29)
!92 = !DILocalVariable(name: "options", scope: !81, file: !3, line: 216, type: !84)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 512, elements: !112)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "option_map", file: !3, line: 31, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 26, size: 256, elements: !97)
!97 = !{!98, !99, !110, !111}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !3, line: 27, baseType: !29, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !96, file: !3, line: 28, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "name_id_map", file: !3, line: 23, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 20, size: 128, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !103, file: !3, line: 21, baseType: !29, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !103, file: !3, line: 22, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !19, line: 27, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !21, line: 45, baseType: !109)
!109 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !96, file: !3, line: 29, baseType: !107, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !96, file: !3, line: 30, baseType: !107, size: 64, offset: 192)
!112 = !{!113}
!113 = !DISubrange(count: 2)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(scope: null, file: !3, line: 320, type: !71, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !3, line: 321, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 56, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 7)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "modes", scope: !123, file: !3, line: 319, type: !167, isLocal: true, isDefinition: true)
!123 = distinct !DISubprogram(name: "options_lzma", scope: !3, file: !3, line: 317, type: !124, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !32, retainedNodes: !162)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !29}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !35, line: 399, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 185, size: 896, elements: !129)
!129 = !{!130, !131, !137, !138, !139, !140, !141, !143, !144, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !157, !158, !159, !160, !161}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !128, file: !35, line: 217, baseType: !18, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !128, file: !35, line: 240, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 24, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !21, line: 38, baseType: !136)
!136 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !128, file: !35, line: 254, baseType: !18, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !128, file: !35, line: 281, baseType: !18, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !128, file: !35, line: 293, baseType: !18, size: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !128, file: !35, line: 316, baseType: !18, size: 32, offset: 224)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !128, file: !35, line: 322, baseType: !142, size: 32, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !35, line: 155, baseType: !34)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !128, file: !35, line: 342, baseType: !18, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !128, file: !35, line: 345, baseType: !145, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !35, line: 111, baseType: !39)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !128, file: !35, line: 375, baseType: !18, size: 32, offset: 352)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !128, file: !35, line: 384, baseType: !18, size: 32, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !128, file: !35, line: 385, baseType: !18, size: 32, offset: 416)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !128, file: !35, line: 386, baseType: !18, size: 32, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !128, file: !35, line: 387, baseType: !18, size: 32, offset: 480)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !128, file: !35, line: 388, baseType: !18, size: 32, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !128, file: !35, line: 389, baseType: !18, size: 32, offset: 544)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !128, file: !35, line: 390, baseType: !18, size: 32, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !128, file: !35, line: 391, baseType: !18, size: 32, offset: 608)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !128, file: !35, line: 392, baseType: !156, size: 32, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !47, line: 46, baseType: !46)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !128, file: !35, line: 393, baseType: !156, size: 32, offset: 672)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !128, file: !35, line: 394, baseType: !156, size: 32, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !128, file: !35, line: 395, baseType: !156, size: 32, offset: 736)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !128, file: !35, line: 396, baseType: !27, size: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !128, file: !35, line: 397, baseType: !27, size: 64, offset: 832)
!162 = !{!163, !164, !165}
!163 = !DILocalVariable(name: "str", arg: 1, scope: !123, file: !3, line: 317, type: !29)
!164 = !DILocalVariable(name: "options", scope: !123, file: !3, line: 348, type: !126)
!165 = !DILocalVariable(name: "nice_len_min", scope: !123, file: !3, line: 357, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 384, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 3)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !3, line: 326, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 4)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !3, line: 327, type: !172, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !3, line: 328, type: !172, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !3, line: 329, type: !172, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !3, line: 330, type: !172, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "mfs", scope: !123, file: !3, line: 325, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 768, elements: !77)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !3, line: 335, type: !118, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !3, line: 336, type: !71, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !3, line: 338, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, elements: !168)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !3, line: 339, type: !192, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !3, line: 340, type: !192, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !3, line: 341, type: !71, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !3, line: 342, type: !71, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !3, line: 343, type: !192, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !3, line: 344, type: !76, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "opts", scope: !123, file: !3, line: 334, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 2560, elements: !208)
!208 = !{!209}
