; ModuleID = 'spec.c'
source_filename = "spec.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [46 x i8] c"main: Error mallocing memory for SHA-%d sum!\0A\00", align 1, !dbg !0
@stderr = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [76 x i8] c"Error: Supplied original hash value is not the correct length to be SHA-%d\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [127 x i8] c"Usage: %s <input filename> <input size> <input raw SHA-%d> <compressed minimum> <compressed maximum> <compression level, ...>\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [41 x i8] c"SPEC CPU XZ driver: input=%s insize=%ld\0A\00", align 1, !dbg !17
@spec_fd = external local_unnamed_addr global ptr, align 8
@.str.4 = private unnamed_addr constant [45 x i8] c"Error allocating in-memory file descriptors\0A\00", align 1, !dbg !22
@.str.6 = private unnamed_addr constant [32 x i8] c"Input data %ld bytes in length\0A\00", align 1, !dbg !27
@.str.7 = private unnamed_addr constant [44 x i8] c"Error: compression level '%s' is not valid\0A\00", align 1, !dbg !32
@.str.8 = private unnamed_addr constant [36 x i8] c"Compressing Input Data, level %d%s\0A\00", align 1, !dbg !37
@.str.9 = private unnamed_addr constant [11 x i8] c" (extreme)\00", align 1, !dbg !42

!278 = !DILocation(line: 122, column: 48, scope: !273)
!279 = !DILocation(line: 123, column: 17, scope: !280)
!280 = distinct !DILexicalBlock(scope: !273, file: !2, line: 122, column: 85)
!281 = !DILocation(line: 124, column: 15, scope: !282)
!282 = distinct !DILexicalBlock(scope: !280, file: !2, line: 123, column: 17)
!283 = !DILocation(line: 127, column: 15, scope: !282)
!284 = !DILocation(line: 130, column: 17, scope: !285)
!285 = distinct !DILexicalBlock(scope: !273, file: !2, line: 129, column: 18)
!286 = !DILocation(line: 131, column: 15, scope: !287)
!287 = distinct !DILexicalBlock(scope: !285, file: !2, line: 130, column: 17)
!288 = !DILocation(line: 134, column: 15, scope: !287)
!289 = !DILocation(line: 138, column: 9, scope: !249)
!290 = !DILocation(line: 150, column: 9, scope: !249)
!291 = !DILocation(line: 151, column: 9, scope: !249)
!292 = !DILocation(line: 153, column: 9, scope: !249)
!293 = !DILocation(line: 154, column: 9, scope: !249)
!294 = !DILocation(line: 155, column: 9, scope: !249)
!295 = !DILocation(line: 156, column: 9, scope: !249)
!296 = !DILocation(line: 157, column: 67, scope: !249)
!297 = !DILocation(line: 157, column: 78, scope: !249)
!298 = !DILocation(line: 157, column: 9, scope: !249)
!299 = !DILocation(line: 169, column: 9, scope: !300)
!300 = distinct !DILexicalBlock(scope: !249, file: !2, line: 169, column: 9)
!301 = !DILocation(line: 170, column: 13, scope: !302)
!302 = distinct !DILexicalBlock(scope: !249, file: !2, line: 170, column: 13)
!303 = !DILocation(line: 170, column: 13, scope: !249)
!304 = !DILocation(line: 171, column: 13, scope: !305)
!305 = distinct !DILexicalBlock(scope: !302, file: !2, line: 170, column: 57)
!306 = !DILocation(line: 172, column: 13, scope: !305)
!307 = !DILocation(line: 173, column: 23, scope: !305)
!308 = !DILocation(line: 173, column: 13, scope: !305)
!309 = !DILocation(line: 174, column: 13, scope: !305)
!310 = !DILocation(line: 175, column: 13, scope: !305)
!311 = !DILocation(line: 176, column: 23, scope: !305)
!312 = !DILocation(line: 176, column: 13, scope: !305)
!313 = !DILocation(line: 177, column: 13, scope: !305)
!314 = !DILocation(line: 178, column: 13, scope: !305)
!315 = !DILocation(line: 180, column: 9, scope: !249)
!316 = !DILocation(line: 181, column: 9, scope: !249)
!317 = !DILocation(line: 182, column: 9, scope: !249)
!318 = !DILocation(line: 183, column: 9, scope: !249)
!319 = !DILocation(line: 184, column: 9, scope: !249)
!320 = !DILocation(line: 185, column: 16, scope: !249)
!321 = !DILocation(line: 185, column: 9, scope: !249)
!322 = !DILocation(line: 100, column: 27, scope: !245)
!323 = distinct !{!323, !247, !324}
!324 = !DILocation(line: 186, column: 5, scope: !246)
!325 = !DILocation(line: 188, column: 5, scope: !138)
!326 = !DISubprogram(name: "malloc", scope: !327, file: !327, line: 540, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!327 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!328 = !DISubroutineType(types: !329)
!329 = !{!103, !330}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !331, line: 18, baseType: !332)
!331 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!332 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!333 = !DISubprogram(name: "printf", scope: !334, file: !334, line: 356, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!335 = !DISubroutineType(types: !336)
!336 = !{!141, !337, null}
!337 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!340 = !DISubprogram(name: "exit", scope: !327, file: !327, line: 624, type: !341, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !141}
!343 = !DISubprogram(name: "strtol", scope: !327, file: !327, line: 177, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!344 = !DISubroutineType(types: !345)
!345 = !{!156, !337, !346, !141}
!346 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !142)
!347 = !DISubprogram(name: "strlen", scope: !348, file: !348, line: 407, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!348 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!349 = !DISubroutineType(types: !350)
!350 = !{!332, !338}
!351 = !DISubprogram(name: "fprintf", scope: !334, file: !334, line: 350, type: !352, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!352 = !DISubroutineType(types: !353)
!353 = !{!141, !354, !337, null}
!354 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !357, line: 7, baseType: !358)
!357 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !359, line: 49, size: 1728, elements: !360)
!359 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !376, !378, !379, !380, !382, !384, !386, !387, !390, !392, !395, !398, !399, !400, !401, !402}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !358, file: !359, line: 51, baseType: !141, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !358, file: !359, line: 54, baseType: !143, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !358, file: !359, line: 55, baseType: !143, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !358, file: !359, line: 56, baseType: !143, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !358, file: !359, line: 57, baseType: !143, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !358, file: !359, line: 58, baseType: !143, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !358, file: !359, line: 59, baseType: !143, size: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !358, file: !359, line: 60, baseType: !143, size: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !358, file: !359, line: 61, baseType: !143, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !358, file: !359, line: 64, baseType: !143, size: 64, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !358, file: !359, line: 65, baseType: !143, size: 64, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !358, file: !359, line: 66, baseType: !143, size: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !358, file: !359, line: 68, baseType: !374, size: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !359, line: 36, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !358, file: !359, line: 70, baseType: !377, size: 64, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !358, file: !359, line: 72, baseType: !141, size: 32, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !358, file: !359, line: 73, baseType: !141, size: 32, offset: 928)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !358, file: !359, line: 74, baseType: !381, size: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !155, line: 152, baseType: !156)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !358, file: !359, line: 77, baseType: !383, size: 16, offset: 1024)
!383 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !358, file: !359, line: 78, baseType: !385, size: 8, offset: 1040)
!385 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !358, file: !359, line: 79, baseType: !49, size: 8, offset: 1048)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !358, file: !359, line: 81, baseType: !388, size: 64, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !359, line: 43, baseType: null)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !358, file: !359, line: 89, baseType: !391, size: 64, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !155, line: 153, baseType: !156)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !358, file: !359, line: 91, baseType: !393, size: 64, offset: 1216)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !359, line: 37, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !358, file: !359, line: 92, baseType: !396, size: 64, offset: 1280)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !359, line: 38, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !358, file: !359, line: 93, baseType: !377, size: 64, offset: 1344)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !358, file: !359, line: 94, baseType: !103, size: 64, offset: 1408)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !358, file: !359, line: 95, baseType: !330, size: 64, offset: 1472)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !358, file: !359, line: 96, baseType: !141, size: 32, offset: 1536)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !358, file: !359, line: 98, baseType: !107, size: 160, offset: 1568)
!403 = !DISubprogram(name: "sum_str_to_hex", scope: !404, file: !404, line: 68, type: !405, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!404 = !DIFile(filename: "spec_mem_io/spec_mem_io.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "20f82235716911ab040d2b344ceb3e0d")
!405 = !DISubroutineType(types: !406)
!406 = !{!101, !143, !141}
!407 = !DISubprogram(name: "spec_mem_alloc_fds", scope: !404, file: !404, line: 43, type: !408, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!408 = !DISubroutineType(types: !409)
!409 = !{!410, !150}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_fd_t", file: !404, line: 40, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 34, size: 320, elements: !413)
!413 = !{!414, !415, !416, !417, !418}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !412, file: !404, line: 35, baseType: !152, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !412, file: !404, line: 36, baseType: !152, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !412, file: !404, line: 37, baseType: !152, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !412, file: !404, line: 38, baseType: !141, size: 32, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !412, file: !404, line: 39, baseType: !101, size: 64, offset: 256)
!419 = !DISubprogram(name: "spec_mem_init", scope: !404, file: !404, line: 48, type: !420, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!420 = !DISubroutineType(types: !421)
!421 = !{!141, !410, !150, !150}
!422 = !DISubprogram(name: "debug_time", scope: !404, file: !404, line: 66, type: !423, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!423 = !DISubroutineType(types: !424)
!424 = !{!141}
!425 = !DISubprogram(name: "spec_mem_load", scope: !404, file: !404, line: 49, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!426 = !DISubroutineType(types: !427)
!427 = !{!101, !410, !150, !141, !143, !152, !141, !101, !141}
!428 = !DISubprogram(name: "spec_initbufs", scope: !404, file: !404, line: 45, type: !429, spFlags: DISPFlagOptimized)
!429 = !DISubroutineType(types: !430)
!430 = !{null}
!431 = !DISubprogram(name: "spec_compress", scope: !404, file: !404, line: 46, type: !432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !141, !141, !150}
!434 = !DISubprogram(name: "spec_mem_reset", scope: !404, file: !404, line: 53, type: !435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!435 = !DISubroutineType(types: !436)
!436 = !{!141, !410, !150, !141}
!437 = !DISubprogram(name: "spec_mem_rewind", scope: !404, file: !404, line: 61, type: !435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubprogram(name: "spec_uncompress", scope: !404, file: !404, line: 47, type: !439, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !141, !141}
!441 = !DISubprogram(name: "spec_mem_sum", scope: !404, file: !404, line: 70, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!101, !410, !101, !141}
!444 = !DISubprogram(name: "compare_sum", scope: !404, file: !404, line: 67, type: !445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubroutineType(types: !446)
!446 = !{!141, !101, !101, !141}
!447 = !DISubprogram(name: "print_sum", scope: !404, file: !404, line: 69, type: !448, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !355, !101, !141}
!450 = !DISubprogram(name: "fflush", scope: !334, file: !334, line: 230, type: !451, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!451 = !DISubroutineType(types: !452)
!452 = !{!141, !355}
