; ModuleID = 'spec_xz.c'
source_filename = "spec_xz.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_filter = type { i64, ptr }
%struct.lzma_options_lzma = type { i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.lzma_stream = type { ptr, i64, i64, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i32, i32 }

@.str.5 = private unnamed_addr constant [25 x i8] c"Memory allocation failed\00", align 1, !dbg !0
@.str.6 = private unnamed_addr constant [34 x i8] c"Specified preset is not supported\00", align 1, !dbg !7
@.str.7 = private unnamed_addr constant [14 x i8] c"Unknown error\00", align 1, !dbg !12
@.str.8 = private unnamed_addr constant [66 x i8] c"Error initializing encoder with preset=%u check=%u: %s (code %u)\0A\00", align 1, !dbg !17
@spec_fd = external local_unnamed_addr global ptr, align 8
@.str.9 = private unnamed_addr constant [34 x i8] c"Decompress write error on %d: %s\0A\00", align 1, !dbg !22
@.str.10 = private unnamed_addr constant [23 x i8] c"Input not in XZ format\00", align 1, !dbg !24
@.str.11 = private unnamed_addr constant [32 x i8] c"Unsupported compression options\00", align 1, !dbg !29
@.str.12 = private unnamed_addr constant [27 x i8] c"Compressed data is corrupt\00", align 1, !dbg !34

!112 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!113 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!114 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!115 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!116 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!117 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 250, baseType: !82, size: 32, elements: !119)
!119 = !{!120, !121, !122, !123}
!120 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!121 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!122 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!123 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!124 = !{!125, !82, !126}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 18, baseType: !128)
!127 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!128 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!129 = !{!130, !135, !137, !139, !144, !0, !7, !12, !17, !22, !24, !29, !34, !39, !44, !49, !54, !56, !61, !66, !149, !154, !159, !161, !166, !71, !73}
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 31)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 96, type: !31, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !31, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 33)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 47)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 37, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 6)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 7)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !156, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !2, line: 46, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 8)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !9, isLocal: true, isDefinition: true)
!168 = !{i32 7, !"Dwarf Version", i32 5}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{i32 1, !"wchar_size", i32 4}
!171 = !{i32 8, !"PIC Level", i32 2}
!172 = !{i32 7, !"PIE Level", i32 2}
!173 = !{i32 7, !"uwtable", i32 2}
!174 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!175 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!176 = distinct !DISubprogram(name: "init_encoder", scope: !2, file: !2, line: 68, type: !177, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !78, retainedNodes: !262)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !180, !229, !234, !261}
!179 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !81, line: 490, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 453, size: 1088, elements: !183)
!183 = !{!184, !192, !193, !196, !198, !199, !200, !214, !218, !219, !220, !221, !222, !223, !224, !225, !226, !228}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !182, file: !81, line: 454, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !188, line: 24, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !190, line: 38, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !182, file: !81, line: 455, baseType: !126, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !182, file: !81, line: 456, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !188, line: 27, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !190, line: 45, baseType: !128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !182, file: !81, line: 458, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !182, file: !81, line: 459, baseType: !126, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !182, file: !81, line: 460, baseType: !194, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !182, file: !81, line: 468, baseType: !201, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !81, line: 403, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 341, size: 192, elements: !204)
!204 = !{!205, !209, !213}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !203, file: !81, line: 376, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!125, !125, !126, !126}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !203, file: !81, line: 390, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !125, !125}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !203, file: !81, line: 401, baseType: !125, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !182, file: !81, line: 471, baseType: !215, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !81, line: 411, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !81, line: 411, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !182, file: !81, line: 479, baseType: !125, size: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !182, file: !81, line: 480, baseType: !125, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !182, file: !81, line: 481, baseType: !125, size: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !182, file: !81, line: 482, baseType: !125, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !182, file: !81, line: 483, baseType: !194, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !182, file: !81, line: 484, baseType: !194, size: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !182, file: !81, line: 485, baseType: !126, size: 64, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !182, file: !81, line: 486, baseType: !126, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !182, file: !81, line: 487, baseType: !227, size: 32, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !81, line: 46, baseType: !80)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !182, file: !81, line: 488, baseType: !227, size: 32, offset: 1056)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !86, line: 399, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 185, size: 896, elements: !232)
!232 = !{!233, !236, !237, !238, !239, !240, !241, !243, !244, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !231, file: !86, line: 217, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !188, line: 26, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !190, line: 42, baseType: !82)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !231, file: !86, line: 240, baseType: !185, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !231, file: !86, line: 254, baseType: !234, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !231, file: !86, line: 281, baseType: !234, size: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !231, file: !86, line: 293, baseType: !234, size: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !231, file: !86, line: 316, baseType: !234, size: 32, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !231, file: !86, line: 322, baseType: !242, size: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !86, line: 155, baseType: !85)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !231, file: !86, line: 342, baseType: !234, size: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !231, file: !86, line: 345, baseType: !245, size: 32, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !86, line: 111, baseType: !90)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !231, file: !86, line: 375, baseType: !234, size: 32, offset: 352)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !231, file: !86, line: 384, baseType: !234, size: 32, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !231, file: !86, line: 385, baseType: !234, size: 32, offset: 416)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !231, file: !86, line: 386, baseType: !234, size: 32, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !231, file: !86, line: 387, baseType: !234, size: 32, offset: 480)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !231, file: !86, line: 388, baseType: !234, size: 32, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !231, file: !86, line: 389, baseType: !234, size: 32, offset: 544)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !231, file: !86, line: 390, baseType: !234, size: 32, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !231, file: !86, line: 391, baseType: !234, size: 32, offset: 608)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !231, file: !86, line: 392, baseType: !227, size: 32, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !231, file: !86, line: 393, baseType: !227, size: 32, offset: 672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !231, file: !86, line: 394, baseType: !227, size: 32, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !231, file: !86, line: 395, baseType: !227, size: 32, offset: 736)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !231, file: !86, line: 396, baseType: !125, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !231, file: !86, line: 397, baseType: !125, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !98, line: 55, baseType: !97)
!262 = !{!263, !264, !265, !266, !267, !270, !282, !283}
!263 = !DILocalVariable(name: "strm", arg: 1, scope: !176, file: !2, line: 68, type: !180)
!264 = !DILocalVariable(name: "options", arg: 2, scope: !176, file: !2, line: 68, type: !229)
!265 = !DILocalVariable(name: "preset", arg: 3, scope: !176, file: !2, line: 68, type: !234)
!266 = !DILocalVariable(name: "check", arg: 4, scope: !176, file: !2, line: 68, type: !261)
!267 = !DILocalVariable(name: "msg", scope: !176, file: !2, line: 69, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!270 = !DILocalVariable(name: "filters", scope: !176, file: !2, line: 70, type: !271)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 640, elements: !280)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !273, line: 65, baseType: !274)
!273 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "5eb86d86854a7619ed1d1ac1b57b2484")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 43, size: 128, elements: !275)
!275 = !{!276, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !274, file: !273, line: 54, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !278, line: 63, baseType: !194)
!278 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "e1aa51527ce08aa260777d4fb351a0b7")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !274, file: !273, line: 63, baseType: !125, size: 64, offset: 64)
!280 = !{!281}
!281 = !DISubrange(count: 5)
!282 = !DILocalVariable(name: "lzma_local_options", scope: !176, file: !2, line: 71, type: !230)
!283 = !DILocalVariable(name: "rc", scope: !176, file: !2, line: 83, type: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !81, line: 237, baseType: !104)
!285 = distinct !DIAssignID()
!286 = !DILocation(line: 0, scope: !176)
!287 = distinct !DIAssignID()
!288 = !DILocation(line: 70, column: 5, scope: !176)
!289 = !DILocation(line: 71, column: 5, scope: !176)
!290 = !DILocation(line: 72, column: 17, scope: !291)
!291 = distinct !DILexicalBlock(scope: !176, file: !2, line: 72, column: 9)
!292 = !DILocation(line: 72, column: 9, scope: !176)
!293 = !DILocation(line: 75, column: 29, scope: !294)
!294 = distinct !DILexicalBlock(scope: !176, file: !2, line: 75, column: 9)
!295 = !DILocation(line: 75, column: 9, scope: !176)
!296 = !DILocation(line: 78, column: 5, scope: !176)
!297 = !DILocation(line: 79, column: 19, scope: !176)
!298 = distinct !DIAssignID()
!299 = !DILocation(line: 80, column: 16, scope: !176)
!300 = !DILocation(line: 80, column: 24, scope: !176)
!301 = distinct !DIAssignID()
!302 = !DILocation(line: 81, column: 5, scope: !176)
!303 = !DILocation(line: 81, column: 19, scope: !176)
!304 = distinct !DIAssignID()
!305 = !DILocation(line: 83, column: 19, scope: !176)
!306 = !DILocation(line: 85, column: 5, scope: !176)
!307 = !DILocation(line: 89, column: 20, scope: !308)
!308 = distinct !DILexicalBlock(scope: !176, file: !2, line: 85, column: 16)
!309 = !DILocation(line: 0, scope: !310)
!310 = distinct !DILexicalBlock(scope: !308, file: !2, line: 89, column: 42)
!311 = !DILocation(line: 113, column: 13, scope: !308)
!312 = !DILocation(line: 116, column: 13, scope: !308)
!313 = !DILocation(line: 0, scope: !308)
!314 = !DILocation(line: 118, column: 5, scope: !176)
!315 = !DILocation(line: 119, column: 5, scope: !176)
!316 = !DILocation(line: 120, column: 1, scope: !176)
!317 = !DISubprogram(name: "lzma_lzma_preset", scope: !86, file: !86, line: 419, type: !318, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubroutineType(types: !319)
!319 = !{!320, !229, !234}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !81, line: 29, baseType: !191)
!321 = !DISubprogram(name: "lzma_stream_encoder", scope: !322, file: !322, line: 188, type: !323, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DIFile(filename: "liblzma/api/lzma/container.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "7f878de3abe07c50108c7f7da139bedb")
!323 = !DISubroutineType(types: !324)
!324 = !{!284, !180, !325, !261}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!327 = !DISubprogram(name: "lzma_get_check", scope: !98, file: !98, line: 149, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!328 = !DISubroutineType(types: !329)
!329 = !{!261, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!332 = !DISubprogram(name: "printf", scope: !333, file: !333, line: 356, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!333 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!334 = !DISubroutineType(types: !335)
!335 = !{!336, !337, null}
!336 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!337 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !268)
!338 = distinct !DISubprogram(name: "uncompressStream", scope: !2, file: !2, line: 122, type: !339, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !78, retainedNodes: !341)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !336, !336}
!341 = !{!342, !343, !344, !345, !347, !351, !352, !354, !357}
!342 = !DILocalVariable(name: "zStream", arg: 1, scope: !338, file: !2, line: 122, type: !336)
!343 = !DILocalVariable(name: "stream", arg: 2, scope: !338, file: !2, line: 122, type: !336)
!344 = !DILocalVariable(name: "strm", scope: !338, file: !2, line: 123, type: !181)
!345 = !DILocalVariable(name: "action", scope: !338, file: !2, line: 124, type: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !81, line: 322, baseType: !118)
!347 = !DILocalVariable(name: "in", scope: !338, file: !2, line: 126, type: !348)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 65536, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 8192)
!351 = !DILocalVariable(name: "out", scope: !338, file: !2, line: 127, type: !348)
!352 = !DILocalVariable(name: "rc", scope: !353, file: !2, line: 152, type: !284)
!353 = distinct !DILexicalBlock(scope: !338, file: !2, line: 141, column: 17)
!354 = !DILocalVariable(name: "write_size", scope: !355, file: !2, line: 155, type: !126)
!355 = distinct !DILexicalBlock(scope: !356, file: !2, line: 154, column: 59)
!356 = distinct !DILexicalBlock(scope: !353, file: !2, line: 154, column: 13)
!357 = !DILocalVariable(name: "msg", scope: !358, file: !2, line: 166, type: !268)
!358 = distinct !DILexicalBlock(scope: !359, file: !2, line: 165, column: 28)
!359 = distinct !DILexicalBlock(scope: !353, file: !2, line: 165, column: 13)
!360 = distinct !DIAssignID()
!361 = !DILocation(line: 0, scope: !338)
!362 = distinct !DIAssignID()
!363 = distinct !DIAssignID()
!364 = !DILocation(line: 123, column: 5, scope: !338)
!365 = !DILocation(line: 123, column: 17, scope: !338)
!366 = distinct !DIAssignID()
!367 = !DILocation(line: 126, column: 5, scope: !338)
!368 = !DILocation(line: 127, column: 5, scope: !338)
!369 = !DILocalVariable(name: "strm", arg: 1, scope: !370, file: !2, line: 27, type: !180)
!370 = distinct !DISubprogram(name: "init_decoder", scope: !2, file: !2, line: 27, type: !371, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !78, retainedNodes: !373)
!371 = !DISubroutineType(types: !372)
!372 = !{!179, !180}
!373 = !{!369, !374, !375}
!374 = !DILocalVariable(name: "msg", scope: !370, file: !2, line: 28, type: !268)
!375 = !DILocalVariable(name: "rc", scope: !370, file: !2, line: 29, type: !284)
!376 = !DILocation(line: 0, scope: !370, inlinedAt: !377)
!377 = distinct !DILocation(line: 129, column: 10, scope: !378)
!378 = distinct !DILexicalBlock(scope: !338, file: !2, line: 129, column: 9)
!379 = !DILocation(line: 29, column: 19, scope: !370, inlinedAt: !377)
!380 = !DILocation(line: 30, column: 5, scope: !370, inlinedAt: !377)
!381 = !DILocation(line: 34, column: 13, scope: !382, inlinedAt: !377)
!382 = distinct !DILexicalBlock(scope: !370, file: !2, line: 30, column: 16)
!383 = !DILocation(line: 35, column: 20, scope: !382, inlinedAt: !377)
!384 = !DILocation(line: 35, column: 13, scope: !382, inlinedAt: !377)
!385 = !DILocation(line: 41, column: 21, scope: !386, inlinedAt: !377)
!386 = distinct !DILexicalBlock(scope: !382, file: !2, line: 35, column: 42)
!387 = !DILocation(line: 44, column: 21, scope: !386, inlinedAt: !377)
!388 = !DILocation(line: 47, column: 21, scope: !386, inlinedAt: !377)
!389 = !DILocation(line: 50, column: 21, scope: !386, inlinedAt: !377)
!390 = !DILocation(line: 59, column: 13, scope: !382, inlinedAt: !377)
!391 = !DILocation(line: 62, column: 13, scope: !382, inlinedAt: !377)
!392 = !DILocation(line: 0, scope: !382, inlinedAt: !377)
!393 = !DILocation(line: 64, column: 5, scope: !370, inlinedAt: !377)
!394 = !DILocation(line: 129, column: 9, scope: !338)
!395 = !DILocation(line: 0, scope: !386, inlinedAt: !377)
!396 = !DILocation(line: 138, column: 10, scope: !338)
!397 = distinct !DIAssignID()
!398 = !DILocation(line: 139, column: 10, scope: !338)
!399 = !DILocation(line: 138, column: 19, scope: !338)
!400 = !DILocation(line: 139, column: 19, scope: !338)
!401 = distinct !DIAssignID()
!402 = !DILocation(line: 140, column: 10, scope: !338)
!403 = !DILocation(line: 140, column: 20, scope: !338)
!404 = distinct !DIAssignID()
!405 = !DILocation(line: 141, column: 5, scope: !338)
!406 = !DILocation(line: 142, column: 18, scope: !407)
!407 = distinct !DILexicalBlock(scope: !353, file: !2, line: 142, column: 13)
!408 = !DILocation(line: 124, column: 17, scope: !338)
!409 = !DILocation(line: 142, column: 27, scope: !407)
!410 = !DILocation(line: 142, column: 32, scope: !407)
!411 = !DILocation(line: 142, column: 36, scope: !407)
!412 = !DILocation(line: 142, column: 13, scope: !353)
!413 = !DILocation(line: 143, column: 26, scope: !414)
!414 = distinct !DILexicalBlock(scope: !407, file: !2, line: 142, column: 51)
!415 = distinct !DIAssignID()
!416 = !DILocation(line: 144, column: 29, scope: !414)
!417 = !DILocation(line: 144, column: 27, scope: !414)
!418 = distinct !DIAssignID()
!419 = !DILocation(line: 146, column: 17, scope: !420)
!420 = distinct !DILexicalBlock(scope: !414, file: !2, line: 146, column: 17)
!421 = !DILocation(line: 146, column: 17, scope: !414)
!422 = !DILocation(line: 152, column: 23, scope: !353)
!423 = !DILocation(line: 0, scope: !353)
!424 = !DILocation(line: 154, column: 18, scope: !356)
!425 = !DILocation(line: 154, column: 28, scope: !356)
!426 = !DILocation(line: 154, column: 33, scope: !356)
!427 = !DILocation(line: 155, column: 45, scope: !355)
!428 = !DILocation(line: 0, scope: !355)
!429 = !DILocation(line: 156, column: 25, scope: !430)
!430 = distinct !DILexicalBlock(scope: !355, file: !2, line: 156, column: 17)
!431 = !DILocation(line: 156, column: 60, scope: !430)
!432 = !DILocation(line: 156, column: 17, scope: !355)
!433 = !DILocation(line: 161, column: 27, scope: !355)
!434 = distinct !DIAssignID()
!435 = !DILocation(line: 162, column: 28, scope: !355)
!436 = distinct !DIAssignID()
!437 = !DILocation(line: 157, column: 79, scope: !438)
!438 = distinct !DILexicalBlock(scope: !430, file: !2, line: 156, column: 75)
!439 = !DILocation(line: 157, column: 70, scope: !438)
!440 = !DILocation(line: 157, column: 17, scope: !438)
!441 = !DILocation(line: 165, column: 13, scope: !353)
!442 = distinct !{!442, !405, !443}
!443 = !DILocation(line: 195, column: 5, scope: !338)
!444 = !DILocation(line: 170, column: 21, scope: !445)
!445 = distinct !DILexicalBlock(scope: !358, file: !2, line: 167, column: 24)
!446 = !DILocation(line: 171, column: 21, scope: !445)
!447 = !DILocation(line: 192, column: 13, scope: !358)
!448 = !DILocation(line: 0, scope: !445)
!449 = !DILocation(line: 0, scope: !358)
!450 = !DILocation(line: 193, column: 13, scope: !358)
!451 = !DILocation(line: 202, column: 1, scope: !338)
!452 = !DISubprogram(name: "spec_mem_feof", scope: !453, file: !453, line: 63, type: !454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!453 = !DIFile(filename: "spec_mem_io/spec_mem_io.h", directory: "/home/yjs/workspace/xz-test/src", checksumkind: CSK_MD5, checksum: "20f82235716911ab040d2b344ceb3e0d")
!454 = !DISubroutineType(types: !455)
!455 = !{!336, !456, !82, !336}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_fd_t", file: !453, line: 40, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 34, size: 320, elements: !459)
!459 = !{!460, !465, !466, !467, !468}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !458, file: !453, line: 35, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !462, line: 27, baseType: !463)
!462 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !190, line: 44, baseType: !464)
!464 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !458, file: !453, line: 36, baseType: !461, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !458, file: !453, line: 37, baseType: !461, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !458, file: !453, line: 38, baseType: !336, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !458, file: !453, line: 39, baseType: !469, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!470 = !DISubprogram(name: "spec_mem_fread", scope: !453, file: !453, line: 59, type: !471, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DISubroutineType(types: !472)
!472 = !{!461, !456, !82, !469, !461, !336, !336}
!473 = !DISubprogram(name: "lzma_code", scope: !81, file: !81, line: 529, type: !474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!474 = !DISubroutineType(types: !475)
!475 = !{!284, !180, !346}
!476 = !DISubprogram(name: "spec_mem_fwrite", scope: !453, file: !453, line: 60, type: !471, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!477 = !DISubprogram(name: "strerror", scope: !478, file: !478, line: 419, type: !479, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!478 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !336}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!482 = !DISubprogram(name: "__errno_location", scope: !483, file: !483, line: 37, type: !484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!483 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!484 = !DISubroutineType(types: !485)
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!487 = !DISubprogram(name: "lzma_end", scope: !81, file: !81, line: 546, type: !488, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !180}
!490 = distinct !DISubprogram(name: "compressStream", scope: !2, file: !2, line: 205, type: !491, scopeLine: 205, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !78, retainedNodes: !493)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !336, !336, !234}
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !504, !507}
!494 = !DILocalVariable(name: "stream", arg: 1, scope: !490, file: !2, line: 205, type: !336)
!495 = !DILocalVariable(name: "zStream", arg: 2, scope: !490, file: !2, line: 205, type: !336)
!496 = !DILocalVariable(name: "preset", arg: 3, scope: !490, file: !2, line: 205, type: !234)
!497 = !DILocalVariable(name: "strm", scope: !490, file: !2, line: 206, type: !181)
!498 = !DILocalVariable(name: "action", scope: !490, file: !2, line: 207, type: !346)
!499 = !DILocalVariable(name: "in", scope: !490, file: !2, line: 209, type: !348)
!500 = !DILocalVariable(name: "out", scope: !490, file: !2, line: 210, type: !348)
!501 = !DILocalVariable(name: "check", scope: !490, file: !2, line: 215, type: !261)
!502 = !DILocalVariable(name: "rc", scope: !503, file: !2, line: 240, type: !284)
!503 = distinct !DILexicalBlock(scope: !490, file: !2, line: 229, column: 17)
!504 = !DILocalVariable(name: "write_size", scope: !505, file: !2, line: 243, type: !126)
!505 = distinct !DILexicalBlock(scope: !506, file: !2, line: 242, column: 59)
!506 = distinct !DILexicalBlock(scope: !503, file: !2, line: 242, column: 13)
!507 = !DILocalVariable(name: "msg", scope: !508, file: !2, line: 254, type: !268)
!508 = distinct !DILexicalBlock(scope: !509, file: !2, line: 253, column: 28)
!509 = distinct !DILexicalBlock(scope: !503, file: !2, line: 253, column: 13)
!510 = distinct !DIAssignID()
!511 = !DILocation(line: 0, scope: !176, inlinedAt: !512)
!512 = distinct !DILocation(line: 217, column: 10, scope: !513)
!513 = distinct !DILexicalBlock(scope: !490, file: !2, line: 217, column: 9)
!514 = distinct !DIAssignID()
!515 = distinct !DIAssignID()
!516 = !DILocation(line: 0, scope: !490)
!517 = distinct !DIAssignID()
!518 = distinct !DIAssignID()
!519 = !DILocation(line: 206, column: 5, scope: !490)
